{
  "version": 1,
  "date": "2026-02-12",
  "packId": "incredibles",
  "puzzle": {
    "targetLine": {
      "character": "ELASTIGIRL",
      "text": "Gotcha!",
      "movie": "Incredibles 2"
    },
    "contextBefore": {
      "character": "SCREENSLAVER",
      "text": "Don't bother watching the rest."
    },
    "contextAfter": [
      {
        "character": "SCREENSLAVER",
        "text": "Elastigirl doesn't save the day. She only postpones her defeat. And while she postpones her defeat you eat chips and watch her confront problems that you are too lazy to deal with. Superheroes are part of your brainless desire to replace true experience with simulation. You don't talk, you watch talk shows. You don't play games, you watch game shows."
      },
      {
        "character": "SCREENSLAVER",
        "text": "Travel, relationships, risk every meaningful experience must be packaged and delivered to you to watch at a distance. So that you can remain ever sheltered ever passive ever ravenous consumers who can't bring themselves to rise from their couches break a sweat and participate in life. You want superheroes to protect you and make yourselves ever more powerless in the process."
      },
      {
        "character": "SCREENSLAVER",
        "text": "While you tell yourselves you're being looked after. That your interests are being served. And your rights are being upheld. So that the system can keep stealing from you smiling at you all the while. Go ahead, send your Supers to stop me. Grab your snacks, watch your screens, and see what happens. You are no longer in control. I am."
      }
    ]
  },
  "metadata": {
    "movies": [
      "The Incredibles",
      "Incredibles 2"
    ],
    "movieYears": {
      "The Incredibles": 2004,
      "Incredibles 2": 2018
    },
    "charactersByMovie": {
      "The Incredibles": [
        "BERNIE",
        "BOB",
        "BOB (MR. INCREDIBLE)",
        "DASH",
        "E",
        "FROZONE",
        "GUARD",
        "HELEN",
        "HELEN (ELASTIGIRL)",
        "HUPH",
        "KARI",
        "LUCIUS",
        "MIRAGE",
        "POLICE OFFICER",
        "SYNDROME",
        "TONY",
        "VIOLET"
      ],
      "Incredibles 2": [
        "AMBASSADOR",
        "BOB",
        "DASH",
        "EDNA",
        "ELASTIGIRL",
        "EVELYN",
        "FROZONE",
        "HELEN",
        "LUCIUS",
        "MR. INCREDIBLE",
        "RICK",
        "SCREENSLAVER",
        "TONY",
        "UNDERMINER",
        "VIOLET",
        "VOYD",
        "WINSTON"
      ]
    }
  }
}