{
  "id": "back-to-the-future-part-iii",
  "title": "Back to the Future Part III",
  "year": null,
  "characters": [
    "1955 DOC",
    "BARBWIRE SALESMAN",
    "BARBWIRE SALESMAN’S COMPANION",
    "BARTENDER",
    "BIFF",
    "BUFORD",
    "CHESTER",
    "CLARA",
    "CLERK",
    "COLT GUN SALESMAN",
    "DAVE",
    "DEPUTY",
    "DOC",
    "ENGINEER",
    "GANG LEADER",
    "GANG MEMBER",
    "GANG MEMBER #1",
    "GANG MEMBER #2",
    "GANG MEMBER #3",
    "GEORGE",
    "GOOD LUCK",
    "JEB",
    "JENNIFER",
    "LEVI",
    "LINDA",
    "LITTLE BOY",
    "LORRAINE",
    "MAGGIE",
    "MAN",
    "MAN #1",
    "MAN #2",
    "MAN OUTSIDE",
    "MARTY",
    "MAYOR HUBERT",
    "NEEDLES",
    "PHOTOGRAPHER",
    "SEAMUS",
    "STRICKLAND",
    "STRICKLAND'S SON",
    "TOOTHLESS",
    "TOWNSPEOPLE",
    "TV",
    "UNDERTAKER",
    "VOICE",
    "WAGON DRIVER",
    "WANG",
    "ZEKE",
    "ZZ TOP MEMBER"
  ],
  "lines": [
    {
      "character": "MARTY",
      "text": "Doc!"
    },
    {
      "character": "1955 DOC",
      "text": "AHHH!! AHH!! HA! HA! HAHAHA!"
    },
    {
      "character": "MARTY",
      "text": "Doc! Doc! Doc! Doc! Doc!"
    },
    {
      "character": "1955 DOC",
      "text": "AHH!"
    },
    {
      "character": "MARTY",
      "text": "Okay, relax Doc, it's me, it's me, it's Marty!"
    },
    {
      "character": "1955 DOC",
      "text": "No it can't be you...I just sent you back to the future."
    },
    {
      "character": "MARTY",
      "text": "I know, you did send me back to the future, but I'm back , I'm back from the future!"
    },
    {
      "character": "1955 DOC",
      "text": "Great...Scott!"
    },
    {
      "character": "MARTY",
      "text": "Doc. C'mon."
    },
    {
      "character": "TV",
      "text": "Hey kids what time is it? Howdy Doody time!"
    },
    {
      "character": "1955 DOC",
      "text": "Great Scott! Ooh...Howdy Doody time!"
    },
    {
      "character": "1955 DOC",
      "text": "Date, Sunday, November 13th, 1955 7:01 AM. Last night's time travel experiment was apparently a complete success. Lightning struck the clock tower at precisely 10:04 pm sending the necessary 1.21 jigawatts into the time vehicle, which vanished in a brilliant flash of light leaving a pair of fire trails behind. I therefore assume that Marty and the time vehicle were transported forward through time into the year 1985. After that...after that...I can't recall what happened. In fact, I don't even remember how I got home! Perhaps the jigawatt discharge coupled with the temporal displacement field generated by the time vehicle caused a disruption of my own brain waves resulting in a condition of momentary amnesia. Indeed I now recall the moments after the time vehicle disappeared... into the future... I saw a vision of Marty saying, \"I've come back from the future.\""
    },
    {
      "character": "MARTY",
      "text": "Hey Doc. Doc."
    },
    {
      "character": "1955 DOC",
      "text": "DAAAAH! WAHAAAAAH!"
    },
    {
      "character": "MARTY",
      "text": "Doc, calm down, OK? Just calm down, it's me, it's Marty."
    },
    {
      "character": "1955 DOC",
      "text": "No! It can't be you, I just sent you back to the future!!"
    },
    {
      "character": "MARTY",
      "text": "But I came back from the future, remember? Last night you fainted... I brought ya home."
    },
    {
      "character": "1955 DOC",
      "text": "This can't be happening! You can't be here! It doesn't make sense that you are here! I refuse to even believe you are here!"
    },
    {
      "character": "MARTY",
      "text": "I am here, and it does make sense. I came back to 1955 with the you from 1985 to get a book back from Biff. So once we got the book back, you...that is, the you from 1985...were in the DeLorean when it got struck by lightning and you got sent back to 1885!"
    },
    {
      "character": "1955 DOC",
      "text": "1885?"
    },
    {
      "character": "1955 DOC",
      "text": "It's a very interesting story, Future Boy, but there's one little thing that doesn't make sense. If the me of the future is now in the past, how could you possibly know about it?"
    },
    {
      "character": "MARTY",
      "text": "You sent me a letter."
    },
    {
      "character": "1955 DOC",
      "text": "\"Dear Marty: If my calculations are correct, you will receive this letter immediately after you saw the DeLorean struck by lightning. First, let me assure you that I am alive and well. I have been living happily these past eight months in the year 1885. The lightning bolt that hit the DeLorean caused a jigawatt overload which scrambled the time circuits, activated the flux capacitor, and sent me back to 1885. The overload shorted out the time circuits and destroyed the flying circuits. Unfortunately, the car will never fly again.\""
    },
    {
      "character": "1955 DOC",
      "text": "It actually flew?!"
    },
    {
      "character": "MARTY",
      "text": "Yeah, well, you had a hover conversion done in the early twenty-first century."
    },
    {
      "character": "1955 DOC",
      "text": "Incredible!"
    },
    {
      "character": "1955 DOC",
      "text": "\"I set myself up as a blacksmith as a front while I attempted to repair the damage to the time circuits. Unfortunately, this proved impossible because suitable replacement parts will not be invented until"
    },
    {
      "character": "1955 DOC",
      "text": "1885! Amazing. I actually end up as a blacksmith in the Ol' West."
    },
    {
      "character": "MARTY",
      "text": "Pretty heavy, huh?"
    },
    {
      "character": "1955 DOC",
      "text": "\"I have buried the DeLorean in the Delgado mine adjacent to the old Boot Hill Cemetery as shown on the enclosed map. Hopefully it will remain undisturbed and preserved until you uncover it in 1955. Inside, you will find repair instructions. My 1955 counterpart\" - that's me - \"should have no problem repairing it so you can drive it back to the future. Once you have returned to 1985, destroy the time machine.\""
    },
    {
      "character": "1955 DOC",
      "text": "Destroy it?"
    },
    {
      "character": "MARTY",
      "text": "Yeah, well, it's a long story, Doc."
    },
    {
      "character": "1955 DOC",
      "text": "\"Do not - I repeat - do not attempt to come back here to get me. I am perfectly happy living in the fresh air and wide-open spaces, and I fear that unnecessary time travel only risks further disruption of the space-time continuum. And please take care of - Einstein for me.\""
    },
    {
      "character": "1955 DOC",
      "text": "Einstein?"
    },
    {
      "character": "MARTY",
      "text": "He's your dog, Doc - Einstein - it's what you call your dog...in 1985."
    },
    {
      "character": "1955 DOC",
      "text": "\"I know you will give him a good home. Remember to walk him twice a day and that he only likes canned dog food. These are my wishes. Please respect them and follow them. And so, Marty, I now say farewell and wish you Godspeed. You've been a good, kind, and loyal friend to me, and you made a real difference in my life. I will always treasure our relationship, and will think on you with fond memories, warm feelings and a special place in my heart. Your friend in time, 'Doc.' Emmett L. Brown. September 1st, 1885.\""
    },
    {
      "character": "1955 DOC",
      "text": "I never knew I could write anything so touching..."
    },
    {
      "character": "MARTY",
      "text": "I know, I know Doc, it's beautiful."
    },
    {
      "character": "1955 DOC",
      "text": "Oh, it's all right, Copernicus! Everything's gonna be fine."
    },
    {
      "character": "MARTY",
      "text": "I'm sorry, Doc, it's all my fault you're stuck back there. I never should've let Biff get to me."
    },
    {
      "character": "1955 DOC",
      "text": "There are plenty worse places to be than the Old West. I could've ended up in the Dark Ages. They probably would've burned me at the stake as a heretic or something. Let's look at the map. It says here the time vehicle is buried here in a side tunnel. We may have to blast."
    },
    {
      "character": "MARTY",
      "text": "Whoa. I think you woke up the dead with that blast."
    },
    {
      "character": "1955 DOC",
      "text": "Take this camera... I wanna document everything!"
    },
    {
      "character": "1955 DOC",
      "text": "This reminds me of the time I attempted to reach the center of the earth. I'd be reading my favorite author, Jules Verne. I spent weeks preparing for the expedition, I didn't even get this far. Of course, I was only 12 at the time. It was the writings of Jules Verne that had a profound effect on my life. I was 11 when I first read 20,000 Leagues Under the Sea. That's when I realized that I must devote my life into science."
    },
    {
      "character": "MARTY",
      "text": "Doc... check it out... look at this."
    },
    {
      "character": "DOC",
      "text": "My initials... just like in Journey to the Center of the Earth! That means the time machine must be right through this wall!"
    },
    {
      "character": "1955 DOC",
      "text": "It's been buried here for 70 years, 2 months, and 13 days. Astounding."
    },
    {
      "character": "MARTY",
      "text": "\"...As you can see, the lightning bolt shorted out the time circuit control microchip. The attached sche-sche...\""
    },
    {
      "character": "1955 DOC",
      "text": "Schematic."
    },
    {
      "character": "MARTY",
      "text": "\"...schematic diagram will allow you to build a replacement unit with the 1955 components, thus restoring the time machine to perfect working order.\""
    },
    {
      "character": "1955 DOC",
      "text": "Unbelievable, that this piece of junk could be such a big problem. No wonder this circuit failed... it says, \"Made in Japan.\""
    },
    {
      "character": "MARTY",
      "text": "What do you mean, Doc? All the best stuff is made in Japan."
    },
    {
      "character": "1955 DOC",
      "text": "Unbelievable!"
    },
    {
      "character": "1955 DOC",
      "text": "You know, when I was a kid, I always wanted to be a cowboy. Now, knowing I'll spend my future in the past it sounds like a wonderful way to spend my retirement years. It just occurred to me...since I end up in 1885 perhaps I'm now in the history books. I wonder...could I go to the library and look myself up in the old newspaper archives?"
    },
    {
      "character": "MARTY",
      "text": "I dunno, Doc, you're the one who's always saying, you know, it's not too good to know too much about your own destiny."
    },
    {
      "character": "1955 DOC",
      "text": "You're right, Marty... I know too much already. Better that I not attempt to uncover the circumstances of my own... future."
    },
    {
      "character": "1955 DOC",
      "text": "Copernicus! Come on, boy!"
    },
    {
      "character": "MARTY",
      "text": "I'll get him Doc. Copernicus!"
    },
    {
      "character": "MARTY",
      "text": "Come on, let's go home, boy."
    },
    {
      "character": "MARTY",
      "text": "What's wrong? What's wrong, Copernicus, come on, let's go home. Come on."
    },
    {
      "character": "MARTY",
      "text": "Doc! Doc! Come here! Quick!"
    },
    {
      "character": "1955 DOC",
      "text": "What's wrong, Marty? You look like you've seen a ghost."
    },
    {
      "character": "MARTY",
      "text": "You're not far off, Doc. Look at this."
    },
    {
      "character": "1955 DOC",
      "text": "Oh! Great Scott!"
    },
    {
      "character": "MARTY",
      "text": "Check this out. \"Died, September 7th, 1885.\" That's one week after you wrote the letter! \"Erected in eternal memory by his beloved Clara.\""
    },
    {
      "character": "MARTY",
      "text": "Who the hell is Clara??!!"
    },
    {
      "character": "DOC",
      "text": "Marty, please don't stand there!!"
    },
    {
      "character": "MARTY",
      "text": "Oh, right, sorry. I gotta get another picture."
    },
    {
      "character": "DOC",
      "text": "\"...shot in the back by Buford Tannen over a matter of 80 dollars!\" What kind of a future do you call that?!"
    },
    {
      "character": "MARTY",
      "text": "\"Buford Tannen was a notorious gunman whose short temper and a tendency to drool earned him the nickname Mad Dog. He was quick on the trigger and bragged that he had killed 12 men, not including Indians or Chinamen.\""
    },
    {
      "character": "1955 DOC",
      "text": "Does it mention me? Am I one of the twelve?"
    },
    {
      "character": "MARTY",
      "text": "Just a minute. \"However, this claim cannot be substantiated since precise records were not kept after Tannen shot a newspaper editor after printing an unfavorable story about him in 1884.\" That's why we can't find anything."
    },
    {
      "character": "1955 DOC",
      "text": "Look... William McFly and family. Your relatives?"
    },
    {
      "character": "MARTY",
      "text": "My great-grandfather's name was William. That's him. Good looking guy."
    },
    {
      "character": "1955 DOC",
      "text": "McFlys...but no Browns!"
    },
    {
      "character": "MARTY",
      "text": "Look, Doc, maybe it was a mistake. Maybe that grave wasn't yours. There could've been another Emmett Brown back in 1885. Did you have any relatives here back then?"
    },
    {
      "character": "1955 DOC",
      "text": "The Browns came to Hill Valley in 1908, and then they were the Von Brauns. My father changed our name during the 1st World War."
    },
    {
      "character": "MARTY",
      "text": "Doc! Look!"
    },
    {
      "character": "1955 DOC",
      "text": "Oh! Great Scott! It's me! Then it is true. All of it. It is me who goes back there...and gets shot."
    },
    {
      "character": "MARTY",
      "text": "It's not gonna happen Doc."
    },
    {
      "character": "MARTY",
      "text": "After you fix the time circuits and put new tires on the DeLorean, I'm goin’ back to 1885 and I'm bringin’ you home."
    },
    {
      "character": "1955 DOC",
      "text": "The clothes fit?"
    },
    {
      "character": "MARTY",
      "text": "Yeah! Everything except the boots, Doc. They're kinda tight! I dunno, are you sure this stuff is authentic?"
    },
    {
      "character": "1955 DOC",
      "text": "Of course. Haven't you ever seen a Western?"
    },
    {
      "character": "MARTY",
      "text": "Yeah, I have Doc, but Clint Eastwood never wore anything like this."
    },
    {
      "character": "1955 DOC",
      "text": "Clint who?"
    },
    {
      "character": "MARTY",
      "text": "That's right. You haven't heard of him yet."
    },
    {
      "character": "1955 DOC",
      "text": "Marty, you have to wear the boots. You can't wear those futuristic things in 1885. You shouldn't even be wearing them in 1955."
    },
    {
      "character": "MARTY",
      "text": "Yeah, I have Doc, but Clint Eastwood never wore anything like this."
    },
    {
      "character": "1955 DOC",
      "text": "Clint who?"
    },
    {
      "character": "MARTY",
      "text": "That's right."
    },
    {
      "character": "MARTY",
      "text": "You haven't heard of him yet."
    },
    {
      "character": "1955 DOC",
      "text": "Marty, you have to wear the boots. You can't wear those futuristic things in 1885. You shouldn't even be wearing them in 1955."
    },
    {
      "character": "MARTY",
      "text": "All right, Doc, look. Once I get there I'll put them on, I promise."
    },
    {
      "character": "1955 DOC",
      "text": "Okay, I think we're about ready. I put gas in the tank, your future clothes are packed, just in case—fresh batteries for your walkie-talkies. Oh, and what about that floating device?"
    },
    {
      "character": "MARTY",
      "text": "Hoverboard."
    },
    {
      "character": "1955 DOC",
      "text": "Alright."
    },
    {
      "character": "MARTY",
      "text": "You know Doc, it's gonna be a hell of a long walk back to Hill Valley from here."
    },
    {
      "character": "1955 DOC",
      "text": "It's still the safest plan. After all, we can't risk sending you back to a populated area, or to a spot that's geographically unknown. You don't wanna crash into some trees that once existed in the past. This is all completely open country! So you'll have plenty of run-off space when you arrive. Remember where you're going there are no roads. There's a small cave over there which will be a perfect place to hide the time vehicle. Well, the new time circuit control tubes are warmed up! Starting up DeLorean. Time circuits on. I wrote the letter on September 1st, so we'll send you back the very next day. September 2nd, that's a Wednesday. September 2nd, 1885, 8 AM. I get shot on Monday the 7th, so you have 5 days to locate me. According to my letter I'm a blacksmith, so I probably have a shop somewhere."
    },
    {
      "character": "1955 DOC",
      "text": "All you have to do is drive the time vehicle directly towards that screen accelerating at 88 miles per hour."
    },
    {
      "character": "MARTY",
      "text": "Wait a minute, Doc. If I drive straight towards the screen, I'll crash into those Indians."
    },
    {
      "character": "1955 DOC",
      "text": "Marty. You're not thinking fourth dimensionally! You'll instantly be transported to 1885, and those Indians won't even be there."
    },
    {
      "character": "MARTY",
      "text": "Right."
    },
    {
      "character": "1955 DOC",
      "text": "Well, good luck, for both of our sakes. See you in the future."
    },
    {
      "character": "MARTY",
      "text": "You mean the past."
    },
    {
      "character": "1955 DOC",
      "text": "Exactly!"
    },
    {
      "character": "1955 DOC",
      "text": "Happy trails Marty! Ready Marty?"
    },
    {
      "character": "MARTY",
      "text": "Ready!"
    },
    {
      "character": "1955 DOC",
      "text": "Set!"
    },
    {
      "character": "MARTY",
      "text": "Hi ho silver."
    },
    {
      "character": "1955 DOC",
      "text": "Vaya con Dios!"
    },
    {
      "character": "MARTY",
      "text": "INDIANS!"
    },
    {
      "character": "MARTY",
      "text": "AHHH!!"
    },
    {
      "character": "MARTY",
      "text": "The cave!"
    },
    {
      "character": "MARTY",
      "text": "Shit, the cavalry!!"
    },
    {
      "character": "MARTY",
      "text": "Damn, I ripped the fuel line."
    },
    {
      "character": "MARTY",
      "text": "AHHH!! AHH!!"
    },
    {
      "character": "MARTY",
      "text": "AHH!! AH! AH! OH! OH!"
    },
    {
      "character": "SEAMUS",
      "text": "Maggie!"
    },
    {
      "character": "SEAMUS",
      "text": "Fetch some water, we got a hurt man here!"
    },
    {
      "character": "MARTY",
      "text": "Mom...Mom, is that you?"
    },
    {
      "character": "CLARA",
      "text": "There there now, you've been asleep for nearly 6 hours now."
    },
    {
      "character": "MARTY",
      "text": "I had this horrible nightmare. It was terrible. I dreamed I was in a western...I was being chased by Indians. And a bear."
    },
    {
      "character": "CLARA",
      "text": "Well, you're safe and sound, here now at the McFly farm."
    },
    {
      "character": "MARTY",
      "text": "McFly farm! AHH!!"
    },
    {
      "character": "MARTY",
      "text": "Well you're my-my - my..."
    },
    {
      "character": "MARTY",
      "text": "Who are you?"
    },
    {
      "character": "CLARA",
      "text": "Name's McFly. Maggie McFly."
    },
    {
      "character": "MARTY",
      "text": "McFly?!?! Maggie?!?!"
    },
    {
      "character": "MAGGIE",
      "text": "That's Mrs. McFly, and don't you be forgettin' the Mrs.! And what might your name be sir?"
    },
    {
      "character": "MARTY",
      "text": "Well, it's Mc- ...Eastwood...uh...Clint...Clint Eastwood?"
    },
    {
      "character": "MAGGIE",
      "text": "No-nonsense, practically. You hit your head, Mr. Eastwood. Not too serious, but lucky for you, Seamus found you when he did."
    },
    {
      "character": "MARTY",
      "text": "Seamus?!?!"
    },
    {
      "character": "MAGGIE",
      "text": "Me husband. You'll be excusin’ me Mr. Eastwood, while I tend to William."
    },
    {
      "character": "MARTY",
      "text": "William."
    },
    {
      "character": "MARTY",
      "text": "That's William?"
    },
    {
      "character": "MAGGIE",
      "text": "Aye! William Shaun McFly, the first of our family to be born in America! Ahh, it’s okay Will! Here's Mr. Clint Eastwood...visitin’."
    },
    {
      "character": "MAGGIE",
      "text": "He already likes ya, Mr. Eastwood."
    },
    {
      "character": "SEAMUS",
      "text": "Maggie."
    },
    {
      "character": "SEAMUS",
      "text": "I got supper."
    },
    {
      "character": "SEAMUS",
      "text": "I'm not one to pry into a man's personal affairs but… how is it that you came to be way out here, without a horse? Or boots? Or a hat?"
    },
    {
      "character": "MARTY",
      "text": "Well, my car — horse broke down and a bear ate my boots. And I guess I just forgot my hat."
    },
    {
      "character": "MAGGIE",
      "text": "How could you forget a thing like your hat? Would you like some water?"
    },
    {
      "character": "MARTY",
      "text": "Yeah, thanks."
    },
    {
      "character": "SEAMUS",
      "text": "I'll tell you what I'll do, Mr. Eastwood. I'll help you find your blacksmith friend. You can stay the night in the barn. And tomorrow, I'll take ya as far as the railroad tracks...you can follow 'em straight on in into town. I'll even give you a hat."
    },
    {
      "character": "MARTY",
      "text": "That's great. Thanks."
    },
    {
      "character": "SEAMUS",
      "text": "Ahh. Woogie William. Woogie William. Ohh, yes. I think you'll find the barn comfortable. I've never had any complaints about it from the pigs."
    },
    {
      "character": "MAGGIE",
      "text": "Seamus. A word with you."
    },
    {
      "character": "SEAMUS",
      "text": "Aye. Will ya hold him for a minute?"
    },
    {
      "character": "MAGGIE",
      "text": "You sure you're not after bringin’ a curse on this house, takin’ him in like that? Such a strange young man."
    },
    {
      "character": "SEAMUS",
      "text": "Aye, but I've just got a feelin’ about him Maggie. It's the right thing to do. It's important. Look how the baby takes to him. Little Will never takes to strangers. It's almost as if...he's connected to us."
    },
    {
      "character": "MARTY",
      "text": "Hey, Will. So, you're my great-grandfather...the first McFly born in America. And you peed on me."
    },
    {
      "character": "MAN #1",
      "text": "Give me some soap, Wang."
    },
    {
      "character": "WANG",
      "text": "Here you go."
    },
    {
      "character": "WAGON DRIVER",
      "text": "Hyah!"
    },
    {
      "character": "LEVI",
      "text": "Take a look at what just breezed in the door."
    },
    {
      "character": "ZEKE",
      "text": "Why, I didn't know the circus was in town!"
    },
    {
      "character": "JEB",
      "text": "Looks like he got that shirt off'n a dead Chi-nee."
    },
    {
      "character": "BARTENDER",
      "text": "What'll it be, stranger?"
    },
    {
      "character": "MARTY",
      "text": "Uh...I'll have...uh...ice water."
    },
    {
      "character": "LEVI",
      "text": "Ice water?"
    },
    {
      "character": "CHESTER",
      "text": "Water? You want water, you better go dunk ya head in the horse trough out there. In here... we pour whiskey."
    },
    {
      "character": "MARTY",
      "text": "Excuse me."
    },
    {
      "character": "CHESTER",
      "text": "For what?"
    },
    {
      "character": "MARTY",
      "text": "I'm tryna find a blacksmith."
    },
    {
      "character": "VOICE",
      "text": "Hey McFly... thought I done told you never to come in... You ain't Seamus McFly. You look like him though. 'Specially with that dog ugly hat."
    },
    {
      "character": "VOICE",
      "text": "You kin to that hay barber? What's your name, dude?"
    },
    {
      "character": "MARTY",
      "text": "Uh...Mart– Eastwood. Clint Eastwood."
    },
    {
      "character": "GANG LEADER",
      "text": "What kinda stupid name is that?"
    },
    {
      "character": "GANG MEMBER",
      "text": "I'd say he's the runt of the litter."
    },
    {
      "character": "GANG MEMBER",
      "text": "Take a look, see at these pearly whites! Hell , I ain't seen teeth that straight weren't store bought."
    },
    {
      "character": "GANG MEMBER",
      "text": "Take a look at them moccasins. What kind of skins is them? What's that writin’ mean...Neekay...what is that, some sort of Injun talk or somethin’?"
    },
    {
      "character": "GANG LEADER",
      "text": "Bartender...I'm lookin’ for that no -good cheatin' blacksmith. You seen him?"
    },
    {
      "character": "CHESTER",
      "text": "No, sir, Mr. Tannen, I have not."
    },
    {
      "character": "MARTY",
      "text": "Tannen. You're Mad Dog Tannen."
    },
    {
      "character": "BUFORD",
      "text": "Mad Dog? I hate that name . I hate it, ya hear? Nobody calls me Mad Dog. 'Specially not some, duded-up, egg suckin', gutter trash."
    },
    {
      "character": "MARTY",
      "text": "AHH!"
    },
    {
      "character": "BUFORD",
      "text": "Dance! Come on! Come on, runt, you can dance - - ' better than that!"
    },
    {
      "character": "MARTY",
      "text": "Uh...uh...Billie Jean is not my lover- -whoo!"
    },
    {
      "character": "LEVI",
      "text": "You better run, squirrel!"
    },
    {
      "character": "BUFORD",
      "text": "Y'all, get him!!!"
    },
    {
      "character": "MARTY",
      "text": "Whoa! Whoa! Whoa! Whoa!"
    },
    {
      "character": "MARTY",
      "text": "Ahh!!"
    },
    {
      "character": "BUFORD",
      "text": "We got ourselves a new courthouse...high time we had a hangin'!"
    },
    {
      "character": "MARTY",
      "text": "Oh, oh God, hu..."
    },
    {
      "character": "BUFORD",
      "text": "Haven't had a hangin’ in a long time!"
    },
    {
      "character": "DOC",
      "text": "It'll shoot the fleas off a dog’s back at 500 yards, Tannen, and it’s pointed straight at your head!!"
    },
    {
      "character": "BUFORD",
      "text": "You owe me money, blacksmith."
    },
    {
      "character": "DOC",
      "text": "How do ya figure?"
    },
    {
      "character": "BUFORD",
      "text": "My horse threw his shoe. Seein' you was the one who done the shoein’, I say that makes you responsible."
    },
    {
      "character": "DOC",
      "text": "Well since you never paid me for the job, I say that makes us even!"
    },
    {
      "character": "BUFORD",
      "text": "Wrong! See I was on my horse when he threw his shoe and I got throwed off. And that caused me to bust a perfectly good bottle of fine Kentucky Redeye. So the way I figure it, blacksmith, you owe me five dollars for the whiskey, and seventy-five dollars for the horse."
    },
    {
      "character": "MARTY",
      "text": "Realizing this is why Doc is going to be killed. He"
    },
    {
      "character": "DOC",
      "text": "Well since you never paid me for the job, I say that makes us even!"
    },
    {
      "character": "BUFORD",
      "text": "Wrong! See I was on my horse when he threw his shoe and I got throwed off. And that caused me to bust a perfectly good bottle of fine Kentucky Redeye. So the way I figure it, blacksmith, you owe me five dollars for the whiskey, and seventy-five dollars for the horse."
    },
    {
      "character": "MARTY",
      "text": "That's the eighty dollars!"
    },
    {
      "character": "DOC",
      "text": "Look, if your horse threw his shoe, bring him back and I'll re-shoe ’im!"
    },
    {
      "character": "BUFORD",
      "text": "I done shot that horse!"
    },
    {
      "character": "DOC",
      "text": "Well that's your problem, Tannen!"
    },
    {
      "character": "BUFORD",
      "text": "Wrong. That's yours. So from now on, you better be lookin' behind you when you walk. 'Cause one day you gonna get a bullet in yo' back. Let's go!"
    },
    {
      "character": "MARTY",
      "text": "Doc..."
    },
    {
      "character": "DOC",
      "text": "Marty...I gave you explicit instructions not to come here but to go directly back to 1985."
    },
    {
      "character": "MARTY",
      "text": "I know Doc...but I had to come."
    },
    {
      "character": "DOC",
      "text": "But it’s good to see ya, Marty."
    },
    {
      "character": "DOC",
      "text": "Marty, you're gonna have to do something about those clothes. You walk around town dressed like that, you're liable to get shot."
    },
    {
      "character": "MARTY",
      "text": "Or hanged."
    },
    {
      "character": "DOC",
      "text": "What idiot dressed you in that outfit?"
    },
    {
      "character": "MARTY",
      "text": "You did."
    },
    {
      "character": "DOC",
      "text": "\"Shot in the back by Buford Tannen over a matter of 80 dollars?!?!\" September seventh! That's this Monday! Now I wish I'd paid him off!"
    },
    {
      "character": "DOC",
      "text": "And who’s this beloved Clara? I don't know anyone named Clara."
    },
    {
      "character": "MARTY",
      "text": "I dunno, Doc. I thought maybe she was a girlfriend of yours."
    },
    {
      "character": "DOC",
      "text": "Marty. My involvement in such a social relationship, here in 1885, the result is a disruption of the space-time continuum. As a scientist, I can never take that risk, certainly not after everything we've already been through."
    },
    {
      "character": "MAN OUTSIDE",
      "text": "Emmett! Ho, Emmett!"
    },
    {
      "character": "DOC",
      "text": "Hubert!"
    },
    {
      "character": "DOC",
      "text": "It's the mayor!"
    },
    {
      "character": "MAYOR HUBERT",
      "text": "Excuse me, Emmett. You remember last week at the town meeting when you volunteered to meet the new school teacher at the station when she came in?"
    },
    {
      "character": "DOC",
      "text": "Oh yes, quite so."
    },
    {
      "character": "MAYOR HUBERT",
      "text": "Well, we just got word she's comin' in tomorrow. Here are the details for ya."
    },
    {
      "character": "MAYOR HUBERT",
      "text": "Thanks for all your help."
    },
    {
      "character": "DOC",
      "text": "Anytime, Hubert!"
    },
    {
      "character": "MAYOR HUBERT",
      "text": "Oh, her name's Miss Clayton. Clara Clayton."
    },
    {
      "character": "MARTY",
      "text": "Well, Doc, now we know who Clara is."
    },
    {
      "character": "DOC",
      "text": "Marty. It's impossible. The idea that I could fall in love at first sight? It's romantic nonsense. There's no scientific rationale for that."
    },
    {
      "character": "MARTY",
      "text": "C'mon, Doc, it's not science. You meet the right girl, it just hits ya; it's like lightning."
    },
    {
      "character": "DOC",
      "text": "Marty, please don't say that!"
    },
    {
      "character": "MARTY",
      "text": "That's the way it was for me and Jennifer. Man, we couldn't keep our eyes off each other! God, Jennifer, damn, I hope she's alright, Doc. I can't believe we just left her there on the porch!"
    },
    {
      "character": "DOC",
      "text": "Don't worry, Marty, she'll be fine. When you burned the almanac in 1955, the normal timeline was restored. That means once we're back in 1985, you just have to go over to her house and wake her up."
    },
    {
      "character": "DOC",
      "text": "Oh, Marty, turn that valve over there all the way to the right. Yeah, turn it all the way around. Okay, let's go!"
    },
    {
      "character": "DOC",
      "text": "Iced tea?"
    },
    {
      "character": "MARTY",
      "text": "No, thanks."
    },
    {
      "character": "MARTY",
      "text": "It's a refrigerator!"
    },
    {
      "character": "DOC",
      "text": "Well, I guess Miss Clayton will have to find other transportation."
    },
    {
      "character": "DOC",
      "text": "If I never meet the woman, there's no possibility of a romantic infatuation, right?"
    },
    {
      "character": "MARTY",
      "text": "You're the doc, Doc."
    },
    {
      "character": "DOC",
      "text": "Alright. Let's get the DeLorean and get ourselves back to the future!"
    },
    {
      "character": "MARTY",
      "text": "Oh listen, Doc, I tore a hole in the gas tank when I was landin’ so we’re gonna have to patch it up and get some gas."
    },
    {
      "character": "DOC",
      "text": "You mean we're outta gas?"
    },
    {
      "character": "MARTY",
      "text": "Yeah, no big deal, we got Mr. Fusion, right?"
    },
    {
      "character": "DOC",
      "text": "Mr. Fusion powers the time circuits and the flux capacitor. But the internal combustion engine runs on ordinary gasoline; it always has. There's not gonna be a gas station around here until sometime in the next century. Without gasoline, we can't get the DeLorean up to 88 miles per hour."
    },
    {
      "character": "MARTY",
      "text": "So, what'll we do?"
    },
    {
      "character": "MARTY",
      "text": "Uh! Uh! Uh! Uh!"
    },
    {
      "character": "DOC",
      "text": "Ya! Ya!"
    },
    {
      "character": "MARTY",
      "text": "24!"
    },
    {
      "character": "DOC",
      "text": "It's no use, Marty! Even the fastest horse in the world can't run more than 35, 40 miles an hour."
    },
    {
      "character": "DOC",
      "text": "Ya! Ya! Ya!"
    },
    {
      "character": "MARTY",
      "text": "Bartender says that's the strongest stuff they got."
    },
    {
      "character": "DOC",
      "text": "Try it, Marty."
    },
    {
      "character": "DOC",
      "text": "Give it more gas..."
    },
    {
      "character": "DOC",
      "text": "Damn! It blew the fuel injection manifold. Strong stuff all right."
    },
    {
      "character": "DOC",
      "text": "It'll take me a month to rebuild it."
    },
    {
      "character": "MARTY",
      "text": "A month? Doc, you're gonna get shot on Monday!"
    },
    {
      "character": "DOC",
      "text": "I know, I know, I know! I wish...wait. I've got it! We can roll it down a steep hill...no, we'd never find a smooth enough surface. Unless...of course...ice."
    },
    {
      "character": "DOC",
      "text": "We can wait until winter...when the lake freezes over..."
    },
    {
      "character": "MARTY",
      "text": "Winter! Doc! Monday! It's three days away!"
    },
    {
      "character": "DOC",
      "text": "Wait. Let's just think this thing through logically. We know it can't run on its own power, and we know we can't pull it. But if we can figure out a way to push it up to 88 mph...huh?"
    },
    {
      "character": "DOC",
      "text": "That's it!"
    },
    {
      "character": "ENGINEER",
      "text": "How fast can she go? Why, I've had her up to 55 myself. I hear that fearless Frank Fargo got one of these up to near 70 out past Verde Junction."
    },
    {
      "character": "MARTY",
      "text": "Is it possible to get it up to 90?"
    },
    {
      "character": "ENGINEER",
      "text": "Ha. 90? Tarnation, son, who’d ever need to be in such a hurry?"
    },
    {
      "character": "DOC",
      "text": "Well, it's just a little bet that he and I have, that's all. Theoretically speaking, could it be done?"
    },
    {
      "character": "ENGINEER",
      "text": "Well, I suppose if you had a straight stretch of track with a level grade, and you weren't haulin’ no cars behind ya...and if ya could get the fire hot enough...and I’m talkin’ about hotter than the blazes of hell and damnation itself...then yes, it might be possible to get her up that fast."
    },
    {
      "character": "DOC",
      "text": "Tell me, when’s the next train come through here?"
    },
    {
      "character": "ENGINEER",
      "text": "Monday mornin’ at 8 o'clock."
    },
    {
      "character": "DOC",
      "text": "Here."
    },
    {
      "character": "DOC",
      "text": "This spur that runs off the main line 3 miles down to Clayton Ravine. There's a long stretch of level track that will still exist in 1985. This is where we'll push the DeLorean with the locomotive."
    },
    {
      "character": "DOC",
      "text": "Funny, this map calls Clayton Ravine Shonash Ravine. That must be an old Indian name for it."
    },
    {
      "character": "DOC",
      "text": "It's perfect. Nice long run that goes clear across the bridge over the ravine, you know, over near that Hilldale housing development?"
    },
    {
      "character": "MARTY",
      "text": "Right, Doc, but according to this map..."
    },
    {
      "character": "MARTY",
      "text": "there is no bridge."
    },
    {
      "character": "MARTY",
      "text": "Well, Doc, we can scratch that idea. I mean, we can't wait around a year and a half for this thing to get finished."
    },
    {
      "character": "DOC",
      "text": "Marty...it's perfect! You're just not thinking fourth dimensionally!"
    },
    {
      "character": "MARTY",
      "text": "Right, right. I have a real problem with that."
    },
    {
      "character": "DOC",
      "text": "Don't you see? The bridge will exist in 1985. It's safe and still in use. Therefore, as long as we get the DeLorean up to 88 miles per hour before we hit the edge of the ravine, we'll instantaneously arrive at a point in time where the bridge is completed. We'll have track under us, and coast safely across the ravine!"
    },
    {
      "character": "MARTY",
      "text": "What about the locomotive?"
    },
    {
      "character": "DOC",
      "text": "It'll be a spectacular wreck. Too bad no one will be around to see it."
    },
    {
      "character": "CLARA",
      "text": "Ahhh!! Help me!"
    },
    {
      "character": "DOC",
      "text": "Great Scott!"
    },
    {
      "character": "MARTY",
      "text": "Hah!"
    },
    {
      "character": "DOC",
      "text": "Jump!"
    },
    {
      "character": "DOC",
      "text": "Whoa."
    },
    {
      "character": "CLARA",
      "text": "Oh, thank you, sir, you saved my..."
    },
    {
      "character": "CLARA",
      "text": "life."
    },
    {
      "character": "DOC",
      "text": "Emmett Brown, at your service, Miss..."
    },
    {
      "character": "CLARA",
      "text": "Um...um...Clayton. Clara Clayton."
    },
    {
      "character": "DOC",
      "text": "Clara."
    },
    {
      "character": "DOC",
      "text": "What a beautiful name."
    },
    {
      "character": "DOC",
      "text": "May I help you inside with these?"
    },
    {
      "character": "CLARA",
      "text": "Oh no, that won't be necessary. You've done more than enough already."
    },
    {
      "character": "DOC",
      "text": "But it's really no trouble."
    },
    {
      "character": "MARTY",
      "text": "Doc, she says it's fine, and we gotta get goin'."
    },
    {
      "character": "MARTY",
      "text": "Ma'am, good luck with the school teachin' and everything."
    },
    {
      "character": "DOC",
      "text": "Clara, I'll straighten everything out with Mr. Statler for the buckboard rental... don't you worry about that. I feel somewhat responsible for what happened."
    },
    {
      "character": "CLARA",
      "text": "Oh, well, that would be very gentlemanly of you, Mr. Brown...Emmett. You know, I'm almost glad that snake spooked those horses. Otherwise, we might never have met. I suppose it was destiny."
    },
    {
      "character": "CLARA",
      "text": "Well, thank you for everything."
    },
    {
      "character": "DOC",
      "text": "You're quite welcome."
    },
    {
      "character": "CLARA",
      "text": "I will...see you again, won't I?"
    },
    {
      "character": "DOC",
      "text": "Of course, you'll see lots of me, I'm sure, I have a shop in town. I'm a local scientist...uh...uh...uh…blacksmith."
    },
    {
      "character": "CLARA",
      "text": "Science? What sort of science? Astronomy? Chemistry?"
    },
    {
      "character": "DOC",
      "text": "Actually I'm a student of all sciences."
    },
    {
      "character": "MARTY",
      "text": "Hey Doc, we gotta get goin'."
    },
    {
      "character": "DOC",
      "text": "Oh yes, well, excuse us Clara, we have to get...going."
    },
    {
      "character": "DOC",
      "text": "Toodle-oo."
    },
    {
      "character": "MARTY",
      "text": "What do ya mean, you're gonna be seein' lots of her, Doc?"
    },
    {
      "character": "DOC",
      "text": "Well...I might see her again, just in passing."
    },
    {
      "character": "MARTY",
      "text": "C'mon, Doc, did you see the way she was looking at you?"
    },
    {
      "character": "DOC",
      "text": "Well, she did have quite a scare, right? After all, Miss Clayton almost ended up at the bottom of Clayton Ravine."
    },
    {
      "character": "MARTY",
      "text": "Holy shit! Hey Doc! Clayton Ravine was named after a teacher."
    },
    {
      "character": "DOC",
      "text": "A hundred years ago?!? That's this year!"
    },
    {
      "character": "MARTY",
      "text": "Every kid in school knows that story because we all have teachers we'd like to see fall into the ravine."
    },
    {
      "character": "DOC",
      "text": "Great Scott!"
    },
    {
      "character": "DOC",
      "text": "Then she was supposed to go over in that wagon...and now, I may have seriously altered history."
    },
    {
      "character": "MARTY",
      "text": "Look, Doc, what's the worst that could happen, huh? So they don't name the ravine after her. Let's just get the DeLorean ready and get the hell outta here."
    },
    {
      "character": "DOC",
      "text": "I wish I'd never invented that infernal time machine...which caused nothing but disaster."
    },
    {
      "character": "MARTY",
      "text": "Doc, Doc, this is Marty. Can you read me? Over."
    },
    {
      "character": "DOC",
      "text": "Check, Marty."
    },
    {
      "character": "MARTY",
      "text": "Great Doc, these things still work."
    },
    {
      "character": "DOC",
      "text": "Alright."
    },
    {
      "character": "DOC",
      "text": "Marty, once more let’s go over the entire plan and layout. I apologize for the crudity of this model..."
    },
    {
      "character": "MARTY",
      "text": "Yeah, I know, Doc, it's not to scale. It's okay, Doc."
    },
    {
      "character": "DOC",
      "text": "Alright. Tomorrow night, Sunday, we'll load the DeLorean on to the tracks here on the spur right by the old, abandoned silver mine. The switch track is where the spur runs off the main line 3 miles into Clayton...Shonash Ravine. The train leaves t"
    },
    {
      "character": "MARTY",
      "text": "Yeah, I know, Doc, it's not to scale. It's okay, Doc."
    },
    {
      "character": "DOC",
      "text": "Alright. Tomorrow night, Sunday, we'll load the DeLorean on to the tracks here on the spur right by the old, abandoned silver mine. The switch track is where the spur runs off the main line 3 miles into Clayton...Shonash Ravine. The train leaves the station at 8:00 Monday morning. We'll stop it here, uncouple the cars from the tender, throw the switch track, and hijack — borrow the locomotive and use it to push the time machine. According to my calculations we'll hit 88 miles per hour just before we hit the edge of the ravine, at which point we'll instantaneously arrive in 1985 and coast safely across the completed bridge."
    },
    {
      "character": "MARTY",
      "text": "What does this mean?"
    },
    {
      "character": "MARTY",
      "text": "Point of no return?"
    },
    {
      "character": "DOC",
      "text": "That's our failsafe point. Up until that point we can stop the locomotive before it plunges over the ravine. But once we pass that windmill, it's the future or bust."
    },
    {
      "character": "DOC",
      "text": "Here you go, Marty. Connect that to the positive terminal. All right, Marty, you all set?"
    },
    {
      "character": "MARTY",
      "text": "Yeah, yeah, go."
    },
    {
      "character": "DOC",
      "text": "Train pulling out of the station! Coming up the switch track! Stop at the switch track! Throw switch! Pulling up to the DeLorean!"
    },
    {
      "character": "DOC",
      "text": "Pushing the DeLorean up to 88 miles per hour!"
    },
    {
      "character": "DOC",
      "text": "It couldn't be simpler!"
    },
    {
      "character": "CLARA",
      "text": "Hello? Emmett?"
    },
    {
      "character": "DOC",
      "text": "It's Clara! Quick, cover the DeLorean."
    },
    {
      "character": "CLARA",
      "text": "Hello."
    },
    {
      "character": "DOC",
      "text": "Why, hello. This is quite a surprise."
    },
    {
      "character": "CLARA",
      "text": "Well, I hope I'm not disturbing anything."
    },
    {
      "character": "DOC",
      "text": "Oh no, we were just doing a little model railroading."
    },
    {
      "character": "CLARA",
      "text": "Emmett, when my bags were thrown from the wagon, my telescope was damaged. And...since you expressed an interest...in science, I thought you might be able to repair it for me. I would pay you, of course."
    },
    {
      "character": "DOC",
      "text": "Oh, no, no, no, I wouldn't think of charging you for this. Well, let's have a look at it."
    },
    {
      "character": "CLARA",
      "text": "I think a lens may be out of alignment, because if ya move it this way, the image turns fuzzy, see? But if you turn it... the other way.."
    },
    {
      "character": "DOC",
      "text": "...everything becomes... clear."
    },
    {
      "character": "DOC",
      "text": "I will repair it right away and have it for you tonight."
    },
    {
      "character": "CLARA",
      "text": "Oh, tonight's the town festival. I wouldn't dream of having you work on my telescope during such an important event. You are...planning on attending, aren't you?"
    },
    {
      "character": "MARTY",
      "text": "Well, actually ma'am..."
    },
    {
      "character": "DOC",
      "text": "Of course, the festival..."
    },
    {
      "character": "CLARA",
      "text": "Well, in that case, I'll see you this evening at the festival, Emmett."
    },
    {
      "character": "CLARA",
      "text": "Mr. Eastwood."
    },
    {
      "character": "MARTY",
      "text": "Ma'am."
    },
    {
      "character": "CLARA",
      "text": "Thank you...for taking care of my telescope."
    },
    {
      "character": "DOC",
      "text": "You're quite welcome."
    },
    {
      "character": "MARTY",
      "text": "It's a nice telescope."
    },
    {
      "character": "MAYOR HUBERT",
      "text": "Ladies and gentlemen! As mayor of Hill Valley, it gives me great pleasure to dedicate this clock to the people of Hill County. May it stand for all time!"
    },
    {
      "character": "TOWNSPEOPLE",
      "text": "3...2...1...now!"
    },
    {
      "character": "MAYOR HUBERT",
      "text": "Let the festivities begin!"
    },
    {
      "character": "DOC",
      "text": "Y'know Marty, in a way it's fitting that you and I are here to witness this."
    },
    {
      "character": "MARTY",
      "text": "Too bad I didn't bring my camera."
    },
    {
      "character": "PHOTOGRAPHER",
      "text": "Ready, gentlemen?"
    },
    {
      "character": "DOC",
      "text": "The only problem is we'll never be able to show it to anybody."
    },
    {
      "character": "MARTY",
      "text": "Smile, Doc."
    },
    {
      "character": "ZZ TOP MEMBER",
      "text": "YEE HA!!"
    },
    {
      "character": "DOC",
      "text": "What great music!"
    },
    {
      "character": "MARTY",
      "text": "Yeah; it's got a beat, and you can dance to it!"
    },
    {
      "character": "COLT GUN SALESMAN",
      "text": "Step right up, gentlemen, and test your mettle with the latest products from Colonel Samuel Colt's Patent firearms of Hartford, Connecticut. Take this model for example. The new, improved and refined Colt Peacemaker. Available to you tonight for the low, low price of $12."
    },
    {
      "character": "DOC",
      "text": "Good evening."
    },
    {
      "character": "CLARA",
      "text": "Evening."
    },
    {
      "character": "DOC",
      "text": "You look very...nice."
    },
    {
      "character": "CLARA",
      "text": "Thank you."
    },
    {
      "character": "DOC",
      "text": "Would you like...uh...would you care to, uh..."
    },
    {
      "character": "CLARA",
      "text": "I'd love to."
    },
    {
      "character": "COLT GUN SALESMAN",
      "text": "Young man, wanna give it a try?"
    },
    {
      "character": "MARTY",
      "text": "No, no, thanks."
    },
    {
      "character": "MARTY",
      "text": "Hey Doc, this..."
    },
    {
      "character": "COLT GUN SALESMAN",
      "text": "Son! Sonny boy!"
    },
    {
      "character": "MARTY",
      "text": "The doc can dance?!"
    },
    {
      "character": "COLT GUN SALESMAN",
      "text": "Son! Son! Son!"
    },
    {
      "character": "COLT GUN SALESMAN",
      "text": "Hey! I just told you that even a baby can handle this weapon. Surely you're not afraid to try somethin' that a baby can do."
    },
    {
      "character": "MARTY",
      "text": "Hey, I'm not afraid of nothin'."
    },
    {
      "character": "COLT GUN SALESMAN",
      "text": "Well, then, step right up like a man."
    },
    {
      "character": "COLT GUN SALESMAN",
      "text": "Now , what you do is just ease that hammer back there and squeeze off a round."
    },
    {
      "character": "COLT GUN SALESMAN",
      "text": "No, no, no, right on out there and be real smooth. That's how you do it."
    },
    {
      "character": "COLT GUN SALESMAN",
      "text": "Ho ho. God."
    },
    {
      "character": "MARTY",
      "text": "Hey listen, can I try that again?"
    },
    {
      "character": "COLT GUN SALESMAN",
      "text": "Sure, go ahead."
    },
    {
      "character": "COLT GUN SALESMAN",
      "text": "Hey, just tell me one thing...where'd you learn to shoot like that?"
    },
    {
      "character": "MARTY",
      "text": "7-Eleven."
    },
    {
      "character": "GANG MEMBER #1",
      "text": "Buford, you sure that blacksmith is gon' be at this here shindig?"
    },
    {
      "character": "BUFORD",
      "text": "Sure he's here."
    },
    {
      "character": "BUFORD",
      "text": "Everybody's here tonight."
    },
    {
      "character": "DEPUTY",
      "text": "You gentlemen are gonna have to check your firearms if you wanna join in on the festivities."
    },
    {
      "character": "BUFORD",
      "text": "And who's gonna make us, tenderfoot...you?"
    },
    {
      "character": "STRICKLAND",
      "text": "I am."
    },
    {
      "character": "BUFORD",
      "text": "Marshall Strickland. I didn't know you was back in town."
    },
    {
      "character": "STRICKLAND",
      "text": "If you can't read the sign, Tannen, I presume you can read this."
    },
    {
      "character": "BUFORD",
      "text": "Pretty tough hombre when you're pointin' a scattergun at a man's back."
    },
    {
      "character": "STRICKLAND",
      "text": "Just like you, Tannen, I take every advantage I can get. Now are you gonna check your iron?"
    },
    {
      "character": "BUFORD",
      "text": "I was just jokin' with your deputy. Of course I'm gonna check my iron. We all were, weren't we boys?"
    },
    {
      "character": "DEPUTY",
      "text": "Yeah. Right."
    },
    {
      "character": "DEPUTY",
      "text": "Tannen...your knife, too."
    },
    {
      "character": "BUFORD",
      "text": "Smile, Marshall. After all, this is a party."
    },
    {
      "character": "STRICKLAND",
      "text": "The only party I'll be smilin' at is the one that sees you at the end of a rope."
    },
    {
      "character": "DEPUTY",
      "text": "Have fun."
    },
    {
      "character": "STRICKLAND",
      "text": "That's how you handle 'em, son, never give 'em an inch .Maintain discipline at all times. Remember that word...discipline."
    },
    {
      "character": "STRICKLAND'S SON",
      "text": "I will, Pa."
    },
    {
      "character": "SEAMUS",
      "text": "Why, Mr. Eastwood. Nice to see ya. I see you got yourself some respectable clothes, lad. And a fine hat."
    },
    {
      "character": "MARTY",
      "text": "Yeah, well, a couple other people didn't like the way the other one looked on me."
    },
    {
      "character": "MAGGIE",
      "text": "Sure'n that one suits you Mr. Eastwood. Very becomin'."
    },
    {
      "character": "MARTY",
      "text": "Ahh...thanks."
    },
    {
      "character": "MARTY",
      "text": "Hey...Frisbee. Far out ."
    },
    {
      "character": "SEAMUS",
      "text": "What was the meanin' of that?"
    },
    {
      "character": "MAGGIE",
      "text": "It was right in front of him."
    },
    {
      "character": "SEAMUS",
      "text": "Aye."
    },
    {
      "character": "GANG MEMBER",
      "text": "There he is, Buford."
    },
    {
      "character": "BUFORD",
      "text": "Where?"
    },
    {
      "character": "GANG MEMBER",
      "text": "Right there. Dancin' with that piece a calico."
    },
    {
      "character": "GANG MEMBER #2",
      "text": "What are ya gonna do, boss?"
    },
    {
      "character": "BUFORD",
      "text": "I figure...I'll bury this muzzle deep enough in his back, nobody'll hear the shot."
    },
    {
      "character": "GANG MEMBER",
      "text": "Careful, Buford, you only got one bullet with that."
    },
    {
      "character": "BUFORD",
      "text": "I only need one."
    },
    {
      "character": "BUFORD",
      "text": "I told you to watch your back, Smithy."
    },
    {
      "character": "DOC",
      "text": "Tannen. But you're early."
    },
    {
      "character": "BUFORD",
      "text": "It's a Derringer, Smithy. Small but effective. Last time I used it, fella took two whole days to die. Bled to death inside, it was real painful. That means you'd be dead by about suppertime Monday."
    },
    {
      "character": "CLARA",
      "text": "I don't know who you think you are, but we're dancing."
    },
    {
      "character": "BUFORD",
      "text": "Well, looky what we have here...introduce me to the lady; I'd like a dance."
    },
    {
      "character": "DOC",
      "text": "I wouldn't give you the pleasure; you'll just have to go ahead and shoot."
    },
    {
      "character": "BUFORD",
      "text": "Alright."
    },
    {
      "character": "CLARA",
      "text": "No, Emmett. I'll dance with him! I'll dance with him!"
    },
    {
      "character": "BUFORD",
      "text": "Boys, keep the blacksmith company while I get acquainted with the filly."
    },
    {
      "character": "BUFORD",
      "text": "WOO...HA HA! YEAH. OOOH."
    },
    {
      "character": "CLARA",
      "text": "I don't dance very well when my partner has a gun in his hand."
    },
    {
      "character": "BUFORD",
      "text": "Well, you'll learn. You know, Smithy, I may just take my $80 worth outta her!"
    },
    {
      "character": "BUFORD",
      "text": "WOO...HAHAHA! YEAH. I bet there's somethin' you can do that's worth $80."
    },
    {
      "character": "CLARA",
      "text": "I'm afraid you've underestimated me, Mister."
    },
    {
      "character": "BUFORD",
      "text": "Have I now?"
    },
    {
      "character": "DOC",
      "text": "Stop it! Damn you, Tannen!"
    },
    {
      "character": "BUFORD",
      "text": "No, I damn you. I damn you to hell !"
    },
    {
      "character": "BUFORD",
      "text": "You!"
    },
    {
      "character": "MARTY",
      "text": "Hey, lighten up, jerk!"
    },
    {
      "character": "BUFORD",
      "text": "Mighty strong words, runt! You man enough to back 'em up with more than just a pie plate?!"
    },
    {
      "character": "MARTY",
      "text": "Look, just leave my friends alone."
    },
    {
      "character": "BUFORD",
      "text": "What's wrong, dude, you yella?"
    },
    {
      "character": "BUFORD",
      "text": "You!"
    },
    {
      "character": "MARTY",
      "text": "Hey, lighten up, jerk!"
    },
    {
      "character": "BUFORD",
      "text": "Mighty strong words, runt! You man enough to back 'em up with more than just a pie plate?!"
    },
    {
      "character": "MARTY",
      "text": "Look, just leave my friends alone."
    },
    {
      "character": "BUFORD",
      "text": "What's wrong, dude, you yella?"
    },
    {
      "character": "BUFORD",
      "text": "That's what I thought. Yella belly."
    },
    {
      "character": "MARTY",
      "text": "Nobody... calls me yellow."
    },
    {
      "character": "BUFORD",
      "text": "Let's finish it...right now."
    },
    {
      "character": "GANG MEMBER #1",
      "text": "Uh, not now, Buford...uh…Marshall's got our guns."
    },
    {
      "character": "BUFORD",
      "text": "Well, like I said, we'll finish this tomorrow."
    },
    {
      "character": "GANG MEMBER #2",
      "text": "Tomorrow we're robbin' the Pine City Stage."
    },
    {
      "character": "BUFORD",
      "text": "How 'bout Monday? We doin' anything Monday?"
    },
    {
      "character": "GANG MEMBER #3",
      "text": "No, Monday'd be fine... you can kill him on Monday."
    },
    {
      "character": "BUFORD",
      "text": "I'll be back this way on Monday. We'll settle this then."
    },
    {
      "character": "BUFORD",
      "text": "Right there out in the street, in front of the Palace Saloon."
    },
    {
      "character": "MARTY",
      "text": "Yeah, right, well, when? Sarcastically. High noon?"
    },
    {
      "character": "BUFORD",
      "text": "Noon? I do my killin' before breakfast. Seven o'clock!"
    },
    {
      "character": "MARTY",
      "text": "Eight o'clock ."
    },
    {
      "character": "MARTY",
      "text": "I do my killin' after breakfast."
    },
    {
      "character": "DOC",
      "text": "Marty...no."
    },
    {
      "character": "STRICKLAND",
      "text": "Alright now, break it up. What's all this about...you causin' trouble here, Tannen?"
    },
    {
      "character": "BUFORD",
      "text": "No trouble, Marshall. Just a little personal matter between me and Eastwood."
    },
    {
      "character": "BUFORD",
      "text": "This don't concern the law."
    },
    {
      "character": "STRICKLAND",
      "text": "Tonight, everything concerns the law - now break it up. Any brawlin', it's fifteen days in the county jail."
    },
    {
      "character": "STRICKLAND",
      "text": "Come on, this is a party! Come on, let's have some fun!"
    },
    {
      "character": "BUFORD",
      "text": "8:00 Monday, runt. You ain't here, I'll hunt you and shoot you down like a duck."
    },
    {
      "character": "GANG MEMBER #1",
      "text": "It's dog, Buford. Shoot 'im down like a dog."
    },
    {
      "character": "BUFORD",
      "text": "Let's go, boys! Let these sissies have their party!"
    },
    {
      "character": "DOC",
      "text": "Marty, what are you doing, saying you're gonna meet Tannen??"
    },
    {
      "character": "MARTY",
      "text": "Doc, don't worry about it! Monday morning, 8 AM. We're gonna be gone, right?"
    },
    {
      "character": "DOC",
      "text": "Theoretically, yes, but what if the train's late??"
    },
    {
      "character": "MARTY",
      "text": "Late??"
    },
    {
      "character": "DOC",
      "text": "We'll discuss this later."
    },
    {
      "character": "MARTY",
      "text": "No, we'll discuss this now...late?"
    },
    {
      "character": "CLARA",
      "text": "Thank you for your gallantry, Mr. Eastwood."
    },
    {
      "character": "MARTY",
      "text": "No, hey, ma'am."
    },
    {
      "character": "CLARA",
      "text": "Had you not interceded, Emmett might have been shot!"
    },
    {
      "character": "DOC",
      "text": "Marty...uh, Clint...I'm gonna take Clara home."
    },
    {
      "character": "MAN",
      "text": "You sure set him straight, Mr. Eastwood. I'm glad somebody finally got the gumption to stand up to that son-of-a-bitch."
    },
    {
      "character": "MAN #2",
      "text": "You're alright in my book, Mr. Eastwood...I'd like to buy you a drink."
    },
    {
      "character": "MARTY",
      "text": "Hey, look, I don't want a drink."
    },
    {
      "character": "COLT GUN SALESMAN",
      "text": "Young man, young man...I'd like you to have this brand new Colt Peacemaker and gun belt, free of charge!"
    },
    {
      "character": "MARTY",
      "text": "Free?"
    },
    {
      "character": "COLT GUN SALESMAN",
      "text": "I want ever'body to know that the gun that shot Buford Tannen was a Colt Peacemaker."
    },
    {
      "character": "MARTY",
      "text": "Hey, hey, thanks."
    },
    {
      "character": "COLT GUN SALESMAN",
      "text": "Of course, you understand that if you lose...I'm takin' it back."
    },
    {
      "character": "MARTY",
      "text": "Thanks again."
    },
    {
      "character": "SEAMUS",
      "text": "You had 'im, Mr. Eastwood! You could have just walked away, and nobody woulda thought the lessa ya for it. All it would have been was words... hot air from a buffoon."
    },
    {
      "character": "SEAMUS",
      "text": "Instead, you let him rile ya...rile ya into playin' his game, his way, by his rules."
    },
    {
      "character": "MARTY",
      "text": "Seamus, relax, I know what I'm doin'."
    },
    {
      "character": "MAGGIE",
      "text": "He reminds me of poor Martin."
    },
    {
      "character": "SEAMUS",
      "text": "Aye."
    },
    {
      "character": "MARTY",
      "text": "Who?"
    },
    {
      "character": "SEAMUS",
      "text": "Me brother."
    },
    {
      "character": "MARTY",
      "text": "Wait a minute...you have a brother named Martin McFly?"
    },
    {
      "character": "SEAMUS",
      "text": "Had a brother."
    },
    {
      "character": "SEAMUS",
      "text": "Martin used to let men provoke him into fightin'. He was concerned people would tink him a coward if he refused. That's how he got a bowie knife shoved through his belly in a saloon in Virginia City. Never considered the future, poor Martin, God rest his soul."
    },
    {
      "character": "MAGGIE",
      "text": "Sure hopin' you're considerin' the future, Mr. Eastwood."
    },
    {
      "character": "MARTY",
      "text": "I think about it all the time."
    },
    {
      "character": "CLARA",
      "text": "And that crater in the middle northwest, out there all by itself like a starburst?"
    },
    {
      "character": "DOC",
      "text": "Uh-huh."
    },
    {
      "character": "CLARA",
      "text": "That one's called Copernicus. Listen to me, I feel like I'm teaching school!"
    },
    {
      "character": "DOC",
      "text": "Oh, please, continue your lesson. I never found lunar geography so fascinating. You're quite knowledgeable."
    },
    {
      "character": "CLARA",
      "text": "When I was 11, I had diphtheria. I was quarantined for three months, so my father bought me this telescope and put it next to my bed so I could see everything out my window."
    },
    {
      "character": "CLARA",
      "text": "Emmett, do you think we'll ever be able to travel to the moon, like we travel across the country on trains?"
    },
    {
      "character": "DOC",
      "text": "Definitely, although not for another 84 years and not on trains. We'll have space vehicles... capsules to sail off in rockets - devices that create giant explosions...explosions that are so...powerful that they..."
    },
    {
      "character": "CLARA",
      "text": "...they break the pull of the earth's gravity and send their projectile through outer space."
    },
    {
      "character": "CLARA",
      "text": "Emmett...I read that book too! You're quoting Jules Verne, From the Earth to the Moon."
    },
    {
      "character": "DOC",
      "text": "You've read Jules Verne?"
    },
    {
      "character": "CLARA",
      "text": "I adore Jules Verne."
    },
    {
      "character": "DOC",
      "text": "So do I. 20,000 Leagues Under the Sea, my absolute favorite. The first time I read that when I was a little boy, I wanted to meet Captain Nemo and..."
    },
    {
      "character": "CLARA",
      "text": "Please, Emmett...you couldn't have read that when you were a little boy, it was only first published ten years ago."
    },
    {
      "character": "DOC",
      "text": "Oh, yes, well...I meant it made me feel like a boy."
    },
    {
      "character": "DOC",
      "text": "I never met a woman who liked Jules Verne before."
    },
    {
      "character": "CLARA",
      "text": "I never ever...met a man like you before."
    },
    {
      "character": "MARTY",
      "text": "Doc! Doc!"
    },
    {
      "character": "MARTY",
      "text": "I hope you know what you're doin'."
    },
    {
      "character": "MARTY",
      "text": "You talkin' to me?"
    },
    {
      "character": "MARTY",
      "text": "You talkin' to me, Tannen?"
    },
    {
      "character": "MARTY",
      "text": "Well I'm the only one here. Go ahead...make my day!"
    },
    {
      "character": "MAN #1",
      "text": "Hey, good morning, Mr. Eastwood!"
    },
    {
      "character": "MARTY",
      "text": "Morning."
    },
    {
      "character": "MAN #2",
      "text": "Have a cigar, Mr. Eastwood. Anything I can do for you today, Mr. Eastwood?"
    },
    {
      "character": "MARTY",
      "text": "No, no, it's... fine."
    },
    {
      "character": "GOOD LUCK",
      "text": "Good luck tomorrow, Mr. Eastwood! We'll be prayin' for ya!"
    },
    {
      "character": "MARTY",
      "text": "Thanks."
    },
    {
      "character": "MARTY",
      "text": "Good morning, Mr. Eastwood. Interest you in a new suit for a tomorrow?"
    },
    {
      "character": "MARTY",
      "text": "Ah, I'm...I'm fine. Thanks."
    },
    {
      "character": "MARTY",
      "text": "Doc. What are you doin'?"
    },
    {
      "character": "DOC",
      "text": "Oh, nothing...just out enjoying the morning air. It's really lovely here in the morning, don't you think?"
    },
    {
      "character": "MARTY",
      "text": "Yeah, it's lovely Doc. Listen, we gotta load the DeLorean; we gotta get ready to roll, alright? Hey look at that, the tombstone."
    },
    {
      "character": "DOC",
      "text": "Marty, let me see that photograph again."
    },
    {
      "character": "DOC",
      "text": "My name...it's vanished."
    },
    {
      "character": "MARTY",
      "text": "Hey, that's great Doc! Don't you get it - we're goin' back to the future tomorrow, so everything's bein' erased!"
    },
    {
      "character": "DOC",
      "text": "But only my name is erased! The tombstone itself and the date still remain. That doesn't make sense. We know that this photograph represents what will happen if the events of today continue to run their course into tomorrow."
    },
    {
      "character": "MARTY",
      "text": "Right, and so?"
    },
    {
      "character": "UNDERTAKER",
      "text": "Excuse me, Mr. Eastwood, I just need to take your measurement."
    },
    {
      "character": "MARTY",
      "text": "Hey, look, pal, I don't wanna buy a suit!"
    },
    {
      "character": "UNDERTAKER",
      "text": "No, this is for your coffin."
    },
    {
      "character": "MARTY",
      "text": "My coffin?!"
    },
    {
      "character": "UNDERTAKER",
      "text": "Well, the odds are running two to one against you. Might as well be prepared."
    },
    {
      "character": "DOC",
      "text": "So...it may not be my name that's supposed to end up on that tombstone. It may...be...yours."
    },
    {
      "character": "MARTY",
      "text": "Great Scott!"
    },
    {
      "character": "DOC",
      "text": "I know, this is heavy."
    },
    {
      "character": "DOC",
      "text": "Marty, why are wearing that gun? You're not considering going up against Tannen tomorrow?!?"
    },
    {
      "character": "MARTY",
      "text": "Doc, tomorrow morning I'm goin' back to the future with you. But if Buford Tannen comes lookin' for trouble, I'm gonna be ready for him. You heard what that son-of-a-bitch called me last night."
    },
    {
      "character": "DOC",
      "text": "Marty, you can't go losing your judgment every time someone calls you a name! That's exactly what causes you to get into that accident in the future."
    },
    {
      "character": "MARTY",
      "text": "What? What about my future?"
    },
    {
      "character": "DOC",
      "text": "I can't tell you. It might make things worse."
    },
    {
      "character": "MARTY",
      "text": "Wait a minute, Doc...what is wrong with my future?!"
    },
    {
      "character": "DOC",
      "text": "Marty...we all have to make decisions that affect the course of our lives. You've gotta do what you've gotta do. And I've gotta do what I've gotta do."
    },
    {
      "character": "DOC",
      "text": "Marty."
    },
    {
      "character": "MARTY",
      "text": "Yeah?"
    },
    {
      "character": "DOC",
      "text": "I've made a decision. I'm not going with you tomorrow. I'm staying here."
    },
    {
      "character": "MARTY",
      "text": "What are you talkin' about, Doc?!"
    },
    {
      "character": "DOC",
      "text": "There's no point in denying it. I'm in love with Clara."
    },
    {
      "character": "MARTY",
      "text": "Oh man. Doc, we don't belong here! Neither one of us! You know it could still be you that gets shot tomorrow!"
    },
    {
      "character": "MARTY",
      "text": "This tombstone could still be in your future!"
    },
    {
      "character": "DOC",
      "text": "Marty...the future isn't written. It can be changed; you know that! Anyone can make their future whatever they want it to be. I can't let this one little photograph determine my entire destiny. I have to live my life according to what I believe is right... in my heart."
    },
    {
      "character": "MARTY",
      "text": "Doc...you're a scientist. So you tell me. What's the right thing to do, up here??"
    },
    {
      "character": "DOC",
      "text": "You're right, Marty."
    },
    {
      "character": "MARTY",
      "text": "Wow, that worked great."
    },
    {
      "character": "DOC",
      "text": "I've at least gotta tell her goodbye."
    },
    {
      "character": "MARTY",
      "text": "C'mon...Doc...I mean, think about it...what are you gonna say to her, \"I gotta go back to the future”?? I mean, she's not gonna understand that, Doc. Hell, I’m in it with ya and I don't even understand it."
    },
    {
      "character": "MARTY",
      "text": "Doc. Listen. Maybe we could...I dunno, maybe we could just take Clara with us."
    },
    {
      "character": "DOC",
      "text": "To the future?"
    },
    {
      "character": "DOC",
      "text": "You've reminded me, Marty, I'm a scientist so I must be scientific about this. I cautioned you about disruption of the continuum for your own personal benefit; therefore I must do no less. We will proceed as planned, and as soon as we return to 1985 we'll destroy this infernal machine. Traveling through time has become much too painful."
    },
    {
      "character": "DOC",
      "text": "You've reminded me, Marty, I'm a scientist so I must be scientific about this. I cautioned you about disruption of the continuum for your own personal benefit; therefore I must do no less. We will proceed as planned, and as soon as we return to 1985 we'll destroy this infernal machine. Traveling through time has become much too painful."
    },
    {
      "character": "DOC",
      "text": "It's Emmett, Clara."
    },
    {
      "character": "CLARA",
      "text": "Oh, Emmett, won't you come in?"
    },
    {
      "character": "DOC",
      "text": "No...I better not. I..."
    },
    {
      "character": "CLARA",
      "text": "What's wrong?"
    },
    {
      "character": "DOC",
      "text": "I've come to say goodbye."
    },
    {
      "character": "CLARA",
      "text": "Goodbye? Well, where ya goin'?"
    },
    {
      "character": "DOC",
      "text": "I'm going away...and I'm afraid I'll never see you again."
    },
    {
      "character": "CLARA",
      "text": "Emmett..."
    },
    {
      "character": "DOC",
      "text": "Clara...I want you to know that I care about you deeply, but I realize that I don't belong here, and I have to go back to where I came from."
    },
    {
      "character": "CLARA",
      "text": "And where might that be?"
    },
    {
      "character": "DOC",
      "text": "...I can't tell you."
    },
    {
      "character": "CLARA",
      "text": "Well, wherever you're going, take me with you!"
    },
    {
      "character": "DOC",
      "text": "I can't, Clara. I wish it didn't have to be this way...but just believe me when I say that I'll never forget you and that...I love you."
    },
    {
      "character": "CLARA",
      "text": "I don't understand what you're trying to say."
    },
    {
      "character": "DOC",
      "text": "Clara...I don't think there's any way that you can understand it."
    },
    {
      "character": "CLARA",
      "text": "Please, Emmett, please...I have to know. If you sincerely do love me...then tell me the truth."
    },
    {
      "character": "DOC",
      "text": "All right then. I'm from the future. I came here in a time machine that I invented and tomorrow I have to go back to the year 1985."
    },
    {
      "character": "CLARA",
      "text": "Yes, Emmett, I do understand. I understand that because you know I'm partial to the writings of Jules Verne you concocted those mendacities in order to take advantage of me!"
    },
    {
      "character": "CLARA",
      "text": "Oh, I've heard some whoppers in my day but the fact that you'd expect me to entertain a notion like that is so...insulting and degrading! All you had to say is \"I don't love you and I don't wanna see you anymore.\" That at least would've been respectful!"
    },
    {
      "character": "DOC",
      "text": "But that's not the truth!"
    },
    {
      "character": "CHESTER",
      "text": "Emmett! What can I get you, the usual?"
    },
    {
      "character": "DOC",
      "text": "No, Chester, I'm gonna need something a lot stronger than that tonight."
    },
    {
      "character": "BARTENDER",
      "text": "Sarsaparilla."
    },
    {
      "character": "DOC",
      "text": "Whiskey, Chester."
    },
    {
      "character": "CHESTER",
      "text": "Whiskey...Emmett, are you sure? You know what happened to you on the fourth of July..."
    },
    {
      "character": "DOC",
      "text": "Whiskey."
    },
    {
      "character": "CHESTER",
      "text": "Okay, I ain't ya papa. I just don't wanna see ya...do the wrong thing. You can leave the bottle."
    },
    {
      "character": "BARBWIRE SALESMAN",
      "text": "It's a woman, right? I knew it! I have seen that look on a man's face a thousand times, all across the country. Well I can tell you, friend. You'll get over her."
    },
    {
      "character": "DOC",
      "text": "Oh-ho. Clara was one in a million. One in a billion. One in a googolplex. The woman of my dreams and I lost her for all time."
    },
    {
      "character": "BARBWIRE SALESMAN",
      "text": "I can assure you, sir, there are other women. If by peddling this barbed wire all across the country has taught me one thing for certain, it's that you never know what the future might bring."
    },
    {
      "character": "DOC",
      "text": "Oh-ho...the future, I can tell you about the future."
    },
    {
      "character": "MARTY",
      "text": "Oh...oh, man, did I sleep...what time is it, Doc?"
    },
    {
      "character": "MARTY",
      "text": "Doc!"
    },
    {
      "character": "BUFORD",
      "text": "Wake up!"
    },
    {
      "character": "BUFORD",
      "text": "I got me a runt to kill!"
    },
    {
      "character": "GANG MEMBER #1",
      "text": "It's still early, boss."
    },
    {
      "character": "GANG MEMBER #2",
      "text": "It's still early!"
    },
    {
      "character": "BUFORD",
      "text": "I'm hungry."
    },
    {
      "character": "DOC",
      "text": "...but in the future, we don't need horses. We have motorized carriages called auto-mo-biles."
    },
    {
      "character": "JEB",
      "text": "If everybody's got one of these auto-whatsits, does anybody walk or run anymore?"
    },
    {
      "character": "DOC",
      "text": "Of course we run. But for recreation, for fun."
    },
    {
      "character": "JEB",
      "text": "Run for fun? Ha-ha, what the hell kinda fun is that?"
    },
    {
      "character": "MARTY",
      "text": "Doc! Doc!"
    },
    {
      "character": "LEVI",
      "text": "How much has he had?"
    },
    {
      "character": "CHESTER",
      "text": "None. That's his first one and he hasn't touched it, yet. He just likes to hold it."
    },
    {
      "character": "MARTY",
      "text": "Doc! Doc!"
    },
    {
      "character": "MARTY",
      "text": "What're you doin'?"
    },
    {
      "character": "DOC",
      "text": "I lost her, Marty. There's nothing left for me here."
    },
    {
      "character": "MARTY",
      "text": "All right, so that's why you've gotta come back with me."
    },
    {
      "character": "DOC",
      "text": "Where?"
    },
    {
      "character": "MARTY",
      "text": "Back to the future!"
    },
    {
      "character": "DOC",
      "text": "Right. Let's get going."
    },
    {
      "character": "MARTY",
      "text": "Great."
    },
    {
      "character": "DOC",
      "text": "Gentlemen, excuse me, but my friend and I have to catch a train."
    },
    {
      "character": "ZEKE",
      "text": "Here's to ya, blacksmith."
    },
    {
      "character": "JEB",
      "text": "And to the future!"
    },
    {
      "character": "LEVI",
      "text": "Amen."
    },
    {
      "character": "DOC",
      "text": "Amen."
    },
    {
      "character": "CHESTER",
      "text": "Emmett, no!!"
    },
    {
      "character": "MARTY",
      "text": "Doc! Doc! Doc! C'mon, Doc, wake up, wake up, Doc."
    },
    {
      "character": "MARTY",
      "text": "How many did he have?"
    },
    {
      "character": "CHESTER",
      "text": "Just the one."
    },
    {
      "character": "MARTY",
      "text": "Just the one?! C'mon, Doc."
    },
    {
      "character": "CHESTER",
      "text": "Now, there's a feller that can't hold his liquor."
    },
    {
      "character": "MARTY",
      "text": "Gimme some coffee... black."
    },
    {
      "character": "CHESTER",
      "text": "Joey, coffee!"
    },
    {
      "character": "CLERK",
      "text": "Ma'am."
    },
    {
      "character": "CLARA",
      "text": "How far does the 8:00 train go?"
    },
    {
      "character": "CLERK",
      "text": "San Francisco's the end of the line."
    },
    {
      "character": "CLARA",
      "text": "I'll take a one-way ticket."
    },
    {
      "character": "CHESTER",
      "text": "You wanna sober him up in a hurry, son, you're gonna have to use somethin' a lot stronger than coffee."
    },
    {
      "character": "MARTY",
      "text": "Yeah, what do you suggest?"
    },
    {
      "character": "CHESTER",
      "text": "Joey. Let's make some wake up juice."
    },
    {
      "character": "CHESTER",
      "text": "In about ten minutes, he's gonna be as sober as a priest on Sunday."
    },
    {
      "character": "MARTY",
      "text": "Ten minutes?! Why do we have to cut these things so damn close?"
    },
    {
      "character": "CHESTER",
      "text": "Here, stick this clothespin on his nose, and when he opens up his mouth, go ahead and pour it on down his gullet. Oh and stand back."
    },
    {
      "character": "DOC",
      "text": "WAHHHHH!! HOT! HOT!"
    },
    {
      "character": "MARTY",
      "text": "He's still out!"
    },
    {
      "character": "CHESTER",
      "text": "Oh, that? That was just a reflex action. It's gonna take a few more minutes for the stuff to really clear up his head."
    },
    {
      "character": "MARTY",
      "text": "Perfect."
    },
    {
      "character": "SEAMUS",
      "text": "Aye. But somethin' inside me told me I should be here. As if my future had somethin' to do with it."
    },
    {
      "character": "CHESTER",
      "text": "He'll come around in a minute."
    },
    {
      "character": "MARTY",
      "text": "C'mon, Doc, c'mon...wake up, now, buddy, c'mon."
    },
    {
      "character": "BUFORD",
      "text": "Are you in there, Eastwood?"
    },
    {
      "character": "MARTY",
      "text": "It's not 8:00 yet!"
    },
    {
      "character": "BUFORD",
      "text": "It is by my watch! Let's settle this once and for all, runt. Or ain't you got the gumption?"
    },
    {
      "character": "MARTY",
      "text": "Listen. I'm not really feelin' up to this today. So I'm gonna have to forfeit!"
    },
    {
      "character": "BUFORD",
      "text": "Forfeit? Forfeit! What's that mean?"
    },
    {
      "character": "GANG MEMBER",
      "text": "Uh...it means that you win without a fight."
    },
    {
      "character": "BUFORD",
      "text": "Without shootin'? Hey, he can't do that. You can't do that! You know what I think? I think you ain't nothin' but a gutless yella turd. And I'm givin' ya to the count of 10 to come out here and prove I'm wrong. 1..."
    },
    {
      "character": "MARTY",
      "text": "Doc!! C'mon, sober up, buddy, let's go."
    },
    {
      "character": "BUFORD",
      "text": "2..."
    },
    {
      "character": "ZEKE",
      "text": "You better get out there son - I got $20 gold bet on ya so don't let me down."
    },
    {
      "character": "LEVI",
      "text": "I got $30 gold bet again’ ya so don't let ME down."
    },
    {
      "character": "BUFORD",
      "text": "3...4..."
    },
    {
      "character": "JEB",
      "text": "You better face up to it son, 'cause if you don't go out there..."
    },
    {
      "character": "BUFORD",
      "text": "5..."
    },
    {
      "character": "MARTY",
      "text": "What? What if I don't go out there?"
    },
    {
      "character": "LEVI",
      "text": "You're a coward!"
    },
    {
      "character": "BUFORD",
      "text": "6..."
    },
    {
      "character": "TOOTHLESS",
      "text": "And you'll be branded a coward for the rest of your days!"
    },
    {
      "character": "JEB",
      "text": "Ever'body, everwhere, will say Clint Eastwood is the biggest yella belly in the west."
    },
    {
      "character": "BUFORD",
      "text": "7..."
    },
    {
      "character": "MAN",
      "text": "Here..."
    },
    {
      "character": "BUFORD",
      "text": "8..."
    },
    {
      "character": "MARTY",
      "text": "I already got a gun."
    },
    {
      "character": "BUFORD",
      "text": "9..."
    },
    {
      "character": "BUFORD",
      "text": "10! You hear me, runt? I said that's ten, you gutless yella pie slinger."
    },
    {
      "character": "MARTY",
      "text": "He's an asshole! I don't care what Tannen says! And I don't care what anybody else says either."
    },
    {
      "character": "DOC",
      "text": "Whoa!"
    },
    {
      "character": "MARTY",
      "text": "Doc, Doc, you okay??!!"
    },
    {
      "character": "DOC",
      "text": "I think so...whoa, what a headache!"
    },
    {
      "character": "MARTY",
      "text": "Listen, you got a back door to this place?"
    },
    {
      "character": "CHESTER",
      "text": "Yeah, it's in the back."
    },
    {
      "character": "MARTY",
      "text": "C'mon, Doc, let's go."
    },
    {
      "character": "BUFORD",
      "text": "Are you comin' out here, runt, or do I have to go in there after ya?"
    },
    {
      "character": "DOC",
      "text": "The thing I really miss here is Tylenol."
    },
    {
      "character": "GANG MEMBER",
      "text": "Hey! Freeze, blacksmith!"
    },
    {
      "character": "BARBWIRE SALESMAN",
      "text": "Yessir, that poor fella last night had the biggest case of broken heart I have ever seen! And when he said that he didn't know how he could live the rest of his life knowing how much hurt he'd caused that little girl? Well, I really felt for him. I did. Right here."
    },
    {
      "character": "BUFORD",
      "text": "Listen up, Eastwood! I intend to shoot somebody today and I prefer'd it be you. But if you're just too damn yella, I guess it'll just have to be your blacksmith friend."
    },
    {
      "character": "DOC",
      "text": "Forget about me, Marty, and save yourself!"
    },
    {
      "character": "BUFORD",
      "text": "You got one minute to decide. You hear me runt? One minute!"
    },
    {
      "character": "BARBWIRE SALESMAN",
      "text": "I never seen a man so broken up over a woman. What'd you say her name was? Cara? Sara?"
    },
    {
      "character": "BARBWIRE SALESMAN’S COMPANION",
      "text": "Clara?"
    },
    {
      "character": "BARBWIRE SALESMAN",
      "text": "Clara!"
    },
    {
      "character": "CLARA",
      "text": "Excuse me."
    },
    {
      "character": "BARBWIRE SALESMAN",
      "text": "Ma'am?"
    },
    {
      "character": "CLARA",
      "text": "But was this man tall, with great big brown puppy dog eyes and long silvery flowing hair??"
    },
    {
      "character": "BARBWIRE SALESMAN",
      "text": "You know him?"
    },
    {
      "character": "CLARA",
      "text": "Emmett!"
    },
    {
      "character": "BUFORD",
      "text": "Time's up, runt! Prepare to meet your Maker, blacksmith."
    },
    {
      "character": "MARTY",
      "text": "Right here, Tannen!"
    },
    {
      "character": "BUFORD",
      "text": "Draw!"
    },
    {
      "character": "MARTY",
      "text": "No!"
    },
    {
      "character": "MARTY",
      "text": "I thought we could settle this like men."
    },
    {
      "character": "BUFORD",
      "text": "You thought wrong, dude."
    },
    {
      "character": "BUFORD",
      "text": "Ahh, thank ya."
    },
    {
      "character": "BUFORD",
      "text": "Ahh, thank ya."
    },
    {
      "character": "DEPUTY",
      "text": "Buford Tannen, you're under arrest for robbin' the Pine City Stage. You got anything to say?"
    },
    {
      "character": "BUFORD",
      "text": "I hate manure."
    },
    {
      "character": "MARTY",
      "text": "YES!"
    },
    {
      "character": "DOC",
      "text": "The train!"
    },
    {
      "character": "MARTY",
      "text": "Can we make it?"
    },
    {
      "character": "DOC",
      "text": "We'll have to cut 'em off at Coyote Pass!"
    },
    {
      "character": "LITTLE BOY",
      "text": "Hey Mister...Mr. Eastwood. Here's your gun, Mister."
    },
    {
      "character": "MARTY",
      "text": "Thanks, kid."
    },
    {
      "character": "MARTY",
      "text": "Seamus!"
    },
    {
      "character": "MARTY",
      "text": "Worth $12, never been used."
    },
    {
      "character": "SEAMUS",
      "text": "Maybe I'll trade it for a new hat."
    },
    {
      "character": "MARTY",
      "text": "Right, and take care of that baby!"
    },
    {
      "character": "SEAMUS",
      "text": "I will!"
    },
    {
      "character": "CLARA",
      "text": "Emmett! Emmett! Emmett!"
    },
    {
      "character": "DOC",
      "text": "C'mon Marty!"
    },
    {
      "character": "MARTY",
      "text": "Ah! Ah!"
    },
    {
      "character": "DOC",
      "text": "Ah, gimme your hand!"
    },
    {
      "character": "MARTY",
      "text": "Ahhh! Whoa! Whoa! Ahh!"
    },
    {
      "character": "DOC",
      "text": "Wa-ha!"
    },
    {
      "character": "MARTY",
      "text": "Whoa!"
    },
    {
      "character": "DOC",
      "text": "Hoo! C'mon, Marty!"
    },
    {
      "character": "MARTY",
      "text": "Ahhhhh!"
    },
    {
      "character": "DOC",
      "text": "C'mon, let's go! Masks on."
    },
    {
      "character": "DOC",
      "text": "Freeze!"
    },
    {
      "character": "ENGINEER",
      "text": "Is this a holdup?"
    },
    {
      "character": "DOC",
      "text": "It's a science experiment! Stop the train just before ya hit the switch track up ahead."
    },
    {
      "character": "MARTY",
      "text": "Doc!"
    },
    {
      "character": "DOC",
      "text": "Uncouple the cars from the tender!"
    },
    {
      "character": "DOC",
      "text": "I've wanted to do that my whole life!"
    },
    {
      "character": "MARTY",
      "text": "What are these things, anyway?"
    },
    {
      "character": "CLARA",
      "text": "Hi-yah!"
    },
    {
      "character": "MARTY",
      "text": "Ready to roll!"
    },
    {
      "character": "CLARA",
      "text": "EMMETT!"
    },
    {
      "character": "DOC",
      "text": "Marty. are the time circuits on?"
    },
    {
      "character": "MARTY",
      "text": "Check, Doc."
    },
    {
      "character": "DOC",
      "text": "Input the destination time - October 27, 1985, 11 AM."
    },
    {
      "character": "MARTY",
      "text": "We're cruising at a steady 25 miles an hour, Doc."
    },
    {
      "character": "DOC",
      "text": "I'm throwing in the Presto Logs."
    },
    {
      "character": "DOC",
      "text": "Marty, the new gauge will show the boiler temperature."
    },
    {
      "character": "MARTY",
      "text": "Why, what happens when it hits two thousand?"
    },
    {
      "character": "DOC",
      "text": "The whole boiler explodes."
    },
    {
      "character": "MARTY",
      "text": "Perfect."
    },
    {
      "character": "MARTY",
      "text": "Hey, Doc, we just hit 35!"
    },
    {
      "character": "DOC",
      "text": "Okay, Marty, I'm comin' aboard!"
    },
    {
      "character": "CLARA",
      "text": "Emmett!"
    },
    {
      "character": "MARTY",
      "text": "Come on, come on."
    },
    {
      "character": "MARTY",
      "text": "You better hold on to somethin', Doc, the yellow log's about to blow!!!"
    },
    {
      "character": "CLARA",
      "text": "Ahh!"
    },
    {
      "character": "CLARA",
      "text": "Golly."
    },
    {
      "character": "MARTY",
      "text": "We just passed 40!"
    },
    {
      "character": "CLARA",
      "text": "Emmett! Emmett! Emmett!"
    },
    {
      "character": "MARTY",
      "text": "We just passed 45, Doc, go for it!"
    },
    {
      "character": "MARTY",
      "text": "Fifty."
    },
    {
      "character": "CLARA",
      "text": "Emmett!"
    },
    {
      "character": "DOC",
      "text": "Clara!"
    },
    {
      "character": "CLARA",
      "text": "I love you."
    },
    {
      "character": "MARTY",
      "text": "Doc, Doc! What's happening??"
    },
    {
      "character": "DOC",
      "text": "It's Clara, she's on the train!"
    },
    {
      "character": "MARTY",
      "text": "Clara!"
    },
    {
      "character": "MARTY",
      "text": "Perfect."
    },
    {
      "character": "DOC",
      "text": "She's in the cab. I'm gonna go back for her."
    },
    {
      "character": "MARTY",
      "text": "The windmill! Doc, the windmill! We're goin' past 60; you'll never make it!"
    },
    {
      "character": "DOC",
      "text": "Then we'll have to take her back with us! Keep calling out the speed!"
    },
    {
      "character": "DOC",
      "text": "Clara, climb out here to me!"
    },
    {
      "character": "CLARA",
      "text": "I don't know if I can!"
    },
    {
      "character": "DOC",
      "text": "You can do it! Just don't look down...that's it!"
    },
    {
      "character": "MARTY",
      "text": "Sixty miles an hour, Doc!!"
    },
    {
      "character": "DOC",
      "text": "You're doin' fine! Nice and steady! Come on! Just a little further!"
    },
    {
      "character": "CLARA",
      "text": "I can't Emmett, I'm scared!"
    },
    {
      "character": "MARTY",
      "text": "SEVENTY!"
    },
    {
      "character": "DOC",
      "text": "Come on...you're doin' fine...nice and easy...that's it...don't look down..."
    },
    {
      "character": "MARTY",
      "text": "DOC! THE RED LOG'S ABOUT TO BLOW!!!"
    },
    {
      "character": "DOC",
      "text": "Clara!!"
    },
    {
      "character": "DOC",
      "text": "Whoa!!"
    },
    {
      "character": "CLARA",
      "text": "Emmett!"
    },
    {
      "character": "DOC",
      "text": "Clara! Hold on!"
    },
    {
      "character": "CLARA",
      "text": "I can't!"
    },
    {
      "character": "MARTY",
      "text": "Doc! I'm gonna slip you the hoverboard."
    },
    {
      "character": "DOC",
      "text": "Marty! Watch out!"
    },
    {
      "character": "MARTY",
      "text": "Ahhh!!!"
    },
    {
      "character": "CLARA",
      "text": "AHHH!! AHH! EMMETT, HELP!"
    },
    {
      "character": "DOC",
      "text": "Hold on, Clara! Whoo!"
    },
    {
      "character": "MARTY",
      "text": "Doc! Catch it!"
    },
    {
      "character": "DOC",
      "text": "Whoa!"
    },
    {
      "character": "MARTY",
      "text": "YES! YES!"
    },
    {
      "character": "CLARA",
      "text": "Emmett!"
    },
    {
      "character": "DOC",
      "text": "Hold on!"
    },
    {
      "character": "MARTY",
      "text": "YES!"
    },
    {
      "character": "MARTY",
      "text": "Shit!"
    },
    {
      "character": "MARTY",
      "text": "AHHH!!!"
    },
    {
      "character": "MARTY",
      "text": "Well, Doc, it's destroyed."
    },
    {
      "character": "MARTY",
      "text": "Just like you wanted."
    },
    {
      "character": "BIFF",
      "text": "Hey butthead! Get away from-"
    },
    {
      "character": "MARTY",
      "text": "Watch it, Biff!"
    },
    {
      "character": "BIFF",
      "text": "Marty! I - I didn't mean to scare ya! I didn't recognize you in those clothes!"
    },
    {
      "character": "MARTY",
      "text": "What the hell are you doin'?"
    },
    {
      "character": "BIFF",
      "text": "Uh...just puttin' on the second coat now!"
    },
    {
      "character": "BIFF",
      "text": "You goin' cowboy, huh?"
    },
    {
      "character": "DAVE",
      "text": "C'mon, guys, we'll be late for brunch."
    },
    {
      "character": "LINDA",
      "text": "Come on, Dad, they won't hold your reservations all day!"
    },
    {
      "character": "GEORGE",
      "text": "Lorraine, have you seen my glasses?"
    },
    {
      "character": "LORRAINE",
      "text": "They're in your suede jacket, honey."
    },
    {
      "character": "LORRAINE",
      "text": "Marty, We thought you went to the lake."
    },
    {
      "character": "LINDA",
      "text": "You wore that to the lake?"
    },
    {
      "character": "MARTY",
      "text": "Thank God you guys are all back to normal."
    },
    {
      "character": "DAVE",
      "text": "Hey Marty, who're you supposed to be, Clint Eastwood?"
    },
    {
      "character": "MARTY",
      "text": "Right. I gotta go get Jennifer."
    },
    {
      "character": "BIFF",
      "text": "I really like that hat, Marty."
    },
    {
      "character": "MARTY",
      "text": "Thanks, Biff."
    },
    {
      "character": "MARTY",
      "text": "Jennifer. Jen. Jennifer. Wake up."
    },
    {
      "character": "JENNIFER",
      "text": "Marty."
    },
    {
      "character": "JENNIFER",
      "text": "I had the worst nightmare."
    },
    {
      "character": "JENNIFER",
      "text": "Marty, that dream I had was so real. It was about the future. It was about us...and you got fired."
    },
    {
      "character": "MARTY",
      "text": "What do you mean, I got fired?"
    },
    {
      "character": "MARTY",
      "text": "Hilldale! This is where we live...I...I mean, this is, uh, this is where we're gonna live. Someday."
    },
    {
      "character": "JENNIFER",
      "text": "Marty...it was a dream, wasn't it?"
    },
    {
      "character": "NEEDLES",
      "text": "Hey! The big \"M\". How's it hangin', McFly?"
    },
    {
      "character": "MARTY",
      "text": "Hey, Needles."
    },
    {
      "character": "NEEDLES",
      "text": "Nice set of wheels. Let's see what she can do...next green light."
    },
    {
      "character": "MARTY",
      "text": "No thanks."
    },
    {
      "character": "NEEDLES",
      "text": "What's the matter? Chicken?"
    },
    {
      "character": "JENNIFER",
      "text": "Marty...don't."
    },
    {
      "character": "MARTY",
      "text": "Grab a hold of somethin'."
    },
    {
      "character": "JENNIFER",
      "text": "Did you do that on purpose?"
    },
    {
      "character": "MARTY",
      "text": "Yeah. You think I was stupid enough to race that asshole?"
    },
    {
      "character": "MARTY",
      "text": "Geez...I woulda hit that Rolls Royce."
    },
    {
      "character": "JENNIFER",
      "text": "Erased."
    },
    {
      "character": "JENNIFER",
      "text": "You're right. There's not much left."
    },
    {
      "character": "MARTY",
      "text": "Doc's never comin' back. I'm sure gonna miss him, Jen."
    },
    {
      "character": "MARTY",
      "text": "Geez...I woulda hit that Rolls Royce."
    },
    {
      "character": "JENNIFER",
      "text": "Erased."
    },
    {
      "character": "JENNIFER",
      "text": "You're right. There's not much left."
    },
    {
      "character": "MARTY",
      "text": "Doc's never comin' back. I'm sure gonna miss him, Jen."
    },
    {
      "character": "MARTY",
      "text": "What the hell?"
    },
    {
      "character": "MARTY",
      "text": "Doc!"
    },
    {
      "character": "DOC",
      "text": "Marty!"
    },
    {
      "character": "MARTY",
      "text": "Doc! Doc!"
    },
    {
      "character": "DOC",
      "text": "Marty! It runs on steam!"
    },
    {
      "character": "DOC",
      "text": "Meet the family. Clara, you know."
    },
    {
      "character": "CLARA",
      "text": "Hi, Marty!"
    },
    {
      "character": "MARTY",
      "text": "Ma'am!"
    },
    {
      "character": "DOC",
      "text": "These are our boys!"
    },
    {
      "character": "DOC",
      "text": "Jules…and Verne! Boys, this is Marty and Jennifer."
    },
    {
      "character": "MARTY",
      "text": "Doc, I thought I'd never see you again!"
    },
    {
      "character": "DOC",
      "text": "Can't keep a good scientist down. After all, I had to come back for Einstein, and I didn't want you to be worried about me."
    },
    {
      "character": "DOC",
      "text": "Oh. I brought you a little souvenir."
    },
    {
      "character": "MARTY",
      "text": "It's great Doc. Thanks!"
    },
    {
      "character": "JENNIFER",
      "text": "Doctor Brown?"
    },
    {
      "character": "JENNIFER",
      "text": "I brought this note back from the future and...now it's erased!"
    },
    {
      "character": "DOC",
      "text": "Of course it's erased!"
    },
    {
      "character": "JENNIFER",
      "text": "But what does that mean?"
    },
    {
      "character": "DOC",
      "text": "It means that your future hasn't been written yet. No one's has. Your future is whatever you make it. So make it a good one. Both of ya!"
    },
    {
      "character": "MARTY",
      "text": "We will, Doc!"
    },
    {
      "character": "DOC",
      "text": "Stand back!"
    },
    {
      "character": "DOC",
      "text": "All right, boys, buckle up!"
    },
    {
      "character": "MARTY",
      "text": "Hey, Doc...where ya goin' now? Back to the future?"
    },
    {
      "character": "DOC",
      "text": "Nope. Already been there!"
    }
  ],
  "imdbId": "tt0099088",
  "poster": "https://m.media-amazon.com/images/M/MV5BNTNkNzJmY2MtOGNjYi00NDJmLWIyZTQtNmFmMGQ5M2VlOTI0XkEyXkFqcGc@._V1_SX300.jpg",
  "rated": "PG",
  "runtime": "118 min",
  "genre": "Adventure, Comedy, Sci-Fi",
  "director": "Robert Zemeckis",
  "topSpeakingCast": [
    "MARTY",
    "DOC",
    "BUFORD",
    "CLARA",
    "1955 DOC",
    "SEAMUS",
    "CHESTER",
    "COLT GUN SALESMAN",
    "JENNIFER"
  ]
}
