{
  "id": "encanto",
  "title": "Encanto",
  "year": 2021,
  "characters": [
    "ABUELA",
    "ALL",
    "BOTH",
    "BRUNO",
    "CHORUS",
    "JULIETA",
    "MAN",
    "MIRABEL"
  ],
  "lines": [
    {
      "character": "ABUELA",
      "text": "Mirabel."
    },
    {
      "character": "ABUELA",
      "text": "I’m sorry."
    },
    {
      "character": "ABUELA",
      "text": "I didn’t want to hurt us. I just wanted to be something I’m not."
    },
    {
      "character": "ABUELA",
      "text": "I’ve never been able to come back here. This river is where we were given our miracle. Where Abuelo Pedro…"
    },
    {
      "character": "ABUELA",
      "text": "I thought we would have a different life. I thought I would be a different woman."
    },
    {
      "character": "MAN",
      "text": "Two caterpillars"
    },
    {
      "character": "MAN",
      "text": "In love Spend their nights and dawns Full of hunger They keep walking And navigating the world That changes and keeps changing Navigating a world That changes and keeps changing"
    },
    {
      "character": "MAN",
      "text": "Two caterpillars stop the wind As they hold each other with warmth and consent Keep growing They don’t know when To find some corner shelter The time keeps changing They are inseparable And the weather keeps changing"
    },
    {
      "character": "MAN",
      "text": "Oh, caterpillars Don’t hold each other any longer You must grow apart and return That’s the way forward Miracles are coming Chrysalises are coming You must part And construct your own future"
    },
    {
      "character": "MAN",
      "text": "Oh, caterpillars Don’t hold each other any longer You must grow apart and return That’s the way forward Miracles are coming Chrysalises are coming You must part And construct your own future"
    },
    {
      "character": "MAN",
      "text": "Two caterpillars Disoriented In two cocoons All bundled up"
    },
    {
      "character": "ABUELA",
      "text": "I was given a miracle. A second chance. And I was so afraid to lose it that I lost sight of who our miracle was for. And I am so sorry. You never hurt our family, Mirabel. We are broken… because of me."
    },
    {
      "character": "MIRABEL",
      "text": "Abuela. I can finally see. You lost your home. Lost everything. You suffered so much, all alone, so it would never happen again. We were saved because of you. We were given a miracle, because of you. We are a family, because of you. And nothing could ever be broken that we can’t fix… together."
    },
    {
      "character": "ABUELA",
      "text": "I asked my Pedro for help. Mirabel. He sent me you."
    },
    {
      "character": "MAN",
      "text": "Oh, butterflies Don’t hold each other any longer You must grow apart and return That’s the way forward You are already miracles Breaking chrysalises You must fly And find your own future"
    },
    {
      "character": "BRUNO",
      "text": "She didn’t do this! Whoa! She didn’t do this! I gave her a vision! It was me! I was, like, “Go!” And she was, like… She only wanted to help. I don’t care what you think of me, but if you’re too stubborn to…"
    },
    {
      "character": "ABUELA",
      "text": "Brunito. I feel like I missed something important. Come on."
    },
    {
      "character": "BRUNO",
      "text": "What… What’s happening? Where are we going?"
    },
    {
      "character": "ABUELA",
      "text": "Home."
    },
    {
      "character": "BRUNO",
      "text": "It’s her! I found her! I found her! She’s back! She’s back, she’s back!"
    },
    {
      "character": "JULIETA",
      "text": "Mirabel!"
    },
    {
      "character": "JULIETA",
      "text": "Mirabel! Mamá. Mi amor, I was so worried. We couldn’t find you. There were bees everywhere. I’ll be okay. Uh… Not if we don’t have a house. What? We don’t have a house. I can’t say we don’t have a house? What is that? Not a house."
    },
    {
      "character": "ALL",
      "text": "Look at this home We need a new foundation It may seem hopeless But we’ll get by just fine Look at this family A glowing constellation So full of stars And everybody wants to shine But the stars don’t shine They burn And the constellations shift I think it’s time you learn You’re more Than just your Gift And I’m sorry I held on too tight Just so afraid I’d lose you too The miracle is not Some magic that you’ve got"
    },
    {
      "character": "ALL",
      "text": "The miracle is you Not some Gift Just you The miracle is you All of you All of you"
    },
    {
      "character": "ALL",
      "text": "Okay so We gonna talk about Bruno?"
    },
    {
      "character": "ALL",
      "text": "That’s Bruno?"
    },
    {
      "character": "ALL",
      "text": "Yeah There’s a lot to say About Bruno I’ll start, okay"
    },
    {
      "character": "ALL",
      "text": "Pepa, I’m sorry About your wedding Didn’t mean to be upsetting That wasn’t a prophecy I could just see You were sweating And I wanted you to know That your bro loves you so Let it in, let it out Let it rain, let it snow Let it go That’s what I’m always saying, bro I got a lot of apologies I got to say"
    },
    {
      "character": "ALL",
      "text": "Hey, we’re just happy that you’re here, okay? Come into the light That trip was only a night And no matter what happens We’re gonna find our way Yo, I knew he never left I heard him every day"
    },
    {
      "character": "ALL",
      "text": "What’s that sound?"
    },
    {
      "character": "ALL",
      "text": "I think it’s everyone in town"
    },
    {
      "character": "ALL",
      "text": "Hey Lay down your load Lay down your load Roll me down the road Roll me down the road We have no Gifts But we are many And we’ll do anything for you It’s a dream When we work as a team"
    },
    {
      "character": "ALL",
      "text": "You’re so strong"
    },
    {
      "character": "ALL",
      "text": "Yeah, but sometimes I cry"
    },
    {
      "character": "BOTH",
      "text": "So do I"
    },
    {
      "character": "ALL",
      "text": "I may not be as strong But I’m getting wiser Yeah, I need sunlight And fertilizer Come on Let’s plant something new And watch it fly Straight up to the sky Let’s go"
    },
    {
      "character": "ALL",
      "text": "The stars don’t shine They burn The constellations glow The seasons change in turn Would you watch Our little girl go"
    },
    {
      "character": "ALL",
      "text": "She takes after you"
    },
    {
      "character": "ALL",
      "text": "Hey, Mariano Why so blue? I just have So much love inside You know I’ve got this cousin too Have you met Dolores?"
    },
    {
      "character": "ALL",
      "text": "Okay, I’ll take it from here. Goodbye!"
    },
    {
      "character": "ALL",
      "text": "You talk so loud You take care of your mother And you make her proud You write your own poetry Every night When you go to sleep And I’m seizing the moment So would you wake up And notice me"
    },
    {
      "character": "ALL",
      "text": "Dolores, I see you. And I hear you."
    },
    {
      "character": "BOTH",
      "text": "Yes!"
    },
    {
      "character": "CHORUS",
      "text": "All of you All of you"
    },
    {
      "character": "ALL",
      "text": "Let’s get married."
    },
    {
      "character": "ALL",
      "text": "Slow down."
    },
    {
      "character": "CHORUS",
      "text": "All of you All of you"
    },
    {
      "character": "ALL",
      "text": "Home sweet home I like the new foundation It isn’t perfect"
    },
    {
      "character": "ALL",
      "text": "Neither are we"
    },
    {
      "character": "ALL",
      "text": "That’s true Just one more thing Before the celebration"
    },
    {
      "character": "ALL",
      "text": "What?"
    },
    {
      "character": "ALL",
      "text": "We need a doorknob We made this one for you."
    },
    {
      "character": "ALL",
      "text": "We see How bright you burn We see how brave you’ve been Now see yourself in turn You’re the real Gift, kid Let us in Open your eyes"
    },
    {
      "character": "ALL",
      "text": "What do you see?"
    },
    {
      "character": "MIRABEL",
      "text": "I see… me. All of me"
    },
    {
      "character": "ALL",
      "text": "Hola, Casita."
    },
    {
      "character": "ALL",
      "text": "Whoa! Come on! Get in here!"
    },
    {
      "character": "MAN",
      "text": "Party night Everyone’s coming to celebrate"
    },
    {
      "character": "MAN",
      "text": "Party night Everyone’s coming to have fun Keep dancing"
    },
    {
      "character": "MAN",
      "text": "Happy in my paradise"
    },
    {
      "character": "MAN",
      "text": "And revealing"
    },
    {
      "character": "MAN",
      "text": "Miracles on every floor"
    },
    {
      "character": "MAN",
      "text": "Enchantment Enchantment"
    },
    {
      "character": "MAN",
      "text": "Yeah, amor!"
    },
    {
      "character": "ABUELA",
      "text": "Everyone, together…"
    },
    {
      "character": "ALL",
      "text": "La Familia Madrigal!"
    },
    {
      "character": "BRUNO",
      "text": "Hey!"
    },
    {
      "character": "ALL",
      "text": "Enchantment Enchantment Opening doors The morning is arriving They stay open And the coffee is made at home Happy song So that good wins over bad Don’t wake me up This looks like a real dream Colombia, I love you so much"
    },
    {
      "character": "ALL",
      "text": "I always fall in love with your enchantment"
    },
    {
      "character": "ALL",
      "text": "Colombia, I love you so much"
    },
    {
      "character": "ALL",
      "text": "Your charm continues to bless you Colombia Enchantment Enchantment"
    },
    {
      "character": "ALL",
      "text": "Enchantment Enchantment"
    },
    {
      "character": "ALL",
      "text": "Colombia, I love you so much Your name has an enchantment From Bogotá to Palenque I went with everybody Colombia, beautiful earth Mother Nature gave you your form"
    },
    {
      "character": "ALL",
      "text": "Colombia stays my favorite place"
    },
    {
      "character": "ALL",
      "text": "Colombia, I love you so much"
    },
    {
      "character": "ALL",
      "text": "I always fall in love with your enchantment"
    },
    {
      "character": "ALL",
      "text": "Colombia, I love you so much"
    },
    {
      "character": "ALL",
      "text": "May you keep blessing your enchantment"
    },
    {
      "character": "ALL",
      "text": "Enchantment Enchantment"
    },
    {
      "character": "ALL",
      "text": "Enchantment Enchantment"
    },
    {
      "character": "ALL",
      "text": "Party night Everyone’s coming to celebrate Party night Everyone’s coming to have fun Keep dancing"
    },
    {
      "character": "ALL",
      "text": "Happy in my paradise"
    },
    {
      "character": "ALL",
      "text": "And revealing"
    },
    {
      "character": "ALL",
      "text": "Miracles on every floor"
    },
    {
      "character": "ALL",
      "text": "Enchantment Enchantment"
    },
    {
      "character": "ALL",
      "text": "Colombia, I love you so much"
    },
    {
      "character": "ALL",
      "text": "I always fall in love with your enchantment"
    },
    {
      "character": "ALL",
      "text": "Colombia, I love you so much"
    },
    {
      "character": "ALL",
      "text": "May you keep blessing your enchantment"
    },
    {
      "character": "ALL",
      "text": "Enchantment Enchantment"
    },
    {
      "character": "ALL",
      "text": "Enchantment Enchantment"
    },
    {
      "character": "MAN",
      "text": "Two oruguitas In love and yearning Spend every evening And morning learning To hold each other Their hunger burning To navigate a world That’s changing Never stops turning Together in this world That’s changing Never stops turning"
    },
    {
      "character": "MAN",
      "text": "Two oruguitas Against the weather The wind grows colder As they’re together They hold each other No way of knowing They’re all they have for shelter And something inside them is growing They’ll all just stay together But something inside them is growing"
    },
    {
      "character": "MAN",
      "text": "Aye, oruguitas Don’t you hold on too tight Both of you know It’s your time to grow To fall apart To reunite Wonders await you Just on the other side Trust they’ll be there Start to prepare Don’t wait for tomorrow"
    },
    {
      "character": "MAN",
      "text": "Aye, oruguitas Don’t you hold on too tight Both of you know It’s your time to grow To fall apart To reunite Wonders await you Just on the other side Trust they’ll be there Start to prepare Don’t wait for tomorrow"
    },
    {
      "character": "MAN",
      "text": "Two oruguitas Cocooned and waiting Each in their own world Anticipating What happens after The rearranging And so afraid of change In a world that never stops changing So let the walls come down The world will never stop changing Never stop changing Never stop changing Never stop changing"
    },
    {
      "character": "MAN",
      "text": "Aye, mariposa Don’t you hold on too tight Both of you know It’s your time to go To fly apart To reunite Wonders surround you Just let the walls come down Don’t look behind you Fly till you find Your way till tomorrow"
    },
    {
      "character": "MAN",
      "text": "Aye, mariposa Don’t you hold on too tight Both of you know It’s your time to grow To fly apart To reunite Wonders surround you Just let the walls come down Don’t look behind you Fly till you find Your way till tomorrow"
    },
    {
      "character": "MAN",
      "text": "Aye, mariposa Don’t you hold on too tight Both of you know It’s your time to grow To fly apart To reunite Wonders surround you Just let the walls come down Don’t look behind you Fly till you find Your way till tomorrow"
    }
  ],
  "lineCount": 99,
  "characterCount": 8,
  "topCastCount": 2,
  "topCast": [
    "MAN",
    "ABUELA"
  ],
  "imdbId": "tt2953050",
  "poster": "https://m.media-amazon.com/images/M/MV5BNGEyNzk2M2MtNjBhZS00MzYwLWI0Y2YtYjc5ZWE2MjM0YWE5XkEyXkFqcGc@._V1_SX300.jpg",
  "rated": "PG",
  "runtime": "102 min",
  "genre": "Animation, Comedy, Family",
  "director": "Jared Bush, Byron Howard, Charise Castro Smith",
  "topSpeakingCast": [
    "ALL",
    "MAN",
    "ABUELA"
  ]
}
