{
  "id": "frozen-2",
  "title": "Frozen II",
  "year": 2019,
  "characters": [
    "AGNARR",
    "ALL",
    "ANNA",
    "ANNA & ELSA",
    "ANNA & KRISTOFF",
    "ANNA & OLAF",
    "ANNA, ELSA, & KRISTOFF",
    "ARENDELLIAN SOLDIER",
    "BULDA",
    "ELSA",
    "ELSA AND IDUNA",
    "ELSA, OLAF, & KRISTOFF",
    "GRAND PABBIE",
    "HOMEOMAREN",
    "HOMEYMAREN",
    "HONEYMAREN",
    "HONEYMAREN & ELSA",
    "IDUNA",
    "KAI",
    "KING RUNEARD",
    "KRISTOFF",
    "LT. MATTIAS",
    "MAN",
    "MAN #2",
    "MAN #3",
    "MARSHMALLOW",
    "MATTIAS",
    "NORTHULDRA LEADER",
    "OLAF",
    "RUNEARD",
    "RYDER",
    "SVEN",
    "TOWNSPEOPLE",
    "YELANA",
    "YELENA"
  ],
  "lines": [
    {
      "character": "AGNARR",
      "text": "Anna, Elsa!"
    },
    {
      "character": "IDUNA",
      "text": "Bed time's soon!"
    },
    {
      "character": "ANNA",
      "text": "Uh oh! The princess is trapped in the snow goblin's evil spell! Quick Elsa, make a prince, a fancy one! Oh no, the prince is stuck too! \"Who cares about danger when there's love?\""
    },
    {
      "character": "ELSA",
      "text": "Ugh, Anna, blegh... Kissing won't save the forest! (chuckling) The Lost Fairies cry out! (Mimicking elephant trumpets) What sound does a giraffe make? Nevermind! They wake the Fairy Queen, who breaks the spell and saves everyone!"
    },
    {
      "character": "ANNA",
      "text": "And they all get married! (laughing)"
    },
    {
      "character": "AGNARR",
      "text": "What are you playing?"
    },
    {
      "character": "ANNA",
      "text": "Enchanted forest!"
    },
    {
      "character": "AGNARR",
      "text": "That's like no Enchanted Forest I've ever seen."
    },
    {
      "character": "ELSA",
      "text": "You've seen an Enchanted Forest?"
    },
    {
      "character": "ANNA",
      "text": "Wait, what?"
    },
    {
      "character": "AGNARR",
      "text": "I have. Once."
    },
    {
      "character": "ANNA",
      "text": "And you never told us this before?"
    },
    {
      "character": "AGNARR",
      "text": "Well, I could tell you now... If you..."
    },
    {
      "character": "ELSA",
      "text": "Okay, tell us now!"
    },
    {
      "character": "IDUNA",
      "text": "Are you sure about this?"
    },
    {
      "character": "AGNARR",
      "text": "It's time they know..."
    },
    {
      "character": "AGNARR",
      "text": "If they can settle and listen. (chuckles) Far away, as north as we can go, stood a very old and very Enchanted Forest. But its magic wasn't that of goblin spells and lost fairies. It was protected by the most powerful spirits of all... Those of air, fire, water, and earth. But it was also a home to the mysterious Northuldra people."
    },
    {
      "character": "ELSA",
      "text": "Were the Northuldra magical, like me?"
    },
    {
      "character": "AGNARR",
      "text": "No Elsa, they were not magical, they just took advantage of the forest gifts. Their ways were so different from ours. But still, they promised us friendship. In honor of that, your grandfather, King Runeard, built them a mighty dam to strengthen their waters. It was a gift of peace."
    },
    {
      "character": "ANNA",
      "text": "That's a big gift of peace."
    },
    {
      "character": "AGNARR",
      "text": "And I was so honored to get to go to the forest to celebrate it."
    },
    {
      "character": "RUNEARD",
      "text": "Stand tall, Agnarr."
    },
    {
      "character": "AGNARR",
      "text": "I wasn't at all prepared for what the day would bring. We let down our guard. We were charmed. And it felt so... magical. But something went wrong. (yelling) They were attacking us!"
    },
    {
      "character": "MATTIAS",
      "text": "Get behind me!"
    },
    {
      "character": "AGNARR",
      "text": "It was a brutal battle. Your grandfather ..."
    },
    {
      "character": "AGNARR",
      "text": "Father!"
    },
    {
      "character": "AGNARR",
      "text": "...was lost. The fighting enraged the spirits. They turned their magic against us all. (grunts) (vocalizing) There was this... voice. And someone saved me. I'm told, the spirits then vanished. And a powerful mist covered the forest, locking everyone out. (Wind whooshing) And that night, I came home, King of Arendelle."
    },
    {
      "character": "ANNA",
      "text": "Whoa, Papa, that was epic. Whoever saved you, I love them."
    },
    {
      "character": "AGNARR",
      "text": "I wish I knew who it was."
    },
    {
      "character": "ELSA",
      "text": "What happened to the spirits? What's in the Forest now?"
    },
    {
      "character": "AGNARR",
      "text": "I don't know. The mist still stands. No one can get in, and no one has since come out."
    },
    {
      "character": "IDUNA",
      "text": "So we're safe."
    },
    {
      "character": "AGNARR",
      "text": "Yes, but the forest could wake again, and we must be prepared for whatever danger it may bring."
    },
    {
      "character": "IDUNA",
      "text": "And on that note, how about we say goodnight to your father?"
    },
    {
      "character": "ANNA",
      "text": "Oh, but I still have so many questions!"
    },
    {
      "character": "AGNARR",
      "text": "Save them for another night, Anna."
    },
    {
      "character": "ANNA",
      "text": "Ugh, you know I don't have that kind of patience. Why did the Northuldra attack us anyway? Who attacks people who gave them gifts?"
    },
    {
      "character": "ELSA",
      "text": "Do you think the forest will wake again?"
    },
    {
      "character": "IDUNA",
      "text": "Only Ahtohallan knows."
    },
    {
      "character": "ANNA",
      "text": "\"Ahtoha--\" what?"
    },
    {
      "character": "IDUNA",
      "text": "When I was little... my mother would sing a song about special river, called Ahtohallan... that was said to hold all the answers about the past, about what we are apart of."
    },
    {
      "character": "ANNA",
      "text": "Wow."
    },
    {
      "character": "ELSA",
      "text": "Will you sing it for us? Please?"
    },
    {
      "character": "IDUNA",
      "text": "Okay, cuddle close. Scootch in."
    },
    {
      "character": "IDUNA",
      "text": "Where the northwind meets the sea There is a river full of memory Sleep, my darling, safe and sound For in this river all is found In her waters, deep and true Lie the answers and path for you Dive down deep into her sound But not too far or you'll be drowned Yes, she will sing to those who hear And in her song, all magic flows But can you be brave what you most fear? Can you face what the river knows? Where the northwind meets the sea There's a mother full of memory Come my darling, homeward bound When all is lost, then all is found"
    },
    {
      "character": "KAI",
      "text": "Your Majesty?"
    },
    {
      "character": "ELSA",
      "text": "Oh!"
    },
    {
      "character": "KAI",
      "text": "They're ready."
    },
    {
      "character": "ELSA",
      "text": "Excuse me, I'm coming. (hears a voice) Do you hear that?"
    },
    {
      "character": "KAI",
      "text": "Uh, what?"
    },
    {
      "character": "ELSA",
      "text": "Nevermind."
    },
    {
      "character": "ANNA",
      "text": "Enjoying your new Permafrost, Olaf?"
    },
    {
      "character": "OLAF",
      "text": "I'm just living the dream, Anna. Oh, how I wish this could last forever."
    },
    {
      "character": "ANNA",
      "text": "Mmmmm..."
    },
    {
      "character": "OLAF",
      "text": "And yet change mocks us with her beauty..."
    },
    {
      "character": "ANNA",
      "text": "What's that?"
    },
    {
      "character": "OLAF",
      "text": "Forgive me, maturity is making me poetic. Tell me, you're older and thus all-knowing. Do you ever worry about the notion that, nothing is permanent?"
    },
    {
      "character": "ANNA",
      "text": "Uh... no."
    },
    {
      "character": "OLAF",
      "text": "Really? Wow, I can't wait 'till I'm aged like you, so I don't have to worry about important things."
    },
    {
      "character": "ANNA",
      "text": "That's not what I mean. I don't worry because... well, I have you, and Elsa, and Kristoff, and Sven and the gates are open wide and... And I'm not alone anymore."
    },
    {
      "character": "ANNA",
      "text": "Yes, the wind blows a little bit colder And we're all getting older And the clouds are moving on with every Autumn breeze Peter Pumpkin just became fertilizer"
    },
    {
      "character": "OLAF",
      "text": "And my leaf's a little sadder and wiser"
    },
    {
      "character": "ANNA",
      "text": "That's why I rely on certain certainties Yes, some things never change Like the feel of your hand in mine Some things stay the same"
    },
    {
      "character": "ANNA & OLAF",
      "text": "Like how we get along just fine"
    },
    {
      "character": "ANNA",
      "text": "Like an old stone wall that'll never fall Some things are always true Some things never change Like how I am holding on tight to you"
    },
    {
      "character": "KRISTOFF",
      "text": "The leaves are already falling Sven, it feels like the future is calling Are you telling me tonight you're gonna get down on one knee? Yeah, but I'm really bad at planning these things out Like candlelight and pulling of rings out Maybe you should leave all the romantic stuff to me"
    },
    {
      "character": "KRISTOFF",
      "text": "Yeah, some things never change Like the love I feel for her Some things stay the same Like how reindeers are easier. But if I commit and go for it. I'll know what to say and do. Right? Some things never change... Sven, the pressure is on you."
    },
    {
      "character": "ELSA",
      "text": "The winds are restless Could that be why I'm hearing this call? Is something coming? I'm not sure I want things to change at all. These days are precious, Can't let them slip away. I can't freeze this moment, But I still can go out and seize this day!"
    },
    {
      "character": "TOWNSPEOPLE",
      "text": "Ah ah ah ah ah ah The wind blows a little bit colder"
    },
    {
      "character": "OLAF",
      "text": "And you all look a little bit older"
    },
    {
      "character": "ANNA",
      "text": "It's time to count our blessings"
    },
    {
      "character": "ANNA & KRISTOFF",
      "text": "Beneath an autumn sky"
    },
    {
      "character": "TOWNSPEOPLE",
      "text": "We'll always live in a kingdom of plenty That stands for the good and the many"
    },
    {
      "character": "ELSA",
      "text": "And I promise you the flag of Arendelle will always fly"
    },
    {
      "character": "ANNA",
      "text": "Our flag will always fly!"
    },
    {
      "character": "TOWNSPEOPLE",
      "text": "Our flag will always fly! (Our flag will always fly!)"
    },
    {
      "character": "ALL",
      "text": "Some things never change Turn around and time has flown Some things stay the same Though the future remains unknown May our good luck last, may our past be past Time's moving fast, it's true"
    },
    {
      "character": "ANNA, ELSA, & KRISTOFF",
      "text": "Some things never change"
    },
    {
      "character": "ANNA",
      "text": "And I'm holding on tight to you"
    },
    {
      "character": "ELSA",
      "text": "Holding on tight to you"
    },
    {
      "character": "OLAF",
      "text": "Holding on tight to you"
    },
    {
      "character": "KRISTOFF",
      "text": "I'm holding on tight to you..."
    },
    {
      "character": "ANNA",
      "text": "I'm holding on tight to you."
    },
    {
      "character": "KRISTOFF",
      "text": "Um... okay... Um... lion!"
    },
    {
      "character": "OLAF",
      "text": "Grizzly bear!"
    },
    {
      "character": "KRISTOFF",
      "text": "Uh, monster!"
    },
    {
      "character": "OLAF",
      "text": "Mama bear!"
    },
    {
      "character": "KRISTOFF",
      "text": "Angry face?"
    },
    {
      "character": "OLAF",
      "text": "Papa bear!"
    },
    {
      "character": "KRISTOFF",
      "text": "Uh..."
    },
    {
      "character": "OLAF",
      "text": "Hans!"
    },
    {
      "character": "ELSA",
      "text": "Unredeemable monster!"
    },
    {
      "character": "KRISTOFF",
      "text": "Biggest mistake of your life!"
    },
    {
      "character": "OLAF",
      "text": "We didn't even kiss you! (bell rings)"
    },
    {
      "character": "ANNA",
      "text": "Villain!"
    },
    {
      "character": "ELSA, OLAF, & KRISTOFF",
      "text": "Oh..."
    },
    {
      "character": "OLAF",
      "text": "We all correctly got it."
    },
    {
      "character": "KRISTOFF",
      "text": "Okay, Olaf, you're up."
    },
    {
      "character": "OLAF",
      "text": "Okay. (So much easier now that I can read) Lightning round, boys against girls. Okay, I'm ready, I'm ready."
    },
    {
      "character": "KRISTOFF",
      "text": "Go! Unicorn. Ice cream. Castle. Oaken! Teapot! Mouse! Ooh, Elsa!"
    },
    {
      "character": "ANNA",
      "text": "I don't think Olaf should get to rearrange. Doesn't matter, this is gonna be a cinch. Two sisters, with one mind."
    },
    {
      "character": "ELSA",
      "text": "Thank you."
    },
    {
      "character": "ANNA",
      "text": "Okay, here we go. You got this Elsa, anytime. Just do it with your body. Nothing. Air. Tree. People. \"Treeple\"! Oh that's not a word... Shovel boy. Teeth? Oh, doing the dishes."
    },
    {
      "character": "OLAF",
      "text": "Polar Bear!"
    },
    {
      "character": "ANNA",
      "text": "Hey!"
    },
    {
      "character": "OLAF",
      "text": "Sorry."
    },
    {
      "character": "ANNA",
      "text": "You gotta give me something. Uhm, Alarmed? Distracted? Worried? Panicking? Disturbed, oh, come on. You definitely looked disturbed!"
    },
    {
      "character": "KRISTOFF",
      "text": "We won."
    },
    {
      "character": "ANNA",
      "text": "Rematch?"
    },
    {
      "character": "ELSA",
      "text": "Oh, you know what, I think I'll turn in."
    },
    {
      "character": "ANNA",
      "text": "Are you OK?"
    },
    {
      "character": "ELSA",
      "text": "Just.. just tired. Good night."
    },
    {
      "character": "OLAF",
      "text": "Yeah, I'm tired too, and Sven promised to read me a bedtime story, didn't you, Sven?"
    },
    {
      "character": "KRISTOFF",
      "text": "Did I?"
    },
    {
      "character": "OLAF",
      "text": "Oh you do the best voices like when you pretend to be Kristoff and you're like \"I'll just go talk to some rocks about my childhood and stuff...\""
    },
    {
      "character": "KRISTOFF",
      "text": "Um, how about you guys start without me?"
    },
    {
      "character": "ANNA",
      "text": "Did Elsa seem weird to you?"
    },
    {
      "character": "KRISTOFF",
      "text": "She ... seemed like Elsa."
    },
    {
      "character": "ANNA",
      "text": "That last word, when it really seemed to throw her, what was it?"
    },
    {
      "character": "KRISTOFF",
      "text": "I don't know, but..."
    },
    {
      "character": "ANNA",
      "text": "Ah. Ice? Oh, come on, she couldn't act out ice? I better go check on her. Thanks, honey, love you."
    },
    {
      "character": "KRISTOFF",
      "text": "I love you, too. It's fine."
    },
    {
      "character": "ELSA",
      "text": "Come in."
    },
    {
      "character": "ANNA",
      "text": "Yup, something's wrong."
    },
    {
      "character": "ELSA",
      "text": "With you?"
    },
    {
      "character": "ANNA",
      "text": "No, with you. You're wearing mother's scarf, you do that when something's wrong. Oh, did we hurt your feelings? I'm sorry, if we did. You know, there are few people that are actually good at family games, that's just a fact."
    },
    {
      "character": "ELSA",
      "text": "No, that's not it."
    },
    {
      "character": "ANNA",
      "text": "Then what is it?"
    },
    {
      "character": "ELSA",
      "text": "There's this... I just don't want to mess things up."
    },
    {
      "character": "ANNA",
      "text": "What things? You're doing great! Oh, Elsa, when are you going to see yourself the way I see you?"
    },
    {
      "character": "ELSA",
      "text": "What would I do without you?"
    },
    {
      "character": "ANNA",
      "text": "You'll always have me. (They smile for a while) I know what you need. Come on, come here."
    },
    {
      "character": "ELSA",
      "text": "What?"
    },
    {
      "character": "ANNA",
      "text": "It's Mama's words, cuddle close. Scootch in."
    },
    {
      "character": "ELSA",
      "text": "Mhmm."
    },
    {
      "character": "ANNA",
      "text": "Where the northwind meets the sea, there's a river..."
    },
    {
      "character": "ANNA & ELSA",
      "text": "Full of memory..."
    },
    {
      "character": "ELSA",
      "text": "I know what you're doing... (Anna chuckles)"
    },
    {
      "character": "ANNA & ELSA",
      "text": "Sleep, my darling, safe and sound, For in this river all is found..."
    },
    {
      "character": "ELSA",
      "text": "I can hear you, but I won't. Some look for trouble, while others don't. There's a thousand reasons I should go about my day And ignore your whispers which i wish would go away (Ohh) You're not a voice, you're just a ringing in my ear And if I heard you, which I don't, I'm spoken for I fear Everyone I've ever loved is here within these walls I'm sorry, secret siren, but I blocking out your calls I've had my adventure, I don't need something new I'm afraid of what I'm risking if I follow you... Into the unknown! Into the unknown!! Into the unknown!!!~ What do you want? 'Cause you've been keeping me awake Are you here to distract me so I make a big mistake? Or are you someone out there who's a little bit like me? Who knows deep down I'm not where I meant to be? Every day's a little harder as I feel my power grow Don't you know there's part of me that longs to go ... Into the unknown! Into the unknown!! Into the unknown!!!~ Are you out there? Do you know me? Can you feel me? Can you show me? Where are you going? Don't leave me alone! How do I follow you? Into the unknown!!!"
    },
    {
      "character": "ELSA",
      "text": "Air, fire, water, earth. (Thunder rumbling, shattering, flashing)"
    },
    {
      "character": "ANNA",
      "text": "The water!"
    },
    {
      "character": "ELSA",
      "text": "They're outrageous! No fire, no water, the earth is next. We have to get out! It'll be okay, evacuate to the cliffs!"
    },
    {
      "character": "OLAF",
      "text": "Oh, no, I'm gonna blow!"
    },
    {
      "character": "KRISTOFF",
      "text": "- I got you!"
    },
    {
      "character": "KRISTOFF",
      "text": "Yes, everyone's out and safe. Here, take one of these. You okay there, Olaf?"
    },
    {
      "character": "OLAF",
      "text": "Oh yeah. We're calling this, \"controlling what you can when things feel out of control\"."
    },
    {
      "character": "ANNA",
      "text": "Okay, I don't understand. You've been hearing a voice and you didn't think to tell me?"
    },
    {
      "character": "ELSA",
      "text": "I didn't wanna worry you."
    },
    {
      "character": "ANNA",
      "text": "We made a promise not to shut each other out! Just tell me what's going on!"
    },
    {
      "character": "ELSA",
      "text": "I woke the magical spirits of the Enchanted Forest."
    },
    {
      "character": "ANNA",
      "text": "Okay, that's definitely not what what I thought you were gonna say. Wait, the Enchanted Forest? The one father warned us about?"
    },
    {
      "character": "ELSA",
      "text": "Yes."
    },
    {
      "character": "ANNA",
      "text": "Why would you do that?"
    },
    {
      "character": "ELSA",
      "text": "Because of the voice. I know it sounds crazy, but I believe whoever is calling me is good."
    },
    {
      "character": "ANNA",
      "text": "How can you say that? Look at our kingdom!"
    },
    {
      "character": "ELSA",
      "text": "I know, it's just that my magic can feel it. I can feel it."
    },
    {
      "character": "ANNA",
      "text": "Okay. (feeling rumbling) Oh no, what now?"
    },
    {
      "character": "KRISTOFF",
      "text": "The Trolls?"
    },
    {
      "character": "BULDA",
      "text": "Kristoff, we missed you!"
    },
    {
      "character": "ANNA",
      "text": "Pabbie!"
    },
    {
      "character": "GRAND PABBIE",
      "text": "Well, never a dull moment with you two. I hope you're prepared for what you have done, Elsa. Angry magical spirits are not for the faint of heart."
    },
    {
      "character": "ANNA",
      "text": "Why are they still angry? What does this all of this have to do with Arendelle?"
    },
    {
      "character": "GRAND PABBIE",
      "text": "Let me see what I can see. The past is not what it seems. A wrong demands to be righted. Arendelle is not safe. The truth must be found. Without it... I see no future."
    },
    {
      "character": "ANNA",
      "text": "No future?"
    },
    {
      "character": "GRAND PABBIE",
      "text": "When one can see no future, all one can do is the next right thing."
    },
    {
      "character": "ELSA",
      "text": "The next right thing, is for me to go to the Enchanted Forest and find that voice. Kristoff, can I borrow your wagon, and Sven?"
    },
    {
      "character": "KRISTOFF",
      "text": "- I'm not very comfortable with the idea of that."
    },
    {
      "character": "ANNA",
      "text": "- You are not going alone."
    },
    {
      "character": "ELSA",
      "text": "Anna, no. I have my powers to protect me, you don't."
    },
    {
      "character": "ANNA",
      "text": "Excuse me, I climbed to the North Mountain, survived a frozen heart, and saved you from my ex-boyfriend, and I did it all without powers, so, you know, I'm coming."
    },
    {
      "character": "KRISTOFF",
      "text": "Me too, I'll drive."
    },
    {
      "character": "OLAF",
      "text": ":- I'll bring the snacks!"
    },
    {
      "character": "GRAND PABBIE",
      "text": "I will look after your people."
    },
    {
      "character": "ANNA",
      "text": "Please make sure they stay out of the kingdom until we return."
    },
    {
      "character": "GRAND PABBIE",
      "text": "Of course."
    },
    {
      "character": "ELSA",
      "text": "Let's let them know."
    },
    {
      "character": "GRAND PABBIE",
      "text": "Anna, I'm worried"
    },
    {
      "character": "ELSA",
      "text": "Anna, no. I have my powers to protect me, you don't."
    },
    {
      "character": "ANNA",
      "text": "Excuse me, I climbed to the North Mountain, survived a frozen heart, and saved you from my ex-boyfriend, and I did it all without powers, so, you know, I'm coming."
    },
    {
      "character": "KRISTOFF",
      "text": "Me too, I'll drive."
    },
    {
      "character": "OLAF",
      "text": "I'll bring the snacks!"
    },
    {
      "character": "GRAND PABBIE",
      "text": "I will look after your people."
    },
    {
      "character": "ANNA",
      "text": "Please make sure they stay out of the kingdom until we return."
    },
    {
      "character": "GRAND PABBIE",
      "text": "Of course."
    },
    {
      "character": "ELSA",
      "text": "Let's let them know."
    },
    {
      "character": "GRAND PABBIE",
      "text": "Anna, I'm worried for her. We have always feared Elsa's powers were too much for this world, now, we must pray they are enough."
    },
    {
      "character": "ANNA",
      "text": "I won't let anything happen to her."
    },
    {
      "character": "OLAF",
      "text": "Who wants a trivia? I am, okay!"
    },
    {
      "character": "KRISTOFF",
      "text": "Did you know that sleeping quietly on long journeys prevents insanity?"
    },
    {
      "character": "OLAF",
      "text": "Yeah, that's not true."
    },
    {
      "character": "KRISTOFF",
      "text": "- It is."
    },
    {
      "character": "ELSA",
      "text": "- It is definitely true."
    },
    {
      "character": "ANNA",
      "text": "- It's the truth."
    },
    {
      "character": "OLAF",
      "text": "Hmm, well, that was unanimous. But I will look it up when we get home."
    },
    {
      "character": "ANNA",
      "text": "They're both asleep. So ... what do you wanna do?"
    },
    {
      "character": "KRISTOFF",
      "text": "Sven, keep us steady, will you? Anna? Ahem! Anna, remember our first trip like this when I said you have to be crazy to want marry a man you just met?"
    },
    {
      "character": "ANNA",
      "text": "- Wait, what? Crazy? You didn't say I was crazy, you think I'm crazy?"
    },
    {
      "character": "KRISTOFF",
      "text": "No, I did, you were. Not crazy, clearly. Just naive, not naive, just ah.. just, new to love. Like I was, and, when you're new, you are bound to get it ... wrong."
    },
    {
      "character": "ANNA",
      "text": "So you're saying, I'm wrong for you?"
    },
    {
      "character": "KRISTOFF",
      "text": "What? No, no, I'm not saying you're wrong, or crazy, I'm saying--"
    },
    {
      "character": "ANNA",
      "text": "- Good idea."
    },
    {
      "character": "ELSA",
      "text": "- Kristoff, stop, please. I hear it. I hear the voice."
    },
    {
      "character": "ANNA",
      "text": "- You do? Olaf, wake up."
    },
    {
      "character": "KRISTOFF",
      "text": "- Whoa."
    },
    {
      "character": "ANNA",
      "text": "- Wow."
    },
    {
      "character": "ANNA",
      "text": "Promise me, we do this together, okay?"
    },
    {
      "character": "ELSA",
      "text": "I promise."
    },
    {
      "character": "KRISTOFF",
      "text": "It's okay."
    },
    {
      "character": "OLAF",
      "text": "Did you know that the Enchanted Forest is a place of transformation? I have no idea what that means, but I can't wait to see what it's gonna do to each one of us."
    },
    {
      "character": "ANNA",
      "text": "I Am Not Fast."
    },
    {
      "character": "ANNA",
      "text": "We're locked in. I did not see that one coming."
    },
    {
      "character": "ELSA",
      "text": "This forest is beautiful!"
    },
    {
      "character": "ANNA",
      "text": "The Dam ... It still stands. It was in Grand Pabbie's visions, but why?"
    },
    {
      "character": "KRISTOFF",
      "text": "I don't know, but it's still in good shape, thank goodness."
    },
    {
      "character": "ANNA",
      "text": "What do you mean?"
    },
    {
      "character": "KRISTOFF",
      "text": "Well, if that Dam broke, it would send a tidal wave so big, it would wash away everything on this fjord."
    },
    {
      "character": "ANNA",
      "text": "Everything? But... Arendelle is on this fjord."
    },
    {
      "character": "KRISTOFF",
      "text": "Nothing's gonna to happen to Arendelle, Anna, it's gonna be fine. Come here. You know, under different circumstances, this would be a... very romantic place. Don't you think?"
    },
    {
      "character": "ANNA",
      "text": "Different circumstances? You mean like with someone else?"
    },
    {
      "character": "KRISTOFF",
      "text": "What? No, no, I'm saying, just in case we don't make it out of here..."
    },
    {
      "character": "ANNA",
      "text": "You don't think we're gonna make out of here?"
    },
    {
      "character": "KRISTOFF",
      "text": "No, no, I mean, no, we will make it out of here. Well, technically the odds are kinda complicated, but my point is...."
    },
    {
      "character": "KRISTOFF",
      "text": "- In case we die-- No! No! No, we will die at some point-- Not even any reason time will we die, but... Way far in the future we will die...."
    },
    {
      "character": "ANNA",
      "text": "- You think we're gonna die?! I swear that I will not leave her side!"
    },
    {
      "character": "KRISTOFF",
      "text": "Don't patronize me."
    },
    {
      "character": "ANNA",
      "text": "Elsa, there you are! You okay?"
    },
    {
      "character": "ELSA",
      "text": "I'm fine."
    },
    {
      "character": "ANNA",
      "text": "Okay, good. Where's Olaf?"
    },
    {
      "character": "OLAF",
      "text": "Umm, Anna? Elsa? Sven? Samantha? I don't even know who's Samantha! That's normal..."
    },
    {
      "character": "OLAF",
      "text": "What was that?"
    },
    {
      "character": "OLAF",
      "text": "Samantha? This will all make sense when I am older. Someday I will see that this makes sense. One day, when I'm old and wise, I'll think back and realize, That these were all completely normal events. Ah! I'll have all the answers when I'm older, Like why we're in these dark enchanted woods. I know in a couple of years, these will seem like childish fears. And so I know this isn't bad, it's good. Excuse me. Growing up means adapting, Puzzling out your world and your place. When I'm more mature, I'll feel comfortably secure, Being watched by something with a creepy, creepy face... See, that will all make sense when I'm older, So there's no need to be terrified or tense. I'll just dream about a time, When I'm in my age of prime. 'Cause when you're older, Absolutely, everything makes sense! This is fine."
    },
    {
      "character": "OLAF",
      "text": "Whoa"
    },
    {
      "character": "ANNA",
      "text": "Olaf!"
    },
    {
      "character": "OLAF",
      "text": "Hey guys, meet the wind spirit!"
    },
    {
      "character": "KRISTOFF",
      "text": "Coming through!"
    },
    {
      "character": "ANNA",
      "text": "Oh, I think I'm gonna be sick!"
    },
    {
      "character": "OLAF",
      "text": "I'll hold your hands, but I can't find my arms!"
    },
    {
      "character": "ELSA",
      "text": "Hey! Stop."
    },
    {
      "character": "ANNA",
      "text": "Elsa! Let her go!"
    },
    {
      "character": "KRISTOFF",
      "text": "Anna, be careful!"
    },
    {
      "character": "ANNA",
      "text": "- That's my sister!"
    },
    {
      "character": "ANNA",
      "text": "Are you ok?"
    },
    {
      "character": "ELSA",
      "text": "I'm fine."
    },
    {
      "character": "KRISTOFF",
      "text": "What are these?"
    },
    {
      "character": "ANNA",
      "text": "They look like moments in time. What's that thing you said, Olaf?"
    },
    {
      "character": "OLAF",
      "text": "Oh, my theory about advanced technology is both our savior and our doom?"
    },
    {
      "character": "ANNA",
      "text": "No, not that one, the one about..."
    },
    {
      "character": "OLAF",
      "text": "The one about cucumbers?"
    },
    {
      "character": "ANNA",
      "text": "No. The thing about water."
    },
    {
      "character": "OLAF",
      "text": "Oh, yeah. Water has memory. The water that makes up you and me has passed through at least 4 humans and or animals before us. And remembers everything. The wind's back! I think I'll name you Gale."
    },
    {
      "character": "KRISTOFF",
      "text": "Whoa! Get outta there."
    },
    {
      "character": "ANNA",
      "text": "Oh, hi, are you curious."
    },
    {
      "character": "ELSA",
      "text": "You're in the better mood now?"
    },
    {
      "character": "ANNA",
      "text": "Father. It's father! But this girl..."
    },
    {
      "character": "OLAF",
      "text": "Who is she?"
    },
    {
      "character": "KRISTOFF",
      "text": "She's Northuldra."
    },
    {
      "character": "ANNA",
      "text": "What was that?"
    },
    {
      "character": "ELSA",
      "text": "Olaf, get behind me."
    },
    {
      "character": "KRISTOFF",
      "text": "- What are you gonna do with that?"
    },
    {
      "character": "ANNA",
      "text": "- I have no idea."
    },
    {
      "character": "HONEYMAREN",
      "text": "Lower your weapons."
    },
    {
      "character": "MATTIAS",
      "text": "- And you lower yours!"
    },
    {
      "character": "ANNA",
      "text": "- Arandellian Soldiers?"
    },
    {
      "character": "YELANA",
      "text": "- Threatening my people, Lieutenant?"
    },
    {
      "character": "MATTIAS",
      "text": "- Invading my Dam space, Yelena?"
    },
    {
      "character": "ANNA",
      "text": "Why does that soldier looks so familiar?"
    },
    {
      "character": "ARENDELLIAN SOLDIER",
      "text": "Lieutenant!"
    },
    {
      "character": "MATTIAS",
      "text": "Get the sword!"
    },
    {
      "character": "MATTIAS",
      "text": "That was magic. Did you see that?"
    },
    {
      "character": "YELANA",
      "text": "Of course I saw it."
    },
    {
      "character": "ANNA",
      "text": "You chose an ice cold greeting..."
    },
    {
      "character": "KRISTOFF",
      "text": "- They've been trapped in here this whole time?"
    },
    {
      "character": "ELSA",
      "text": "- What do we do now?"
    },
    {
      "character": "OLAF",
      "text": "I got this. Hi! I'm Olaf. Oh, sorry, yeah, I just find clothes restricting. Bet you're wondering who we are and why we are here. It's really quite simple. It began with two sisters. One born with magical powers, and one born powerless. Their love of snowmen, infinite. \"Anna, No! Too high!\" Blast! \"Ow, Mama, Papa, help!\" Slam! Doors shutting everywhere, sisters torn apart! Well, at least they have their parents. Their parents are dead. \"Oh, I am Anna, I wanna marry a man I just met!\" Elsa's gonna blow, snow, snow, ah run! Magic pulses through my snowflakes. I live! \"Ice palace for one, ice palace for one!\" \"Get out Anna!\" \"My heart!\""
    },
    {
      "character": "MATTIAS",
      "text": "Oh, my goodness!"
    },
    {
      "character": "OLAF",
      "text": "\"Only an act of true love can save you.\" \"Here's a true love's kiss...\" \"You're not worth it, guess what? I'm the bad guy!\""
    },
    {
      "character": "MATTIAS",
      "text": "What?!"
    },
    {
      "character": "OLAF",
      "text": "And Anna freezes to death, forever."
    },
    {
      "character": "MATTIAS",
      "text": "Oh, Anna!"
    },
    {
      "character": "OLAF",
      "text": "Then she unfreezes it. Oh, and then Elsa woke up the magical spirits, and we were forced out from our kingdom. Now our only hope is to find the truth about the past, but we don't have a clue how to do that. Except Elsa's hearing voices, so we got that going for us. Any questions?"
    },
    {
      "character": "OLAF",
      "text": "I think they got it."
    },
    {
      "character": "MATTIAS",
      "text": "Are you really queen of Arendelle?"
    },
    {
      "character": "ELSA",
      "text": "I am."
    },
    {
      "character": "YELANA",
      "text": "Why would nature reward a person of Arendelle with magic?"
    },
    {
      "character": "MATTIAS",
      "text": "Perhaps to make up for the actions of your people."
    },
    {
      "character": "YELANA",
      "text": "My people are innocent, we will have never attacked first."
    },
    {
      "character": "MATTIAS",
      "text": "May the truth be found. Hi, I'm sor-, uh, what's happening?"
    },
    {
      "character": "ANNA",
      "text": "That's it! Lieutenant Mattias! Library, second portrait on the left. You are our father's official guard."
    },
    {
      "character": "MATTIAS",
      "text": "Agnarr. What did happened to your parents?"
    },
    {
      "character": "ANNA",
      "text": "Our parents' ship went down in the southern sea 6 years ago."
    },
    {
      "character": "MATTIAS",
      "text": "I see him. I see him in your faces."
    },
    {
      "character": "ANNA",
      "text": "- Really?"
    },
    {
      "character": "MATTIAS",
      "text": "Soldiers! We maybe getting old in years, but we're still strong. Proud to serve Arendelle."
    },
    {
      "character": "ELSA",
      "text": "Wait, please. Someone has called me here. If I can just find it, I believe they have the answer that may help us free this forest. Trust me, I just want to help."
    },
    {
      "character": "YELANA",
      "text": "We only trust nature. When nature speaks, we listen."
    },
    {
      "character": "OLAF",
      "text": "This will all makes sense when I'm older..."
    },
    {
      "character": "MAN",
      "text": "Fire spirit!"
    },
    {
      "character": "MAN #2",
      "text": "Get back everyone!"
    },
    {
      "character": "MAN #3",
      "text": "Run for the river!"
    },
    {
      "character": "RYDER",
      "text": "No, no, no, the reindeer! That's a dead end!"
    },
    {
      "character": "KRISTOFF",
      "text": "Come on Sven, we'll get them!"
    },
    {
      "character": "ANNA",
      "text": "Elsa, get out of there! No, no, no...."
    },
    {
      "character": "KRISTOFF",
      "text": "Come on buddy, we can do this, hiyah!"
    },
    {
      "character": "KRISTOFF",
      "text": "Anna!"
    },
    {
      "character": "ELSA",
      "text": "Get her out of here!"
    },
    {
      "character": "ANNA",
      "text": "No! Elsa!"
    },
    {
      "character": "ELSA",
      "text": "They're all looking at us, aren't they? Got any advice? Nothing?"
    },
    {
      "character": "ELSA",
      "text": "Hmm. Should I know what that means?"
    },
    {
      "character": "ELSA",
      "text": "You hear it, too? Somebody's calling us, who is it? What do we do?"
    },
    {
      "character": "ELSA",
      "text": "Okay, keep going north."
    },
    {
      "character": "ANNA",
      "text": "Elsa! Oh thank goodness."
    },
    {
      "character": "ELSA",
      "text": "Anna. Are you okay? What were you doing? You could have been killed, you can't just follow me into fire."
    },
    {
      "character": "ANNA",
      "text": "You don't want me to follow you into fire, then don't run into fire. You're not being careful, Elsa."
    },
    {
      "character": "ELSA",
      "text": "I'm sorry, are you okay?"
    },
    {
      "character": "ANNA",
      "text": "I've been better."
    },
    {
      "character": "ELSA",
      "text": "I know what you need."
    },
    {
      "character": "YELENA",
      "text": "Where did you get that scarf?"
    },
    {
      "character": "RYDER",
      "text": "That's a Northuldra's scarf."
    },
    {
      "character": "ANNA",
      "text": "What?"
    },
    {
      "character": "HONEYMAREN",
      "text": "This is from one of our oldest families."
    },
    {
      "character": "ANNA",
      "text": "It was our mother's..."
    },
    {
      "character": "ANNA",
      "text": "Elsa..."
    },
    {
      "character": "ELSA",
      "text": "I see it, it's mother."
    },
    {
      "character": "ANNA",
      "text": "Mother saved father's life that day."
    },
    {
      "character": "ELSA",
      "text": "Our mother was Northuldra."
    },
    {
      "character": "YELENA",
      "text": "We are called Northuldra, We are the people of the Sun."
    },
    {
      "character": "ELSA",
      "text": "I promise you, I will free this forest, and restore Arendelle."
    },
    {
      "character": "ANNA",
      "text": "That's a pretty big promise, Elsa."
    },
    {
      "character": "RYDER",
      "text": "Free the forest... Wow... I'm sorry, Its just... ah, Some of us were born in here, we've never even seen the clear sky."
    },
    {
      "character": "KRISTOFF",
      "text": "I get it."
    },
    {
      "character": "RYDER",
      "text": "My name is Ryder."
    },
    {
      "character": "KRISTOFF",
      "text": "Kristoff."
    },
    {
      "character": "ELSA",
      "text": "I heard the voice again. We need to go north."
    },
    {
      "character": "HONEYMAREN",
      "text": "But the Earth Giants now roam north at night."
    },
    {
      "character": "YELENA",
      "text": "You can leave in the morning."
    },
    {
      "character": "HONEYMAREN",
      "text": "I'm Honeymaren."
    },
    {
      "character": "ANNA",
      "text": "Honeymaren, we'll do all we can."
    },
    {
      "character": "OLAF",
      "text": "Hey, let me ask you: How do you guys cope with the ever increasing complexity of thought that comes with maturity?"
    },
    {
      "character": "OLAF",
      "text": "Brilliant! It's so refreshing to talk to the youth of today. Our future is in bright hands--"
    },
    {
      "character": "OLAF",
      "text": "Oh no, no, no. Don't chew that, you don't know what I've stepped there!"
    },
    {
      "character": "KRISTOFF",
      "text": "I can't seem to get her attention. Or even say the thing."
    },
    {
      "character": "RYDER",
      "text": "Well, you're in luck, I know nothing about women. But I do know that we have the most amazing way of proposing. If we start now, we'll be ready at dawn."
    },
    {
      "character": "KRISTOFF",
      "text": "Really?"
    },
    {
      "character": "RYDER",
      "text": "Best part: It involves a lot of reindeer."
    },
    {
      "character": "LT. MATTIAS",
      "text": "Hey, back at home, Halimah's still over on Hudson's Hearth?"
    },
    {
      "character": "ANNA",
      "text": "She is."
    },
    {
      "character": "LT. MATTIAS",
      "text": "Really? Is she married?"
    },
    {
      "character": "ANNA",
      "text": "Mm-mm."
    },
    {
      "character": "LT. MATTIAS",
      "text": "Oh, wow, why would that make me feel better?"
    },
    {
      "character": "ANNA",
      "text": "What else do you miss?"
    },
    {
      "character": "LT. MATTIAS",
      "text": "My father. He passed long before all this. He was a great man, Built us a good life is Arendelle, But taught me to never take the good for granted. He'd say, \"Be prepared! Just when you think you found your way, life will throw you on a new path\"."
    },
    {
      "character": "ANNA",
      "text": "What do you do when it does?"
    },
    {
      "character": "LT. MATTIAS",
      "text": "Don't give up. Take it one step at a time and..."
    },
    {
      "character": "ANNA",
      "text": "Just do the next right thing."
    },
    {
      "character": "LT. MATTIAS",
      "text": "Yeah, you got it."
    },
    {
      "character": "HOMEOMAREN",
      "text": "I wanna show you something. May I? You know, air, fire, water, a"
    },
    {
      "character": "ANNA",
      "text": "What do you do when it does?"
    },
    {
      "character": "LT. MATTIAS",
      "text": "Don't give up. Take it one step at a time and..."
    },
    {
      "character": "ANNA",
      "text": "Just do the next right thing."
    },
    {
      "character": "LT. MATTIAS",
      "text": "Yeah, you got it."
    },
    {
      "character": "HOMEYMAREN",
      "text": "I wanna show you something. ( points to Iduna's scarf ) May I? You know, air, fire, water, and earth."
    },
    {
      "character": "ELSA",
      "text": "Yes."
    },
    {
      "character": "HONEYMAREN",
      "text": "But look, there is a fifth spirit. It's said to be a bridge between us and the magic of nature."
    },
    {
      "character": "ELSA",
      "text": "A fifth spirit?"
    },
    {
      "character": "HONEYMAREN",
      "text": "(nods) Some say, they hear it call out the day before the spell."
    },
    {
      "character": "ELSA",
      "text": "My father heard it, Do you think that's who's calling me?"
    },
    {
      "character": "HONEYMAREN",
      "text": "Maybe. Alas, only Ahtohallan knows."
    },
    {
      "character": "ELSA",
      "text": "Ahtohallan..."
    },
    {
      "character": "ELSA",
      "text": "\"Dive deep into her sound\""
    },
    {
      "character": "HONEYMAREN & ELSA",
      "text": "\"But not too far or you'll be drowned\""
    },
    {
      "character": "HONEYMAREN",
      "text": "Why do lullabies always have to have some terrible warning in them?"
    },
    {
      "character": "ELSA",
      "text": "I wonder that all the time."
    },
    {
      "character": "HONEYMAREN",
      "text": "Earth giants."
    },
    {
      "character": "YELENA",
      "text": "What are they doing down here?"
    },
    {
      "character": "HONEYMAREN",
      "text": "Hide."
    },
    {
      "character": "OLAF",
      "text": "This is why we don't play with fire. Ah, I can't stay mad at you, you're so cute!"
    },
    {
      "character": "ANNA",
      "text": "Please tell me, you are not about to follow them?"
    },
    {
      "character": "ELSA",
      "text": "What if I can settle them like I did with the wind with the wind and fire?"
    },
    {
      "character": "ANNA",
      "text": "Or what if they can crush you before you even get the chance? Remember, the goal is to find the voice, find the truth, and get us home."
    },
    {
      "character": "OLAF",
      "text": "Hey, guys, that was close!"
    },
    {
      "character": "ELSA",
      "text": "I know. The Giant sensed me. They may come back here, I don't want to put everyone at risk again. And you're right, Anna, we've got to find the voice. We're going now."
    },
    {
      "character": "ANNA",
      "text": "Okay, were going. Let me just... Wait, where are Kristoff and Sven?"
    },
    {
      "character": "OLAF",
      "text": "Oh yeah, I think they took off with that Ryder guy and a bunch of reindeer."
    },
    {
      "character": "ANNA",
      "text": "They left? Just left without saying anything?"
    },
    {
      "character": "OLAF",
      "text": "Who knows the ways of men."
    },
    {
      "character": "KRISTOFF",
      "text": "Am I supposed to feel this is ridiculous?"
    },
    {
      "character": "RYDER",
      "text": "Oh yeah, definitely."
    },
    {
      "character": "KRISTOFF",
      "text": "Everyone ready?"
    },
    {
      "character": "RYDER",
      "text": "Ready. Ah, I could use a rehearsal. Hey, love, love."
    },
    {
      "character": "KRISTOFF",
      "text": "Wait, you talk for them, too?"
    },
    {
      "character": "RYDER",
      "text": "I do."
    },
    {
      "character": "KRISTOFF",
      "text": "It's like you can actually hear what they're thinking?"
    },
    {
      "character": "RYDER",
      "text": "Yeah, and you.. you just say it!"
    },
    {
      "character": "KRISTOFF",
      "text": "And then you just say it."
    },
    {
      "character": "RYDER",
      "text": "Okay, here she comes."
    },
    {
      "character": "KRISTOFF",
      "text": "Princess Anna of Arendelle. My feisty, fearless, ginger sweet love. Will you marry me?"
    },
    {
      "character": "YELANA",
      "text": "Um, no. The princess left with the queen."
    },
    {
      "character": "KRISTOFF",
      "text": "What queen? What? What?! What?!"
    },
    {
      "character": "YELANA",
      "text": "I wouldn't try to follow. They're long gone."
    },
    {
      "character": "KRISTOFF",
      "text": "Long gone?"
    },
    {
      "character": "YELANA",
      "text": "So, yeah. Um, we're heading west, to the Lycan Meadows. You can come with us if you want."
    },
    {
      "character": "RYDER",
      "text": "Hey, um, I'm sorry."
    },
    {
      "character": "KRISTOFF",
      "text": "No, it's fine."
    },
    {
      "character": "RYDER",
      "text": "Yeah, yup. Hm, okay. I'd better go pack. You coming with?"
    },
    {
      "character": "KRISTOFF",
      "text": "I'll just... ah, yeah I'll meet you there."
    },
    {
      "character": "RYDER",
      "text": "You know where you're going."
    },
    {
      "character": "KRISTOFF",
      "text": "Yeah, I know the woods."
    },
    {
      "character": "SVEN",
      "text": "You feel what you feel, and those feelings are real. Come on, Kristoff. Let down your guard."
    },
    {
      "character": "ANNA",
      "text": "Hey, Olaf, umm... Maybe just one of you should do it."
    },
    {
      "character": "OLAF",
      "text": "I agree, she's a little pitchy."
    },
    {
      "character": "OLAF",
      "text": "Hey, Gale's back!"
    },
    {
      "character": "ANNA",
      "text": "Anna, this is might sounds crazy, but I'm - sensing some rising anger - Ah, Oh, I am angry, Olaf!"
    },
    {
      "character": "OLAF",
      "text": "She promised me we do this together."
    },
    {
      "character": "ANNA",
      "text": "Yeah, but ... What I mean is I'm sensing rising anger in me - Wait, you're angry?"
    },
    {
      "character": "OLAF",
      "text": "I think so Elsa pushed me away too and Didn't even say goodbye - And you have every right to to be very, very mad at her And you've said some things never changed, but since then Everything done's nothing but change."
    },
    {
      "character": "ANNA",
      "text": "I know But look I'm still here holding your hand Yeah, I think that's a good point Anna I feel better, you're such a good listener Shh, shh, shh! Look! Oh the Giants, they're huge Hang on Olaf Try not to scream Found it Thank you. Where are we? In a pit, with no way out But with this spooky pitch black way in Come on, it'll be fun Assuming we don't get stuck here forever and no one ever find us You started it and I gave up But bright side Elsa gotta be all out better than we are"
    },
    {
      "character": "ELSA",
      "text": "Of course..! Glaciers are rivers of ice! Ahtohallan is frozen... ( vocalizing ) I hear you, and I'm coming..."
    },
    {
      "character": "ELSA",
      "text": "Every inch of me is trembling But not from the cold Something is familiar Like a dream I reach but not quite hold I can sense you there Like a friend I've always known I'm arriving And it feels like I am home I have always been a fortress Cold secrets deep inside You have secrets, too But you don't have to hide Show yourself I'm dying to meet you Show yourself It's your turn Are you the one I've been looking for All of my life? Show yourself I'm ready to learn Ah-ah, ah-ah"
    },
    {
      "character": "ELSA",
      "text": "I've never felt so certain All my life I've been torn But I'm here for a reason Could it be the reason I was born? I have always been so different Normal rules did not apply Is this the day? Are you the way I finally find out why? Show yourself I'm no longer trembling Here I am I've come so far You are the answer I've waited for All of my life Oh, show yourself Let me see who you are Come to me now Open your door Don't make me wait One moment more Oh, come to me now Open your door Don't make me wait One moment more"
    },
    {
      "character": "IDUNA",
      "text": "Where the north wind meets the sea"
    },
    {
      "character": "IDUNA",
      "text": "There's a river"
    },
    {
      "character": "IDUNA",
      "text": "Full of memory (Memory, memory) Come, my darling, homeward bound"
    },
    {
      "character": "ELSA",
      "text": "I am found"
    },
    {
      "character": "ELSA AND IDUNA",
      "text": "Show yourself Step into the power Grow yourself Into something new"
    },
    {
      "character": "IDUNA",
      "text": "You are the one you've been waiting for"
    },
    {
      "character": "ELSA",
      "text": "All of my life (All of your life) Oh, show yourself"
    },
    {
      "character": "ELSA",
      "text": "I just wasn't looking where I was going, but I'm great Actually ... Prince Hans of the Southern Isle I love you. I need to tell you about my past - And where I'm from?"
    },
    {
      "character": "IDUNA",
      "text": "I'm listening, Iduna!"
    },
    {
      "character": "IDUNA",
      "text": "What are you reading, your Majesty?"
    },
    {
      "character": "IDUNA",
      "text": "Just some outdated author King Runeard, I'm sorry, I don't understand We're bringing Arendelle's full guard But they have given us no reason not to trust them The Northuldra follow magic Which means we can never trust them."
    },
    {
      "character": "ELSA",
      "text": "Grandfather?"
    },
    {
      "character": "KING RUNEARD",
      "text": "Magic makes people feel too powerful. Too entitled, it makes them think they can defy the will of a king."
    },
    {
      "character": "ELSA",
      "text": "That is not what magic does. That's just your fear. Fear is what can't be trusted."
    },
    {
      "character": "KING RUNEARD",
      "text": "You see, the Dam will weaken their lands, so they will have to turn to me."
    },
    {
      "character": "IDUNA",
      "text": "...and a path for you, dive down deep into her sound..."
    },
    {
      "character": "IDUNA",
      "text": "...but not too far or you'll be drowned."
    },
    {
      "character": "KING RUNEARD",
      "text": "They will come in celebrations, and then, we will know their size and strength."
    },
    {
      "character": "KING RUNEARD",
      "text": "As you have welcomed us, we welcome you. Our neighbors, our friends."
    },
    {
      "character": "NORTHULDRA LEADER",
      "text": "King Runeard, the Dam isn't strengthening our waters, it's hurting the forest! It's cutting off the North--!"
    },
    {
      "character": "KING RUNEARD",
      "text": "Let... Let's not discuss this here. Let's, meet on the fjord. Have tea, Find a solution."
    },
    {
      "character": "ELSA",
      "text": "No!"
    },
    {
      "character": "ELSA",
      "text": "Anna!"
    },
    {
      "character": "ELSA",
      "text": "Anna!"
    },
    {
      "character": "ELSA",
      "text": "You said you believed in me that this is what I was born to do."
    },
    {
      "character": "ANNA",
      "text": "And I don't want to stop you from that. I-I don't want to stop you from being whatever you need to be. I just don't want you dying, trying to be everything for everyone else too. Don't do this alone. Let me help you, please. I can't lose you, Elsa."
    },
    {
      "character": "ELSA",
      "text": "I can't lose you either, Anna."
    },
    {
      "character": "ELSA",
      "text": "Come on."
    },
    {
      "character": "ANNA",
      "text": "Wait, what? What are you doing? Elsa!"
    },
    {
      "character": "ANNA",
      "text": "No, no ... Olaf, help me stop Give me a hand! Hang on! Oh no Come on!"
    },
    {
      "character": "ANNA",
      "text": "Which blacky tunnel do we choose?~"
    },
    {
      "character": "KING RUNEARD",
      "text": "You see, the Dam will weaken their lands"
    },
    {
      "character": "KING RUNEARD",
      "text": "So they will have to turn to me"
    },
    {
      "character": "NORTHULDRA LEADER",
      "text": "King Runeard, the Dam is hurting the forest!"
    },
    {
      "character": "ANNA",
      "text": "Elsa's found it"
    },
    {
      "character": "ANNA",
      "text": "That's my grandfather Attacking the Northuldra leader Who wields no weapon The Dam wasn't a gift of peace It was a trick But that goes against everything Arendelle stands for."
    },
    {
      "character": "ANNA",
      "text": "It does, doesn't it?"
    },
    {
      "character": "ANNA",
      "text": "I know how to free the forest, I know what we have to do, To set things right"
    },
    {
      "character": "OLAF",
      "text": "Why do you say that so sadly?"
    },
    {
      "character": "ANNA",
      "text": "We have to break the Dam But Arendelle will be flooded That's why everyone was forced out To protect them from what has to be done"
    },
    {
      "character": "OLAF",
      "text": "Oh"
    },
    {
      "character": "ANNA",
      "text": "Are you okay?"
    },
    {
      "character": "ANNA",
      "text": "I could really use a bright side, Olaf"
    },
    {
      "character": "OLAF",
      "text": "The bright side, um Turtles can breathe through their butts? And I see a way out"
    },
    {
      "character": "ANNA",
      "text": "I knew I can count on you Come on, Olaf Elsa's probably on her way back right now, we can meet her and-"
    },
    {
      "character": "ANNA",
      "text": "Olaf? What's this?"
    },
    {
      "character": "OLAF",
      "text": "Are you okay?"
    },
    {
      "character": "OLAF",
      "text": "I'm flurring?"
    },
    {
      "character": "OLAF",
      "text": "Wait, no, that's not it I'm flurring, away..."
    },
    {
      "character": "OLAF",
      "text": "The magic in me is fading"
    },
    {
      "character": "ANNA",
      "text": "What?"
    },
    {
      "character": "OLAF",
      "text": "I don't think Elsa is okay I think..."
    },
    {
      "character": "OLAF",
      "text": "She may have gone too far"
    },
    {
      "character": "ANNA",
      "text": "No, no."
    },
    {
      "character": "OLAF",
      "text": "Anna I'm sorry You're gonna have to do this next part on your own Okay?"
    },
    {
      "character": "ANNA",
      "text": "Wait, come here I've got you That's goo"
    },
    {
      "character": "OLAF",
      "text": "The bright side, um Turtles can breathe through their butts?"
    },
    {
      "character": "ANNA",
      "text": "And I see a way out I knew I can count on you Come on, Olaf Elsa's probably on her way back right now, we can meet her and-"
    },
    {
      "character": "ANNA",
      "text": "Olaf?"
    },
    {
      "character": "ANNA",
      "text": "What's this? - Are you okay?"
    },
    {
      "character": "OLAF",
      "text": "I'm flurring?"
    },
    {
      "character": "OLAF",
      "text": "Wait, no, that's not it I'm flurring, away... The magic in me is fading"
    },
    {
      "character": "ANNA",
      "text": "What?"
    },
    {
      "character": "OLAF",
      "text": "I don't think Elsa is okay I think... She may have gone too far"
    },
    {
      "character": "ANNA",
      "text": "No, no."
    },
    {
      "character": "OLAF",
      "text": "Anna I'm sorry You're gonna have to do this next part on your own Okay?"
    },
    {
      "character": "ANNA",
      "text": "Wait, come here I've got you That's good"
    },
    {
      "character": "OLAF",
      "text": "Hey Anna I just thought of one thing that's permanent."
    },
    {
      "character": "ANNA",
      "text": "What's that?"
    },
    {
      "character": "OLAF",
      "text": "Love"
    },
    {
      "character": "OLAF",
      "text": "Warm hugs? I like warm hugs I love you"
    },
    {
      "character": "ANNA",
      "text": "Olaf, Elsa What do I do now?"
    },
    {
      "character": "ANNA",
      "text": "I've seen dark before But not like this This is cold This is empty This is numb The life I knew is over The lights are out Hello, darkness I'm ready to succumb I follow you around I always have But you've gone to a place I cannot find This grief has a gravity It pulls me down But a tiny voice whispers in my mind \"You are lost, hope is gone But you must go on And do the next right thing\" Can there be a day beyond this night? I don't know anymore what is true I can't find my direction, I'm all alone The only star that guided me was you How to rise from the floor When it's not you I'm rising for? Just do the next right thing Take a step, step again It is all that I can to do The next right thing I won't look too far ahead It's too much for me to take But break it down to this next breath This next step This next choice is one that I can make So I'll walk through this night Stumbling blindly toward the light And do the next right thing And with the dawn, what comes then When it's clear that everything will never be the same again? Then I'll make the choice To hear that voice And do the next right thing"
    },
    {
      "character": "ANNA",
      "text": "Wake up!"
    },
    {
      "character": "ANNA",
      "text": "Wake up!!!"
    },
    {
      "character": "ANNA",
      "text": "That's it!"
    },
    {
      "character": "ANNA",
      "text": "Come and catch me! Come on!"
    },
    {
      "character": "ANNA",
      "text": "Okay, that's it!"
    },
    {
      "character": "ANNA",
      "text": "Keep coming!"
    },
    {
      "character": "ANNA",
      "text": "That worked"
    },
    {
      "character": "MATTIAS",
      "text": "What? No, no, no, no. She's leading them to the dam!"
    },
    {
      "character": "ANNA",
      "text": "Kristoff!"
    },
    {
      "character": "KRISTOFF",
      "text": "I'm here. What do you need?"
    },
    {
      "character": "ANNA",
      "text": "To get to the dam!"
    },
    {
      "character": "KRISTOFF",
      "text": "You got it!"
    },
    {
      "character": "ANNA",
      "text": "Thank you!"
    },
    {
      "character": "ANNA",
      "text": "Help me up!"
    },
    {
      "character": "KRISTOFF",
      "text": "We'll meet you around!"
    },
    {
      "character": "ANNA",
      "text": "Lieutenant Mathias!"
    },
    {
      "character": "MATTIAS",
      "text": "Your Highness, What are you doing?"
    },
    {
      "character": "ANNA",
      "text": "The dam must fall. It's the only way to break the mist and free the forest"
    },
    {
      "character": "MATTIAS",
      "text": "But we've sworn to protect Arendelle at all costs!"
    },
    {
      "character": "ANNA",
      "text": "Arendelle has no future until we make this right! King Runeard betrayed everyone!"
    },
    {
      "character": "MATTIAS",
      "text": "How do you know that?"
    },
    {
      "character": "ANNA",
      "text": "My sister gave her life, for the truth. Please, before we lose anyone else."
    },
    {
      "character": "ANNA",
      "text": "Destroy the Dam, come on!"
    },
    {
      "character": "ANNA",
      "text": "Throw your boulders!"
    },
    {
      "character": "ANNA",
      "text": "That's it"
    },
    {
      "character": "MATTIAS",
      "text": "I got her!"
    },
    {
      "character": "KRISTOFF",
      "text": "Hang on!"
    },
    {
      "character": "ANNA",
      "text": "I'm sorry I left you behind. I was just so desperate to protect her."
    },
    {
      "character": "KRISTOFF",
      "text": "I know, I know, it's okay. My love is not fragile."
    },
    {
      "character": "RYDER",
      "text": "Look at the sky. I just didn't realize there so much of it."
    },
    {
      "character": "MATTIAS",
      "text": "34 years..."
    },
    {
      "character": "YELENA",
      "text": "5 months..."
    },
    {
      "character": "MATTIAS",
      "text": "And 23 days."
    },
    {
      "character": "ANNA",
      "text": "Is it really you?"
    },
    {
      "character": "ELSA",
      "text": "Anna!"
    },
    {
      "character": "ANNA",
      "text": "I thought I lost you."
    },
    {
      "character": "ELSA",
      "text": "Lost me? You saved me, again."
    },
    {
      "character": "ANNA",
      "text": "I did?"
    },
    {
      "character": "ELSA",
      "text": "And, Anna, Arendelle did not fall."
    },
    {
      "character": "ANNA",
      "text": "It didn't?"
    },
    {
      "character": "ELSA",
      "text": "The spirits all agree, Arendelle deserves to stand with you."
    },
    {
      "character": "ANNA",
      "text": "Me?"
    },
    {
      "character": "ELSA",
      "text": "You did what was right, for everyone."
    },
    {
      "character": "ANNA",
      "text": "Did you find the fifth spirit?"
    },
    {
      "character": "ANNA",
      "text": "You are the fifth spirit. You're the bridge."
    },
    {
      "character": "ELSA",
      "text": "Well, actually, a bridge has two sides. And a mother had two daughters. We did this together. And we'll continue to do this together."
    },
    {
      "character": "ANNA",
      "text": "Together."
    },
    {
      "character": "KRISTOFF",
      "text": "Elsa! You're okay!"
    },
    {
      "character": "KRISTOFF",
      "text": "You look different. Did you cut your hair or something?"
    },
    {
      "character": "ELSA",
      "text": "Or something."
    },
    {
      "character": "KRISTOFF",
      "text": "Oh."
    },
    {
      "character": "ELSA",
      "text": "Anna, I need to ask you a question."
    },
    {
      "character": "ANNA",
      "text": "Okay."
    },
    {
      "character": "ELSA",
      "text": "Do you wanna build a snowman?"
    },
    {
      "character": "ANNA",
      "text": "What?"
    },
    {
      "character": "ELSA",
      "text": "Thank goodness, water has memory!"
    },
    {
      "character": "OLAF",
      "text": "Anna, Elsa, Kristoff, and Sven! You all came back! I love a happy ending! I mean, I presume we're done? Or is this putting us in more dangerous situation gonna be, a regular thing?"
    },
    {
      "character": "ELSA",
      "text": "No, we're done."
    },
    {
      "character": "KRISTOFF",
      "text": "Actually... There is one more thing, Anna.."
    },
    {
      "character": "KRISTOFF",
      "text": "You are the most extraordinary person I've ever known"
    },
    {
      "character": "KRISTOFF",
      "text": "I love you with all I am"
    },
    {
      "character": "KRISTOFF",
      "text": "Will you marry me?"
    },
    {
      "character": "ANNA",
      "text": "Yes!"
    },
    {
      "character": "ANNA",
      "text": "Arendelle's okay"
    },
    {
      "character": "MATTIAS",
      "text": "What?"
    },
    {
      "character": "ELSA",
      "text": "Ahtohallan is beautiful"
    },
    {
      "character": "ELSA",
      "text": "Hello."
    },
    {
      "character": "HONEYMAREN",
      "text": "You know You belong up here"
    },
    {
      "character": "ELSA",
      "text": "I took an oath to always do what's best for Arendelle Luckily,"
    },
    {
      "character": "ELSA",
      "text": "I Love You to Sisters."
    },
    {
      "character": "OLAF",
      "text": "Show yourself!! RIGHT NOW!"
    },
    {
      "character": "OLAF",
      "text": "Elsa, be who you are."
    },
    {
      "character": "OLAF",
      "text": "Oh I will Mama, I will!"
    },
    {
      "character": "OLAF",
      "text": "Elsa's DEAD. Olaf's DEAD. Anna cries... And then a bunch of important things happen that I forgot but all that matters is I was right and water has memory and thus... I LIVE. And so do you."
    },
    {
      "character": "MARSHMALLOW",
      "text": "Whoa! We live!"
    },
    {
      "character": "MARSHMALLOW",
      "text": "WE LIIIIIIVE!!!!"
    },
    {
      "character": "MARSHMALLOW",
      "text": "Good story, ahh."
    }
  ],
  "lineCount": 570,
  "characterCount": 35,
  "topCastCount": 14,
  "topCast": [
    "ANNA",
    "ELSA",
    "OLAF",
    "KRISTOFF",
    "MATTIAS",
    "AGNARR",
    "IDUNA",
    "RYDER",
    "HONEYMAREN",
    "GRAND PABBIE",
    "YELANA",
    "LT. MATTIAS",
    "KING RUNEARD",
    "YELENA"
  ],
  "imdbId": "tt4520988",
  "poster": "https://m.media-amazon.com/images/M/MV5BZTE1YjlmZjctNjIwNi00NDQ0LTlmMzgtYWZkY2RkZTMwNTdmXkEyXkFqcGc@._V1_SX300.jpg",
  "rated": "PG",
  "runtime": "103 min",
  "genre": "Animation, Adventure, Comedy",
  "director": "Chris Buck, Jennifer Lee"
}
