{
  "id": "shrek-1",
  "title": "Shrek",
  "year": 2001,
  "characters": [
    "3 LITTLE PIGS",
    "DONKEY",
    "GIPETTO",
    "GUARD",
    "GUARDS",
    "HEAD GUARD",
    "LITTLE BEAR",
    "MAN1",
    "MAN2",
    "MAN3",
    "MEN",
    "OLD WOMAN",
    "PETER PAN",
    "PINOCCHIO",
    "SHREK"
  ],
  "lines": [
    {
      "character": "SHREK",
      "text": "Once upon a time there was a lovely princess. But she had an enchantment upon her of a fearful sort which could only be broken by love's first kiss. She was locked away in a castle guarded by a terrible fire-breathing dragon. Many brave knights had attempted to free her from this dreadful prison, but non prevailed. She waited in the dragon's keep in the highest room of the tallest tower for her true love and true love's first kiss. (laughs) Like that's ever gonna happen. What a load of - (toilet flush) Allstar - by Smashmouth begins to play. Shrek goes about his day. While in a nearby town, the villagers get together to go after the ogre. NIGHT - NEAR SHREK'S HOME"
    },
    {
      "character": "MAN1",
      "text": "Think it's in there?"
    },
    {
      "character": "MAN2",
      "text": "All right. Let's get it!"
    },
    {
      "character": "MAN1",
      "text": "Whoa. Hold on. Do you know what that thing can do to you?"
    },
    {
      "character": "MAN3",
      "text": "Yeah, it'll grind your bones for it's bread. Shrek sneaks up behind them and laughs."
    },
    {
      "character": "SHREK",
      "text": "Yes, well, actually, that would be a giant. Now, ogres, oh they're much worse. They'll make a suit from your freshly peeled skin."
    },
    {
      "character": "MEN",
      "text": "No!"
    },
    {
      "character": "SHREK",
      "text": "They'll shave your liver. Squeeze the jelly from your eyes! Actually, it's quite good on toast."
    },
    {
      "character": "MAN1",
      "text": "Back! Back, beast! Back! I warn ya! Shrek calmly licks his fingers and extinguishes the torch. The men shrink back away from him. Shrek roars very loudly and long and his breath extinguishes all the remaining torches until the men are in the dark."
    },
    {
      "character": "SHREK",
      "text": "This is the part where you run away. And stay out! (looks down and picks up a piece of paper. Reads.) \"Wanted. Fairy tale creatures.\"(He sighs and throws the paper over his shoulder.) THE NEXT DAY There is a line of fairy tale creatures. The head of the guard sits at a table paying people for bringing the fairy tale creatur to him. There are cages all around. Some of the people in line are Peter Pan, who is carrying Tinkerbell in a cage, Gipetto who's carrying Pinocchio, and a farmer who is carrying the three little pigs."
    },
    {
      "character": "GUARD",
      "text": "All right. This one's full. Take it away! Move it along. Come on! Get up!"
    },
    {
      "character": "HEAD GUARD",
      "text": "Next!"
    },
    {
      "character": "GUARD",
      "text": "(taking the witch's broom) Give me that! Your flying days are over. (breaks the broom in half)"
    },
    {
      "character": "HEAD GUARD",
      "text": "That's 20 pieces of silver for the witch. Next!"
    },
    {
      "character": "GUARD",
      "text": "Get up! Come on!"
    },
    {
      "character": "HEAD GUARD",
      "text": "Twenty pieces."
    },
    {
      "character": "LITTLE BEAR",
      "text": "(crying) This cage is too small."
    },
    {
      "character": "DONKEY",
      "text": "Please, don't turn me in. I'll never be stubborn again. I can change. Please! Give me another chance!"
    },
    {
      "character": "OLD WOMAN",
      "text": "Oh, shut up. (jerks his rope)"
    },
    {
      "character": "DONKEY",
      "text": "Oh!"
    },
    {
      "character": "HEAD GUARD",
      "text": "Next! What have you got?"
    },
    {
      "character": "GIPETTO",
      "text": "This little wooden puppet."
    },
    {
      "character": "PINOCCHIO",
      "text": "I'm not a puppet. I'm a real boy. (his nose grows)"
    },
    {
      "character": "HEAD GUARD",
      "text": "Five shillings for the possessed toy. Take it away."
    },
    {
      "character": "PINOCCHIO",
      "text": "Father, please! Don't let them do this! Help me! Gipetto takes the money and walks off. The old woman steps up to the table."
    },
    {
      "character": "HEAD GUARD",
      "text": "Next! What have you got?"
    },
    {
      "character": "OLD WOMAN",
      "text": "Well, I've got a talking donkey."
    },
    {
      "character": "HEAD GUARD",
      "text": "Right. Well, that's good for ten shillings, if you can prove it."
    },
    {
      "character": "OLD WOMAN",
      "text": "Oh, go ahead, little fella. Donkey just looks up at her."
    },
    {
      "character": "HEAD GUARD",
      "text": "Well?"
    },
    {
      "character": "OLD WOMAN",
      "text": "Oh, oh, he's just...he's just a little nervous. He's really quite a chatterbox. Talk, you boneheaded dolt..."
    },
    {
      "character": "HEAD GUARD",
      "text": "That's it. I've heard enough. Guards!"
    },
    {
      "character": "OLD WOMAN",
      "text": "No, no, he talks! He does. (pretends to be Donkey) I can talk. I love to talk. I'm the talkingest damn thing you ever saw."
    },
    {
      "character": "HEAD GUARD",
      "text": "Get her out of my sight."
    },
    {
      "character": "OLD WOMAN",
      "text": "No, no! I swear! Oh! He can talk! The guards grab the old woman and she struggles with them. One of her legs flies out and kicks Tinkerbell out of Peter Pan's hands, and her cage drops on Donkey's head. He gets sprinkled with fairy dust and he's able to fly."
    },
    {
      "character": "DONKEY",
      "text": "Hey! I can fly!"
    },
    {
      "character": "PETER PAN",
      "text": "He can fly!"
    },
    {
      "character": "3 LITTLE PIGS",
      "text": "He can fly!"
    },
    {
      "character": "HEAD GUARD",
      "text": "He can talk!"
    },
    {
      "character": "DONKEY",
      "text": "Ha, ha! That's right, fool! Now I'm a flying, talking donkey. You might have seen a housefly, maybe even a superfly but I bet you ain't never seen a donkey fly. Ha, ha! (the pixie dust begins to wear off) Uh-oh. (he begins to sink to the ground.) He hits the ground with a thud."
    },
    {
      "character": "HEAD GUARD",
      "text": "Seize him! (Donkey takes of running.) After him!"
    },
    {
      "character": "GUARDS",
      "text": "He's getting away! Get him! This way! Turn! Donkey keeps running and he eventually runs into Shrek. Literally Shrek turns around to see who bumped into him. Donkey looks scare for a moment then he spots the guards coming up the path. He quickly hides behind Shrek."
    },
    {
      "character": "HEAD GUARD",
      "text": "You there. Ogre!"
    },
    {
      "character": "SHREK",
      "text": "Aye?"
    },
    {
      "character": "HEAD GUARD",
      "text": "By the order of Lord Farquaad I am authorized to place you both under arrest and transport you to a designated resettlement facility."
    },
    {
      "character": "SHREK",
      "text": "Oh, really? You and what army? He looks behind the guard and the guard turns to look as well and we see that the other men have run off. The guard tucks tail and runs off. Shrek laughs and goes back about his business and begins walking back to his cottage."
    },
    {
      "character": "DONKEY",
      "text": "Can I say something to you? Listen, you was really, really, really somethin' back here. Incredible!"
    },
    {
      "character": "SHREK",
      "text": "Are you talkin' to...(he turns around and Donkey is gone) me? (he turns back around and Donkey is right in front of him.) Whoa!"
    },
    {
      "character": "DONKEY",
      "text": "Yes. I was talkin' to you. Can I tell you that you that you was great back here? Those guards! They thought they was all of that. Then you showed up, and bam! They was trippin' over themselves like babes in the woods. That really made me feel good to see that."
    },
    {
      "character": "SHREK",
      "text": "Oh, that's great. Really."
    },
    {
      "character": "DONKEY",
      "text": "Man, it's good to be free."
    },
    {
      "character": "SHREK",
      "text": "Now, why don't you go celebrate your freedom with your own friends? Hmm?"
    },
    {
      "character": "DONKEY",
      "text": "But, uh, I don't have any friends. And I'm not goin' out there by myself. Hey, wait a minute! I got a great idea! I'll stick with you. You're mean, green, fightin' machine. Together we'll scare the spit out of anybody that crosses us. Shrek turns and regards Donkey for a moment before roaring very loudly."
    },
    {
      "character": "DONKEY",
      "text": "Oh, wow! That was really scary. If you don't mind me sayin', if that don't work, your breath certainly will get the job done, 'cause you definitely need some Tic Tacs or something, 'cause you breath stinks! You almost burned the hair outta my nose, just like the time...(Shrek covers his mouth but Donkey continues to talk, so Shrek removes his hand.) ...then I ate some rotten berries. I had strong gases leaking out of my butt that day."
    },
    {
      "character": "SHREK",
      "text": "Why are you following me?"
    },
    {
      "character": "DONKEY",
      "text": "I'll tell you why. (singing) 'Cause I'm all alone, There's no one here beside me, My problems have all gone, There's no one to deride me, But you gotta have faith..."
    },
    {
      "character": "SHREK",
      "text": "Stop singing! It's no wonder you don't have any friends."
    },
    {
      "character": "DONKEY",
      "text": "Wow. Only a true friend would be that cruelly honest."
    },
    {
      "character": "SHREK",
      "text": "Listen, little donkey. Take a look at me. What am I?"
    },
    {
      "character": "DONKEY",
      "text": "(looks all the way up at Shrek) Uh ...really tall?"
    },
    {
      "character": "SHREK",
      "text": "No! I'm an ogre! You know. \"Grab your torch and pitchforks.\" Doesn't that bother you?"
    },
    {
      "character": "DONKEY",
      "text": "Nope."
    },
    {
      "character": "SHREK",
      "text": "Really?"
    },
    {
      "character": "DONKEY",
      "text": "Really, really."
    },
    {
      "character": "SHREK",
      "text": "Oh."
    },
    {
      "character": "DONKEY",
      "text": "Man, I like you. What's you name?"
    },
    {
      "character": "SHREK",
      "text": "Uh, Shrek."
    },
    {
      "character": "DONKEY",
      "text": "Shrek? Well, you know what I like about you, Shrek? You got that kind of I-don't-care-what-nobo thing. I like that. I respect that, Shrek. You all right. (They come over a hill and you can see Shrek's cottage.) Whoa! Look at that. Who'd want to live in place like that?"
    },
    {
      "character": "SHREK",
      "text": "That would be my home."
    },
    {
      "character": "DONKEY",
      "text": "Oh! And it is lovely! Just beautiful. You know you are quite a decorator. It's amazing what you've done with such a modest budget. I like that boulder. That is a nice boulder. I guess you don't entertain much, do you?"
    },
    {
      "character": "SHREK",
      "text": "I like my privacy."
    },
    {
      "character": "DONKEY",
      "text": "You know, I do too. That's another thing we have in common. Like I hate it when you got somebody in your face. You've trying to give them a hint, and they won't leave. There's that awkward silence. (awkward silence) Can I stay with you?"
    },
    {
      "character": "SHREK",
      "text": "Uh, what?"
    },
    {
      "character": "DONKEY",
      "text": "Can I stay with you, please?"
    },
    {
      "character": "SHREK",
      "text": "(sarcastically) Of course!"
    },
    {
      "character": "DONKEY",
      "text": "Really?"
    },
    {
      "character": "SHREK",
      "text": "No."
    },
    {
      "character": "DONKEY",
      "text": "Please! I don't wanna go back there! You don't know what it's like to be considered a freak. (pause while he looks at Shrek) Well, maybe you do. But that's why we gotta stick together. You gotta let me stay! Please! Please!"
    },
    {
      "character": "SHREK",
      "text": "Okay! Okay! But one night only."
    },
    {
      "character": "DONKEY",
      "text": "Ah! Thank you! (he runs inside the cottage)"
    },
    {
      "character": "SHREK",
      "text": "What are you...? (Donkey hops up onto a chair.) No! No!"
    },
    {
      "character": "DONKEY",
      "text": "This is gonna be fun! We can stay up late, swappin' manly stories, and in the mornin' I'm makin' waffles."
    },
    {
      "character": "SHREK",
      "text": "Oh!"
    },
    {
      "character": "DONKEY",
      "text": "Where do, uh, I sleep?"
    },
    {
      "character": "SHREK",
      "text": "(irritated) Outside!"
    },
    {
      "character": "DONKEY",
      "text": "Oh, well, I guess that's cool. I mean, I don't know you, and you don't know me, so I guess outside is best, you know. Here I go. Good night. (Shrek slams the door.) (sigh) I mean, I do like the outdoors. I'm a donkey. I was born outside. I'll just be sitting by myself outside, I guess, you know. By myself, outside. I'm all alone...there's no one here beside me..."
    }
  ]
}