{
  "id": "tangled",
  "title": "Tangled",
  "year": 2010,
  "characters": [
    "ATTILA",
    "CAP",
    "CAPTAIN OF THE GUARD",
    "EUGENE",
    "FLYNN",
    "GOTHEL",
    "GRENO",
    "GUARD",
    "GUARDS",
    "HOOK HAND",
    "MOTHER GOTHEL",
    "RAPUNZEL",
    "SHORTY",
    "SIDEBURNS",
    "THUG",
    "VLADIMIR"
  ],
  "lines": [
    {
      "character": "FLYNN",
      "text": "This is the story of how I died. Don't worry, this is actually a very fun story. And the truth is, it isn't even mine. This is the story of a girl, named Rapunzel. And it starts, with the sun."
    },
    {
      "character": "FLYNN",
      "text": "Now, once upon a time, a single drop of sunlight fell from the heavens. And from this small drop of sun, grew a magic, golden, flower. It had the ability to heal the sick, and injured. Oh, you see that old woman, over there? You might want to remember her. She's kind of important. Well, centuries passed and a hop skip and a boat ride away there grew a kingdom. The kingdom was ruled by a beloved King and Queen. And the Queen, well she was about to have a baby, and she got sick, really, sick. She was running out of time. And that's when people usually start to look for a miracle. Or in this case, a magic golden flower."
    },
    {
      "character": "FLYNN",
      "text": "Ahhh, I told you she'd be important. You see instead of sharing the Sun's gift, this woman, Mother Gothel, hoarded its healing power and used it to keep herself young for hundreds of years. And all she had to do was sing a special song."
    },
    {
      "character": "MOTHER GOTHEL",
      "text": "♪Flower gleam and glow, let your power shine. Make the clock reverse, bring back what once was mine, what once was mine.♪"
    },
    {
      "character": "FLYNN",
      "text": "All right, you get the gist. She sings, she turns young. Creepy, right?"
    },
    {
      "character": "GUARDS",
      "text": "We found it!"
    },
    {
      "character": "FLYNN",
      "text": "The magic of the golden flower, healed the queen. A healthy baby girl, a princess was born. With beautiful golden hair. I'll give you a hint. That's Rapunzel. To celebrate her birth, the King and Queen launched a flying lantern into the sky. For that one moment, everything was perfect. And then that moment ended."
    },
    {
      "character": "MOTHER GOTHEL",
      "text": "♪Flower, gleam and glow, let your powers shine, make the clock re----♪"
    },
    {
      "character": "FLYNN",
      "text": "Gothel broke into the castle and stole the child. Just like that... gone. The Kingdom searched and searched, but they could not find the Princess. For deep within the forest, in a hidden tower, Gothel raised the child as her own."
    },
    {
      "character": "RAPUNZEL",
      "text": "♪...save what was lost, bring back what once was mine, what once was mine.♪"
    },
    {
      "character": "FLYNN",
      "text": "Gothel had found her new magic flower. But this time she was determined to keep it hidden."
    },
    {
      "character": "RAPUNZEL",
      "text": "Why can't I go outside?"
    },
    {
      "character": "MOTHER GOTHEL",
      "text": "The outside world is a dangerous place. Filled with horrible, selfish people. You must stay here, where you're safe. Do you understand, flower?"
    },
    {
      "character": "RAPUNZEL",
      "text": "Yes, Mommy."
    },
    {
      "character": "FLYNN",
      "text": "But the walls of that tower could not hide everything. Each year on her birthday, the King and Queen released thousands of lanterns into the sky in hope that one day, their lost Princess would return."
    },
    {
      "character": "RAPUNZEL",
      "text": "HAH! Hmm, Well... I guess Pascal's not hiding out here."
    },
    {
      "character": "RAPUNZEL",
      "text": "GOTCHA!!!"
    },
    {
      "character": "RAPUNZEL",
      "text": "That's twenty two for me. How about twenty three, out of forty five?"
    },
    {
      "character": "RAPUNZEL",
      "text": "Okay, well, what do you want to do?"
    },
    {
      "character": "RAPUNZEL",
      "text": "Yeah, I don't think so. I like it in here and so do you."
    },
    {
      "character": "RAPUNZEL",
      "text": "Oh, come on Pascal, it's not so bad in there."
    },
    {
      "character": "FLYNN",
      "text": "Wow! I could get used to a view like this."
    },
    {
      "character": "SIDEBURNS",
      "text": "Flynn, come on."
    },
    {
      "character": "FLYNN",
      "text": "Hold on. Yep, I'm used to it. Guys, I want a castle."
    },
    {
      "character": "SIDEBURNS",
      "text": "We do this job, you can buy your own castle."
    },
    {
      "character": "GUARD",
      "text": "Yeah."
    },
    {
      "character": "FLYNN",
      "text": "Oh, hay fever?"
    },
    {
      "character": "GUARD",
      "text": "Huh?"
    },
    {
      "character": "GUARD",
      "text": "Wait, what? Hey, wait!"
    },
    {
      "character": "FLYNN",
      "text": "Can't you picture me in a castle of my own? I mean, I certainly can. Oh, the things we've seen and it's only eight in the morning. Gentlemen, this is a very big day."
    },
    {
      "character": "RAPUNZEL",
      "text": "This is it. This is a very big day, Pascal."
    },
    {
      "character": "RAPUNZEL",
      "text": "I'm finally going to do it. I'm going to ask her."
    },
    {
      "character": "MOTHER GOTHEL",
      "text": "RAPUNZEL! Let down your hair!"
    },
    {
      "character": "RAPUNZEL",
      "text": "It's time. I know, I know. Come on, don't let her see you."
    },
    {
      "character": "MOTHER GOTHEL",
      "text": "Rapunzel, I'm not getting any younger down here."
    },
    {
      "character": "RAPUNZEL",
      "text": "Coming, mother."
    },
    {
      "character": "RAPUNZEL",
      "text": "Hi, welcome home, mother."
    },
    {
      "character": "MOTHER GOTHEL",
      "text": "Oh, Rapunzel. How you manage to do that every single day without fail, it looks absolutely exhausting, darling."
    },
    {
      "character": "RAPUNZEL",
      "text": "Oh, it's nothing."
    },
    {
      "character": "MOTHER GOTHEL",
      "text": "Then I don't know why it takes so long."
    },
    {
      "character": "MOTHER GOTHEL",
      "text": "Oh, darling. I'm just teasing."
    },
    {
      "character": "RAPUNZEL",
      "text": "All right...so, mother. As you know, tomorrow is a very big day."
    },
    {
      "character": "MOTHER GOTHEL",
      "text": "Rapunzel look at that mirror. You know what I see? I see a strong, confident, beautiful young lady. Oh look, you're here too! I'm just teasing, stop taking everything so seriously."
    },
    {
      "character": "RAPUNZEL",
      "text": "Okay, so mother. As I was saying, tomorrow is.."
    },
    {
      "character": "MOTHER GOTHEL",
      "text": "Flower, mother's feeling a little run down. Would you sing for me, dear? Then we'll talk."
    },
    {
      "character": "RAPUNZEL",
      "text": "OH! Of course, mother."
    },
    {
      "character": "RAPUNZEL",
      "text": "Rapunzel!"
    },
    {
      "character": "MOTHER GOTHEL",
      "text": "So, mother, earlier I was saying tomorrow’s a pretty big day, and you didn't really respond, So I'm just going to tell you. It's my birthday! TADA!"
    },
    {
      "character": "RAPUNZEL",
      "text": "No, no, no can't be. I distinctly remember. Your birthday was last year."
    },
    {
      "character": "MOTHER GOTHEL",
      "text": "That's the funny thing about birthdays. They're kind of an annual thing. Mother, I'm turning eighteen. And I wanted to ask, what I really want for this birthday. Actually, what I’ve wanted for...quite a few birthdays now..."
    },
    {
      "character": "RAPUNZEL",
      "text": "Rapunzel please, stop with the mumbling. You know how I feel about the mumbling. Blah, blah, blah,...blah. It's very annoying. I'm just teasing, you're adorable I love you so much, darling."
    },
    {
      "character": "MOTHER GOTHEL",
      "text": "Oh, I want to see the floating lights."
    },
    {
      "character": "RAPUNZEL",
      "text": "What?"
    },
    {
      "character": "MOTHER GOTHEL",
      "text": "Oh,... Well I was hoping you would take me to see the floating lights."
    },
    {
      "character": "RAPUNZEL",
      "text": "Oh, you mean the stars."
    },
    {
      "character": "MOTHER GOTHEL",
      "text": "That's the thing I've charted stars and they're always constant. But these, they appear every year on my birthday, Mother. Only on my birthday. And I can't help but feel that they're, They're meant for me. I need see them, Mother. And not just from my window. In person. I have to know what they are."
    },
    {
      "character": "RAPUNZEL",
      "text": "You want to go outside? Oh, why Rapunzel. Look at you, as fragile as a flower. Still a little sapling, just a sprout. You know why we stay up in this tower"
    },
    {
      "character": "MOTHER GOTHEL",
      "text": "I know, but..."
    },
    {
      "character": "RAPUNZEL",
      "text": "That's right, to keep you safe, and sound, dear. Guess I always knew this day was coming. Knew that soon you'd want to leave the nest. Soon, but not yet."
    },
    {
      "character": "MOTHER GOTHEL",
      "text": "But..."
    },
    {
      "character": "RAPUNZEL",
      "text": "Shhh.. Trust me pet, Mother, knows best. Mother knows best. Listen to your mother. It's a scary world out there. Mother knows best. One way or another. Something will go wrong, I swear. Ruffians, thugs, poison Ivy, quicksand. Cannibals, and snakes, the plague. Also large bugs, men with pointy teeth. And stop, no more, you'll just upset me. Mother's right here. Mother will protect you. Darling here's what I suggest. Skip the drama, stay with Mama. MAMA!! Knows best! Mother knows best. Take it from your mumsy. On your own, you won't survive. Sloppy underdressed, immature, clumsy, Please, they'll eat you up, alive. Gullible, nave, positively grubby. Ditzy and a bit, well, hmm vague. Plus I believe, getting kinda chubby. I'm just saying, 'Cause I wuv you. Mother understands, Mothers here to help you. All I have is one request."
    },
    {
      "character": "MOTHER GOTHEL",
      "text": "Rapunzel?"
    },
    {
      "character": "RAPUNZEL",
      "text": "Yes?"
    },
    {
      "character": "MOTHER GOTHEL",
      "text": "Don't ever ask to leave this tower, again."
    },
    {
      "character": "RAPUNZEL",
      "text": "Yes, Mother."
    },
    {
      "character": "MOTHER GOTHEL",
      "text": "Ahh, I love you very much, dear."
    },
    {
      "character": "RAPUNZEL",
      "text": "I love you more."
    },
    {
      "character": "MOTHER GOTHEL",
      "text": "I love you most. Don't forget it. You'll regret it. Mother Knows best."
    },
    {
      "character": "GOTHEL",
      "text": "I'll see you in a bit, my flower."
    },
    {
      "character": "RAPUNZEL",
      "text": "I'll be here."
    },
    {
      "character": "FLYNN",
      "text": "No, no no. This is bad, this is very, very bad, This is really bad. They just can't get my nose right."
    },
    {
      "character": "SIDEBURNS",
      "text": "Who cares."
    },
    {
      "character": "FLYNN",
      "text": "Well it's easy for you to say. You guys look amazing. All right, okay. Give me a boost, and I'll pull you up."
    },
    {
      "character": "SIDEBURNS",
      "text": "Give us the satchel first."
    },
    {
      "character": "FLYNN",
      "text": "Wha..? I just... I can't believe, that after all we've been together, you don't trust me. Ouch."
    },
    {
      "character": "SIDEBURNS",
      "text": "Now help us up, pretty boy."
    },
    {
      "character": "FLYNN",
      "text": "Sorry, my hands are full."
    },
    {
      "character": "SIDEBURNS",
      "text": "What? RIDER!"
    },
    {
      "character": "CAPTAIN OF THE GUARD",
      "text": "Retrieve that satchel with any force. We got him now, Maximus."
    },
    {
      "character": "FLYNN",
      "text": "Go! Heyah! Come, fleabag, forward. No. No, stop it."
    },
    {
      "character": "FLYNN",
      "text": "Alone at last."
    },
    {
      "character": "FLYNN",
      "text": "Huh?"
    },
    {
      "character": "RAPUNZEL",
      "text": "Okay, okay, I got a person in the closet. I got a person in the closet. I got a person in my closet! Too weak to handle myself out there, huh Mother? Well, Tell that to my frying pan!"
    },
    {
      "character": "MOTHER GOTHEL",
      "text": "Rapunzel! Let down your hair!"
    },
    {
      "character": "RAPUNZEL",
      "text": "One moment, Mother."
    },
    {
      "character": "MOTHER GOTHEL",
      "text": "I have a big surprise."
    },
    {
      "character": "RAPUNZEL",
      "text": "Uh, I do too."
    },
    {
      "character": "MOTHER GOTHEL",
      "text": "Oh, I bet my surprise is bigger."
    },
    {
      "character": "RAPUNZEL",
      "text": "I seriously doubt it!"
    },
    {
      "character": "MOTHER GOTHEL",
      "text": "I brought back parsnips. I‘m going to make hazelnut soup for dinner, your favorite. Surprise!"
    },
    {
      "character": "RAPUNZEL",
      "text": "Well mother, there's something I want to tell you."
    },
    {
      "character": "MOTHER GOTHEL",
      "text": "Oh Rapunzel, you know I hate leaving you after a fight. Especially when I've done absolutely nothing wrong."
    },
    {
      "character": "RAPUNZEL",
      "text": "Okay, I've been thinking a lot about what you said, earlier."
    },
    {
      "character": "MOTHER GOTHEL",
      "text": "I hope you're not still talking about the stars."
    },
    {
      "character": "RAPUNZEL",
      "text": "Floating lights, and, yes I'm leading up to that."
    },
    {
      "character": "MOTHER GOTHEL",
      "text": "Because I really thought we dropped the issue, sweetheart."
    },
    {
      "character": "RAPUNZEL",
      "text": "No Mother, I'm just saying, you think I'm not strong enough to handle myself out there."
    },
    {
      "character": "MOTHER GOTHEL",
      "text": "Oh darling, I know you're not strong enough to handle yourself out there."
    },
    {
      "character": "RAPUNZEL",
      "text": "But if you just..."
    },
    {
      "character": "MOTHER GOTHEL",
      "text": "Rapunzel, we're done talking about this."
    },
    {
      "character": "RAPUNZEL",
      "text": "But trust me, I..."
    },
    {
      "character": "MOTHER GOTHEL",
      "text": "Rapunzel."
    },
    {
      "character": "RAPUNZEL",
      "text": "...know what I'm"
    },
    {
      "character": "MOTHER GOTHEL",
      "text": "Rapunzel---."
    },
    {
      "character": "RAPUNZEL",
      "text": "Oh, come on."
    },
    {
      "character": "MOTHER GOTHEL",
      "text": "ENOUGH WITH THE LIGHTS, RAPUNZEL! YOU ARE NOT LEAVING THIS TOWER, EVER! Oh, great. Now I'm the bad guy."
    },
    {
      "character": "RAPUNZEL",
      "text": "All I was gonna say, mother, is that... I know what I want for my birthday, now."
    },
    {
      "character": "MOTHER GOTHEL",
      "text": "And what is that?"
    },
    {
      "character": "RAPUNZEL",
      "text": "New paint. That paint made from the white shells you once brought me."
    },
    {
      "character": "MOTHER GOTHEL",
      "text": "Well that is a very long trip, Rapunzel. Almost three day's time."
    },
    {
      "character": "RAPUNZEL",
      "text": "I just thought it was a better idea than, stars."
    },
    {
      "character": "MOTHER GOTHEL",
      "text": "You sure you'll be all right, on your own?"
    },
    {
      "character": "RAPUNZEL",
      "text": "I know I'm safe, as long as I'm here."
    },
    {
      "character": "MOTHER GOTHEL",
      "text": "I'll be back in three days time. I love you very much, dear."
    },
    {
      "character": "RAPUNZEL",
      "text": "I love you more."
    },
    {
      "character": "MOTHER GOTHEL",
      "text": "I love you most."
    },
    {
      "character": "RAPUNZEL",
      "text": "Okay."
    },
    {
      "character": "FLYNN",
      "text": "AHH! Wha..? Is this...hair?"
    },
    {
      "character": "RAPUNZEL",
      "text": "Struggling...struggling is pointless. I know why you're here. And I'm not afraid of you."
    },
    {
      "character": "FLYNN",
      "text": "What?"
    },
    {
      "character": "RAPUNZEL",
      "text": "Who are you, and how did you find me?"
    },
    {
      "character": "FLYNN",
      "text": "Ah hah."
    },
    {
      "character": "RAPUNZEL",
      "text": "Who are you, and how did you find me?"
    },
    {
      "character": "FLYNN",
      "text": "I know not who you are. Nor how I came to find you. But may I just say. Hi! How you doing? The names Flynn Ryder. How's your day going, huh?"
    },
    {
      "character": "RAPUNZEL",
      "text": "Who else knows my location, Flynn Ryder?"
    },
    {
      "character": "FLYNN",
      "text": "All right, Blondie."
    },
    {
      "character": "RAPUNZEL",
      "text": "Rapunzel."
    },
    {
      "character": "FLYNN",
      "text": "Gesundheit. Here's the thing. I was in a situation, Gallivanting through the forest. I can across your tower and...Ho, ho no, where is my satchel?"
    },
    {
      "character": "RAPUNZEL",
      "text": "I've hidden it, somewhere you'll never find it."
    },
    {
      "character": "FLYNN",
      "text": "It's in the pot, isn't it."
    },
    {
      "character": "FLYNN",
      "text": "Ugh! would you stop that?!"
    },
    {
      "character": "RAPUNZEL",
      "text": "Now it's hidden where you'll never find it. So, what do you want, with my hair? To cut it?"
    },
    {
      "character": "FLYNN",
      "text": "What?"
    },
    {
      "character": "RAPUNZEL",
      "text": "Sell it?"
    },
    {
      "character": "FLYNN",
      "text": "No! Listen, the only thing I want to do with your hair, is to get out of it. Literally!"
    },
    {
      "character": "RAPUNZEL",
      "text": "Wait, you don't want my hair?"
    },
    {
      "character": "FLYNN",
      "text": "Why on earth would I want your hair? Look, I was being chased, I saw a tower, I climbed it, end of story."
    },
    {
      "character": "RAPUNZEL",
      "text": "You're, telling the truth?"
    },
    {
      "character": "FLYNN",
      "text": "YES!"
    },
    {
      "character": "RAPUNZEL",
      "text": "okay Flynn Ryder,I'm prepared to offer you a deal."
    },
    {
      "character": "FLYNN",
      "text": "Deal?"
    },
    {
      "character": "RAPUNZEL",
      "text": "Look this way. Do you know what these are?"
    },
    {
      "character": "FLYNN",
      "text": "You mean the lantern thing they do for the princess?"
    },
    {
      "character": "RAPUNZEL",
      "text": "Lanterns... I knew they weren't stars. Well, tomorrow evening they will light the night sky, with these lanterns. You will act as my guide, Take me to these lanterns, and return me home safely. Then, and only then, will I return your satchel to you. That is my deal."
    },
    {
      "character": "FLYNN",
      "text": "Yeah, no can do. Unfortunately, the kingdom and I are not exactly, simpa"
    },
    {
      "character": "FLYNN",
      "text": "Deal?"
    },
    {
      "character": "RAPUNZEL",
      "text": "Look this way. Do you know what these are?"
    },
    {
      "character": "FLYNN",
      "text": "You mean the lantern thing they do for the princess?"
    },
    {
      "character": "RAPUNZEL",
      "text": "Lanterns... I knew they weren't stars. Well, tomorrow evening they will light the night sky, with these lanterns. You will act as my guide, Take me to these lanterns, and return me home safely. Then, and only then, will I return your satchel to you. That is my deal."
    },
    {
      "character": "FLYNN",
      "text": "Yeah, no can do. Unfortunately, the kingdom and I are not exactly, simpatico, at the moment. So I won't be taking you anywhere."
    },
    {
      "character": "RAPUNZEL",
      "text": "Something brought you here, Flynn Ryder. Call it what you will, fate, destiny."
    },
    {
      "character": "FLYNN",
      "text": "A horse."
    },
    {
      "character": "RAPUNZEL",
      "text": "So I have made the decision to trust you."
    },
    {
      "character": "FLYNN",
      "text": "A horrible decision, really."
    },
    {
      "character": "RAPUNZEL",
      "text": "But trust me, when I tell you this. You can tear this tower apart, brick by brick. but without my help, you will never find your precious satchel."
    },
    {
      "character": "FLYNN",
      "text": "Let me just get this straight. I take you to see the lanterns. Bring you back home. and you'll give me back my satchel?"
    },
    {
      "character": "RAPUNZEL",
      "text": "I promise. And when I promise something, I never ever break that promise. EVER!"
    },
    {
      "character": "FLYNN",
      "text": "All right, listen, I didn't want to have to want to do this, but you leave me no choice. Here comes the 'smolder'. This is kind of an off day for me.This doesn't normally happen. Fine, I'll take you to see the lanterns."
    },
    {
      "character": "RAPUNZEL",
      "text": "Really! Ooops."
    },
    {
      "character": "FLYNN",
      "text": "You broke my 'smolder'. You coming, Blondie?"
    },
    {
      "character": "RAPUNZEL",
      "text": "I can't believe I did this. (Mumbles) I can't believe I did this. I CAN'T BELIEVE I DID THIS! Mother will be so furious. That's okay though, what she doesn't know won't kill her, right? Oh my gosh, this will kill her. THIS IS SO FUN! I am a horrible dauughter, I'm going back. I am never going back! I am a despicable human being. WAHHOOOOO! Best day, ever! (Sobbing)"
    },
    {
      "character": "FLYNN",
      "text": "You know, I can't help but notice, you seem a little at war with yourself, here."
    },
    {
      "character": "RAPUNZEL",
      "text": "Really?"
    },
    {
      "character": "FLYNN",
      "text": "Now, I'm only picking up bits and pieces.Overprotective mother, forbidden road trip. This is serious stuff.But let me ease your conscience.This is part of growing up. A little rebellion, a little adventure. That's good, healthy even."
    },
    {
      "character": "RAPUNZEL",
      "text": "You think?"
    },
    {
      "character": "FLYNN",
      "text": "I know. You're way over thinking this, trust me. Does your mother deserve it? No Will this break her heart and crush her soul? Of course. But you just got to do it."
    },
    {
      "character": "RAPUNZEL",
      "text": "Break her heart?"
    },
    {
      "character": "FLYNN",
      "text": "In half."
    },
    {
      "character": "RAPUNZEL",
      "text": "Crush her soul?"
    },
    {
      "character": "FLYNN",
      "text": "Like a grape."
    },
    {
      "character": "RAPUNZEL",
      "text": "She would be heart broken, you're right."
    },
    {
      "character": "FLYNN",
      "text": "I am, aren't I? Oh, bother. All right, I can't believe I'm saying this, but...I'm letting you out of the deal."
    },
    {
      "character": "RAPUNZEL",
      "text": "What?"
    },
    {
      "character": "FLYNN",
      "text": "That's right. But don't thank me. Let's just turn around,and get you home, here's your pan, here's your frog. I get back my satchel. You get back a mother daughter relationship based on mutual trust and viola! We part ways as unlikely friends."
    },
    {
      "character": "RAPUNZEL",
      "text": "No, I am seeing those lanterns."
    },
    {
      "character": "FLYNN",
      "text": "Oh, come on! What is it going to take to get my satchel back?"
    },
    {
      "character": "RAPUNZEL",
      "text": "I will use this. Is it, ruffians, thugs? Have they come for me?!"
    },
    {
      "character": "FLYNN",
      "text": "Stay calm, it can probably smell fear."
    },
    {
      "character": "RAPUNZEL",
      "text": "Oh, sorry. Getting just a little bit, jumpy."
    },
    {
      "character": "FLYNN",
      "text": "Probably be best if we avoid ruffians and thugs, though."
    },
    {
      "character": "RAPUNZEL",
      "text": "Yeah, that's probably best."
    },
    {
      "character": "FLYNN",
      "text": "Are you hungry? I know a great place for lunch."
    },
    {
      "character": "RAPUNZEL",
      "text": "Where?"
    },
    {
      "character": "FLYNN",
      "text": "Oh, don't you worry. You'll know it when you smell it."
    },
    {
      "character": "MOTHER GOTHEL",
      "text": "Oh, a Palace horse. Where's your rider? Rapunzel."
    },
    {
      "character": "MOTHER GOTHEL",
      "text": "RAPUNZEL!"
    },
    {
      "character": "MOTHER GOTHEL",
      "text": "Rapunzel, let down your hair."
    },
    {
      "character": "MOTHER GOTHEL",
      "text": "Rapunzel?"
    },
    {
      "character": "MOTHER GOTHEL",
      "text": "RAPUNZEL? RAPUNZEL!"
    },
    {
      "character": "FLYNN",
      "text": "I know it's around here, somewhere. Ah, there it is. The Snuggly duckling. Don't worry, very quaint place, perfect for you. Don't want you scaring, and giving up on this endeavor now do we?"
    },
    {
      "character": "RAPUNZEL",
      "text": "Well, I do like ducklings."
    },
    {
      "character": "FLYNN",
      "text": "YAY! Garcon, your finest table, please. You smell that? Take a deep breath through the nose. Really, let that seep in. What are you getting? Because to me, it's part man smell and the other part is really bad man smell. I don't know why, but overall, it smells like the color brown. Your thoughts?"
    },
    {
      "character": "THUG",
      "text": "That's a lot of hair."
    },
    {
      "character": "FLYNN",
      "text": "She's growing it out, is that blood on your moustache? Goldie, look at this, look at all the blood on his moustache. Good sir, that's a lot of blood. Hey, you don't look so good, Blondie. Maybe we should get you home. Call it a day. Probably better off. This is a five star joint after all. And if you can't handle this place, well maybe you should be back in your tower."
    },
    {
      "character": "VLADIMIR",
      "text": "Is this you?"
    },
    {
      "character": "FLYNN",
      "text": "ugh, now they're just being mean."
    },
    {
      "character": "HOOK HAND",
      "text": "Oh, it's him all right. Greno, go find some guards. That reward is going to buy me a new hook."
    },
    {
      "character": "ATTILA",
      "text": "I can use the money."
    },
    {
      "character": "VLADIMIR",
      "text": "What about me? I'm broke. GET BACK!!"
    },
    {
      "character": "RAPUNZEL",
      "text": "Please, stop!"
    },
    {
      "character": "FLYNN",
      "text": "We can work this out."
    },
    {
      "character": "RAPUNZEL",
      "text": "Hey, leave him alone."
    },
    {
      "character": "FLYNN",
      "text": "Please."
    },
    {
      "character": "RAPUNZEL",
      "text": "Give me back my guide!! Ruffians!!"
    },
    {
      "character": "FLYNN",
      "text": "Not the nose, not the nose, not the nose!"
    },
    {
      "character": "RAPUNZEL",
      "text": "Put him down! Okay, I don't know where I am, and I need him to take me to see the lanterns, because I've been dreaming about them my entire life. Find your humanity! Haven't any of you ever had a dream?"
    },
    {
      "character": "GRENO",
      "text": "I found the guards!"
    },
    {
      "character": "CAPTAIN OF THE GUARD",
      "text": "Where's Ryder, where is he? I know he's in here somewhere. Find him, turn the place upside down if you have to!"
    },
    {
      "character": "HOOK HAND",
      "text": "Go, live your dream."
    },
    {
      "character": "FLYNN",
      "text": "I will."
    },
    {
      "character": "HOOK HAND",
      "text": "Your dream stinks, I was talking to her."
    },
    {
      "character": "RAPUNZEL",
      "text": "Thanks for everything."
    },
    {
      "character": "VLADIMIR",
      "text": "I believe this is the man you're looking for."
    },
    {
      "character": "SHORTY",
      "text": "You got me."
    },
    {
      "character": "GUARDS",
      "text": "Sir, there's no sign of Ryder."
    },
    {
      "character": "GUARDS",
      "text": "Maximus. What he's doing?"
    },
    {
      "character": "CAP",
      "text": "A passage, come on men, let's go. Conli, make sure those boys don't get away."
    },
    {
      "character": "SIDEBURNS",
      "text": "Play it safe. Or go get the crown."
    },
    {
      "character": "SHORTY",
      "text": "I got a dream, I got some dream. I-, Ohhh, somebody get me a glass. 'Cause I just found me a tall drink of water."
    },
    {
      "character": "MOTHER GOTHEL",
      "text": "Oh stop it, you big lug. Where's that tunnel lead out?"
    },
    {
      "character": "SHORTY",
      "text": "Knife!"
    },
    {
      "character": "FLYNN",
      "text": "Well, I've gotta say. Didn't know you had that in you back there, that was pretty...impressive."
    },
    {
      "character": "RAPUNZEL",
      "text": "I know! I know... Sooo, Flynn. Where are you from?"
    },
    {
      "character": "FLYNN",
      "text": "Whoa, whoa, sorry Blondie, I don't do back story. However I am becoming very interested in yours. Now I...I know I'm not suppose to mention the hair."
    },
    {
      "character": "RAPUNZEL",
      "text": "Nope."
    },
    {
      "character": "FLYNN",
      "text": "Or, the Mother."
    },
    {
      "character": "RAPUNZEL",
      "text": "Uh, uh."
    },
    {
      "character": "FLYNN",
      "text": "Frankly I'm too scared to ask about the frog."
    },
    {
      "character": "RAPUNZEL",
      "text": "Chameleon."
    },
    {
      "character": "FLYNN",
      "text": "Nuance. Here's my question, though, if you want to see the lanterns so badly, why haven't you gone before?"
    },
    {
      "character": "RAPUNZEL",
      "text": "Uhh, hey, well... Uh, Flynn... Flynn! Who's that?"
    },
    {
      "character": "FLYNN",
      "text": "They don't like me."
    },
    {
      "character": "RAPUNZEL",
      "text": "Who's that?"
    },
    {
      "character": "FLYNN",
      "text": "They don't like me either."
    },
    {
      "character": "RAPUNZEL",
      "text": "Who's that?"
    },
    {
      "character": "FLYNN",
      "text": "Lets just assume for the moment, that everyone here doesn't like me."
    },
    {
      "character": "RAPUNZEL",
      "text": "Here."
    },
    {
      "character": "CAPTAIN OF THE GUARD",
      "text": "I've waited a long time for this."
    },
    {
      "character": "FLYNN",
      "text": "Oh mama, I have got to get me one of these. HAH!"
    },
    {
      "character": "FLYNN",
      "text": "You should know, that this is the strangest thing I've ever done!-- How 'bout two out of three?"
    },
    {
      "character": "RAPUNZEL",
      "text": "Flynn!"
    },
    {
      "character": "RAPUNZEL",
      "text": "Flynn, look out!"
    },
    {
      "character": "FLYNN",
      "text": "HAH! You should see your faces 'cause you look...--- Ridiculous..."
    },
    {
      "character": "FLYNN",
      "text": "Come on, Blondie. Jump."
    },
    {
      "character": "FLYNN",
      "text": "It's no use, I can't see anything. Hey, there's no point. It's pitch black down there."
    },
    {
      "character": "RAPUNZEL",
      "text": "This is all my fault. She was right, I never should have done this. I'm so... I'm so sorry, Flynn."
    },
    {
      "character": "FLYNN",
      "text": "Eugene."
    },
    {
      "character": "RAPUNZEL",
      "text": "What?"
    },
    {
      "character": "FLYNN",
      "text": "My real name is, Eugene Fitzherbert. So you might as well know."
    },
    {
      "character": "RAPUNZEL",
      "text": "I have magic hair that glows when I sing."
    },
    {
      "character": "FLYNN",
      "text": "What?"
    },
    {
      "character": "RAPUNZEL",
      "text": "I have... magic hair, that glows when I sing! Flower gleam and glow. Let your power shine."
    },
    {
      "character": "RAPUNZEL",
      "text": "We made it."
    },
    {
      "character": "FLYNN",
      "text": "Your hair glows."
    },
    {
      "character": "RAPUNZEL",
      "text": "We're alive! We're alive!"
    },
    {
      "character": "FLYNN",
      "text": "Didn't see that coming."
    },
    {
      "character": "FLYNN",
      "text": "Her hair actually glows."
    },
    {
      "character": "RAPUNZEL",
      "text": "Eugene..."
    },
    {
      "character": "FLYNN",
      "text": "Why does her hair glow?"
    },
    {
      "character": "RAPUNZEL",
      "text": "Eugene!"
    },
    {
      "character": "FLYNN",
      "text": "WHAT?"
    },
    {
      "character": "RAPUNZEL",
      "text": "It doesn't just glow."
    },
    {
      "character": "FLYNN",
      "text": "Why is he smiling at me?"
    },
    {
      "character": "SIDEBURNS",
      "text": "I'll kill him. I'll kill that Ryder. We'll cut him off for the kingdom. Get back the crown, come on."
    },
    {
      "character": "MOTHER GOTHEL",
      "text": "Bo-oys!... perhaps you want to stop acting like wild dogs chasing their tails, and think for a moment. Oh, please there's no need for that. Well if that's all you desire, then be on your way! I was going to offer you something worth one thousand crowns, would have made you rich beyond belief. And that wasn't even the best part. Oh well, C'est la vie. Enjoy your crown."
    },
    {
      "character": "SIDEBURNS",
      "text": "What's the best part?"
    },
    {
      "character": "MOTHER GOTHEL",
      "text": "It comes with revenge on Flynn Ryder."
    },
    {
      "character": "FLYNN",
      "text": "So you're being strangely cryptic as you wrap your magic hair around my injured hand. (Grunts in pain)"
    },
    {
      "character": "RAPUNZEL",
      "text": "Sorry. Just don't...don't freak out."
    },
    {
      "character": "FLYNN",
      "text": "Ahhh!"
    },
    {
      "character": "RAPUNZEL",
      "text": "Please don't freak out."
    },
    {
      "character": "FLYNN",
      "text": "(Stifled) Ahhh. I'm not freaking out, are you freaking out? No, I'm just very interested in your hair and the magical qualities that it possesses..how long has it been doing that, exactly?"
    },
    {
      "character": "RAPUNZEL",
      "text": "Uh. Forever, I guess. Mother said when I was a baby people tried to cut it. They wanted to take it for themselves. But, once it's cut. It turns brown, and looses it's power. A gift like that, it has to be protected. That's why Mother never let me...That's why I...I never left the..."
    },
    {
      "character": "FLYNN",
      "text": "You never left that tower. And you're still gonna go back?"
    },
    {
      "character": "RAPUNZEL",
      "text": "No...yes. Ugh. It's complicated. So, Eugene Fitzherbert, huh?"
    },
    {
      "character": "FLYNN",
      "text": "Ah yeah, well. I'll spare you the sob story of poor orphan Eugene Fitzherbert, it's a little bit ah... It's a little bit of a downer. There was this book. A book I used to read every night to all the younger kids. The tales of Flynnigan Ryder. Swashbuckling rogue, richest man alive. Not bad with the ladies, either. Not that he'd ever brag about it, of course."
    },
    {
      "character": "RAPUNZEL",
      "text": "Was he a thief too?"
    },
    {
      "character": "EUGENE",
      "text": "Ahh, well no. Actually, he had enough money to do whatever he wanted to do. He could go wherever he wanted to go. And...and, for a kid, with nothing. I don't know, I... It just seemed like a better option. You can't tell anyone, about this, okay? It could ruin my whole reputation."
    },
    {
      "character": "RAPUNZEL",
      "text": "Ahh, you wouldn't want that."
    },
    {
      "character": "FLYNN",
      "text": "Oh, a fake reputation is all that a man has. Um, well I should uh... I, I should get some more firewood."
    },
    {
      "character": "RAPUNZEL",
      "text": "Hey. For the record, I like Eugene Fitzherbert much better than, Flynn Ryder."
    },
    {
      "character": "FLYNN",
      "text": "Well, then you'd be the first. But, thank you."
    },
    {
      "character": "MOTHER GOTHEL",
      "text": "Well, I thought he'd never leave."
    },
    {
      "character": "RAPUNZEL",
      "text": "Mother?"
    },
    {
      "character": "MOTHER GOTHEL",
      "text": "Hello, dear."
    },
    {
      "character": "RAPUNZEL",
      "text": "... How did you find me?"
    },
    {
      "character": "MOTHER GOTHEL",
      "text": "Oh, it was easy really. I just listened to the sound of complete and utter betrayal, and followed that.-"
    },
    {
      "character": "RAPUNZEL",
      "text": "Mother..."
    },
    {
      "character": "MOTHER GOTHEL",
      "text": "We're going home. Now."
    },
    {
      "character": "RAPUNZEL",
      "text": "You...You don't understand. I've been on the most incredible journey. I've seen and learned so much. I even met someone."
    },
    {
      "character": "MOTHER GOTHEL",
      "text": "Yes, the wanted thief. I'm so proud. Come on."
    },
    {
      "character": "RAPUNZEL",
      "text": "Mother, wait. I think... I think he likes me."
    },
    {
      "character": "MOTHER GOTHEL",
      "text": "Patience boys. All good things to those who wait."
    },
    {
      "character": "FLYNN",
      "text": "So, hey uh, can I ask you something? Is there any chance that I'm going to get super strength in my hand? Because I'm not going to lie - that would be stupendous. Hey, you all right?"
    },
    {
      "character": "RAPUNZEL",
      "text": "Oh, sorry, yes. Just um, lost in thought, I guess."
    },
    {
      "character": "FLYNN",
      "text": "I mean because here's the thing. Superhuman good looks, I've always had 'em. Born with it, but superhuman strength? Imagine the possibilities, I'm just..."
    },
    {
      "character": "FLYNN",
      "text": "Hmm, what? Well I hope you're here to apologize. AHHHH! No, no put me down. NO, NO!"
    },
    {
      "character": "RAPUNZEL",
      "text": "Release him."
    },
    {
      "character": "FLYNN",
      "text": "OW!"
    },
    {
      "character": "RAPUNZEL",
      "text": "Whoa! Whoa, whoa-whoa-whoa. Easy boy, easy, calm down. Easy boy. Easy. That's it. Now sit. Sit. Good, now drop the boot. Drop it. Oh, you are such a good boy. Yes you are. You all tired, chasing the bad man all over the place?"
    },
    {
      "character": "FLYNN",
      "text": "Excuse me."
    },
    {
      "character": "RAPUNZEL",
      "text": "Nobody appreciates you, do they? Do they?"
    },
    {
      "character": "FLYNN",
      "text": "Come one, he's a bad horse."
    },
    {
      "character": "RAPUNZEL",
      "text": "Aw, he's nothing but a big sweetheart. Isn't that right? Maximus."
    },
    {
      "character": "FLYNN",
      "text": "You've got to be kidding me."
    },
    {
      "character": "RAPUNZEL",
      "text": "Look, today is kinda the biggest day of my life. And I need, I need you not to get him arrested. Just for twenty four hours and then, you can chase each other to your hearts content. Okay? And it's also my birthday. Just so you know."
    },
    {
      "character": "RAPUNZEL",
      "text": "Thank you."
    },
    {
      "character": "FLYNN",
      "text": "Hey Max. What? I bought them. Most of them."
    },
    {
      "character": "RAPUNZEL",
      "text": "Where are we going?"
    },
    {
      "character": "FLYNN",
      "text": "Well, best day of your life. I figured you should have a decent seat. You okay?"
    },
    {
      "character": "RAPUNZEL",
      "text": "I'm terrified."
    },
    {
      "character": "FLYNN",
      "text": "Why?"
    },
    {
      "character": "RAPUNZEL",
      "text": "I've been looking out the window for eighteen years. Dreaming about what it would feel like when those lights rise in the sky. What if it's not everything that I dreamed it would be?"
    },
    {
      "character": "FLYNN",
      "text": "It will be."
    },
    {
      "character": "RAPUNZEL",
      "text": "And what if it is? What then?"
    },
    {
      "character": "FLYNN",
      "text": "Well that's the good part, I guess. You get to go find a new dream."
    },
    {
      "character": "RAPUNZEL",
      "text": "Is everything okay?"
    },
    {
      "character": "FLYNN",
      "text": "Huh? Oh yes. Uh, yes of course. I just...I'm sorry, everything is fine. There's just something I have to take care of."
    },
    {
      "character": "RAPUNZEL",
      "text": "Okay."
    },
    {
      "character": "FLYNN",
      "text": "I'll be right back."
    },
    {
      "character": "RAPUNZEL",
      "text": "It's all right, Pascal."
    },
    {
      "character": "FLYNN",
      "text": "Ahh, there you are. I've been searching everywhere for you guys. Since we got separated. Hey, the sideburns are coming in nice, huh? You gotta be excited about that. Anyhow, just wanted to say, I shouldn't have split. The crown is all yours. I'll miss you, but I think it's for the... best."
    },
    {
      "character": "SIDEBURNS",
      "text": "Holding out on us again? Hey, Ryder?"
    },
    {
      "character": "FLYNN",
      "text": "What?"
    },
    {
      "character": "SIDEBURNS",
      "text": "We heard you found something. Something much more valuable than a crown. We want her, instead."
    },
    {
      "character": "RAPUNZEL",
      "text": "I was starting to think you ran off with the crown and left me."
    },
    {
      "character": "SIDEBURNS",
      "text": "He did."
    },
    {
      "character": "RAPUNZEL",
      "text": "What? No. He wouldn't."
    },
    {
      "character": "SIDEBURNS",
      "text": "See for yourself."
    },
    {
      "character": "RAPUNZEL",
      "text": "Eugene? Eugene!"
    },
    {
      "character": "SIDEBURNS",
      "text": "Fair trade. A crown, for the girl with the magic hair. How much do you think someone will pay to stay young and healthy forever?"
    },
    {
      "character": "RAPUNZEL",
      "text": "No, please. NO! NO!"
    },
    {
      "character": "MOTHER GOTHEL",
      "text": "Rapunzel!"
    },
    {
      "character": "RAPUNZEL",
      "text": "Mother?"
    },
    {
      "character": "MOTHER GOTHEL",
      "text": "Oh, my precious girl. Are you all right? Are you hurt?"
    },
    {
      "character": "RAPUNZEL",
      "text": "How did you?"
    },
    {
      "character": "MOTHER GOTHEL",
      "text": "I was so worried about you dear. So I followed you. And I saw them attack you. Let's go, let's go before they come to."
    },
    {
      "character": "RAPUNZEL",
      "text": "You were right, mother. You were right about everything."
    },
    {
      "character": "MOTHER GOTHEL",
      "text": "I know darling. I know."
    },
    {
      "character": "GUARDS",
      "text": "Look! The crown."
    },
    {
      "character": "FLYNN",
      "text": "Rapunzel. RAPUNZEL! Wait, wait, wait. Guys, guys. Rapunzel!"
    },
    {
      "character": "MOTHER GOTHEL",
      "text": "Rapunzel!"
    },
    {
      "character": "RAPUNZEL",
      "text": "Mother?"
    },
    {
      "character": "MOTHER GOTHEL",
      "text": "Oh, my precious girl. Are you all right? Are you hurt?"
    },
    {
      "character": "RAPUNZEL",
      "text": "How did you?"
    },
    {
      "character": "MOTHER GOTHEL",
      "text": "I was so worried about you dear. So I followed you. And I saw them attack you. Let's go, let's go before they come to."
    },
    {
      "character": "RAPUNZEL",
      "text": "You were right, mother. You were right about everything."
    },
    {
      "character": "MOTHER GOTHEL",
      "text": "I know darling. I know."
    },
    {
      "character": "GUARDS",
      "text": "Look! The crown."
    },
    {
      "character": "FLYNN",
      "text": "Rapunzel. RAPUNZEL! Wait, wait, wait. Guys, guys. Rapunzel!"
    },
    {
      "character": "GUARDS",
      "text": "Let's get this over with, Rider."
    },
    {
      "character": "EUGENE",
      "text": "Where are we going? Oh..."
    },
    {
      "character": "MOTHER GOTHEL",
      "text": "There, it never happened. Now, wash up for dinner. I'm making hazelnut soup. I really did try, Rapunzel. I tried to warn you, what was out there. The world is dark, and selfish, and cruel. If it finds even the slightest ray of sunshine, It destroys it."
    },
    {
      "character": "EUGENE",
      "text": "How did you know about her?! Tell me, now!"
    },
    {
      "character": "SIDEBURNS",
      "text": "It wasn't us! It was the old lady!"
    },
    {
      "character": "FLYNN",
      "text": "Old lady? Wait, no, wait! You don't understand, she's in trouble. Wait!"
    },
    {
      "character": "MOTHER GOTHEL",
      "text": "Rapunzel? Rapunzel, what's going on up there? Are you all right?"
    },
    {
      "character": "RAPUNZEL",
      "text": "I'm the lost princess."
    },
    {
      "character": "MOTHER GOTHEL",
      "text": "Please, speak up, Rapunzel. You know how I hate the mumbling."
    },
    {
      "character": "RAPUNZEL",
      "text": "I am the lost princess! Aren't I?"
    },
    {
      "character": "RAPUNZEL",
      "text": "Did I mumble, Mother? (sneering) Or should I even call you that?"
    },
    {
      "character": "MOTHER GOTHEL",
      "text": "Rapunzel, do you even hear yourself? Why would you ask such a ridiculous question?"
    },
    {
      "character": "RAPUNZEL",
      "text": "It was you! It was all you!"
    },
    {
      "character": "MOTHER GOTHEL",
      "text": "Everything I did, was to protect you. Rapunzel!"
    },
    {
      "character": "RAPUNZEL",
      "text": "I spent my entire life!-- Hiding from people who would use me for my power."
    },
    {
      "character": "MOTHER GOTHEL",
      "text": "Rapunzel!"
    },
    {
      "character": "RAPUNZEL",
      "text": "I should have been hiding...from YOU!"
    },
    {
      "character": "MOTHER GOTHEL",
      "text": "Where will you go? He won't be there for you."
    },
    {
      "character": "RAPUNZEL",
      "text": "What did you do to him?"
    },
    {
      "character": "MOTHER GOTHEL",
      "text": "That criminal is to be hanged for his crimes."
    },
    {
      "character": "RAPUNZEL",
      "text": "No!"
    },
    {
      "character": "MOTHER GOTHEL",
      "text": "Now, now. It's all right. Listen to me. All of this is as it should be."
    },
    {
      "character": "RAPUNZEL",
      "text": "NO! You were wrong about the world! And you were wrong about me! And I will never let you use my hair AGAIN!"
    },
    {
      "character": "MOTHER GOTHEL",
      "text": "You want me to be the bad guy? Fine. Now I'm the bad, guy."
    },
    {
      "character": "GUARD",
      "text": "What's this? Open up."
    },
    {
      "character": "SHORTY",
      "text": "What's the password?"
    },
    {
      "character": "GUARD",
      "text": "What?"
    },
    {
      "character": "SHORTY",
      "text": "Nope."
    },
    {
      "character": "GUARD",
      "text": "Open this door."
    },
    {
      "character": "SHORTY",
      "text": "Not even close."
    },
    {
      "character": "GUARD",
      "text": "You have three seconds. One...Two...Three..."
    },
    {
      "character": "EUGENE",
      "text": "Frying pans. Who knew, right?"
    },
    {
      "character": "HOOK HAND",
      "text": "Head down."
    },
    {
      "character": "EUGENE",
      "text": "Head down."
    },
    {
      "character": "HOOK HAND",
      "text": "Arms in."
    },
    {
      "character": "EUGENE",
      "text": "Arms in"
    },
    {
      "character": "HOOK HAND",
      "text": "Knees apart"
    },
    {
      "character": "EUGENE",
      "text": "Knees apart. Knees apart? Why do I need to keep my..."
    },
    {
      "character": "FLYNN",
      "text": "Max. You brought them here? Thank you. No really, thank you. Uh, I feel maybe this whole time we've just been misunderstanding one another. And we really just, yeah youre right. We should go. Max!"
    },
    {
      "character": "FLYNN",
      "text": "Okay Max, lets see how fast you can run."
    },
    {
      "character": "FLYNN",
      "text": "Rapunzel? Rapunzel, let down your hair."
    },
    {
      "character": "FLYNN",
      "text": "Rapunzel, I thought I'd never see you again."
    },
    {
      "character": "RAPUNZEL",
      "text": "Look out!"
    },
    {
      "character": "RAPUNZEL",
      "text": "Eugene's name through the gag"
    },
    {
      "character": "MOTHER GOTHEL",
      "text": "Now look what you've done, Rapunzel. Oh don't worry dear. Our secret will die with him. And as for us? We are going where no one will ever find you, again. Rapunzel, REALLY! ENOUGH ALREADY! STOP. FIGHTING ME!"
    },
    {
      "character": "RAPUNZEL",
      "text": "NO! I won't stop. For every minute of the rest of my life I will fight. I will never stop trying to get away from you. But, if you let me save him... I will go with you."
    },
    {
      "character": "FLYNN",
      "text": "No. No, Rapunzel..."
    },
    {
      "character": "RAPUNZEL",
      "text": "I'll never run, I'll never try to escape. Just let me heal him. And you and I will be together. Forever, just like you want. Everything will be the way it was. I promise. Just like you want. Just let me heal him."
    },
    {
      "character": "MOTHER GOTHEL",
      "text": "In case you get any ideas about following us."
    },
    {
      "character": "RAPUNZEL",
      "text": "Eugene! Oh, I'm so sorry. Everything is going to okay, though."
    },
    {
      "character": "FLYNN",
      "text": "No, Rapunzel!"
    },
    {
      "character": "RAPUNZEL",
      "text": "I promise, you have to trust me."
    },
    {
      "character": "FLYNN",
      "text": "No...I can't let you do this."
    },
    {
      "character": "RAPUNZEL",
      "text": "But I can't let you die."
    },
    {
      "character": "FLYNN",
      "text": "But if you do this..."
    },
    {
      "character": "RAPUNZEL",
      "text": "Shhh."
    },
    {
      "character": "EUGENE",
      "text": "Then you...will die."
    },
    {
      "character": "RAPUNZEL",
      "text": "Hey. It's gonna be all right."
    },
    {
      "character": "EUGENE",
      "text": "Rapunzel, wait..."
    },
    {
      "character": "RAPUNZEL",
      "text": "Eugene, what..."
    },
    {
      "character": "MOTHER GOTHEL",
      "text": "NOOO! Oh No...NO! What have you done?!"
    },
    {
      "character": "MOTHER GOTHEL",
      "text": "WHAT HAVE YOU DONE?!"
    },
    {
      "character": "MOTHER GOTHEL",
      "text": "No, no, no, NOOO!"
    },
    {
      "character": "RAPUNZEL",
      "text": "No, no, no, no, Eugene...."
    },
    {
      "character": "RAPUNZEL",
      "text": "Oh, look at me, look at me, I'm right here."
    },
    {
      "character": "RAPUNZEL",
      "text": "Don't go, stay with me, Eugene...."
    },
    {
      "character": "EUGENE",
      "text": "Rapunzel..."
    },
    {
      "character": "RAPUNZEL",
      "text": "what...?"
    },
    {
      "character": "FLYNN",
      "text": "...you were my new dream..."
    },
    {
      "character": "RAPUNZEL",
      "text": "*sniff*...and you were mine."
    },
    {
      "character": "EUGENE",
      "text": "Rapunzel?"
    },
    {
      "character": "RAPUNZEL",
      "text": "Eugene."
    },
    {
      "character": "EUGENE",
      "text": "Did I ever tell you, I've got a thing for brunettes?"
    },
    {
      "character": "RAPUNZEL",
      "text": "Eugene!"
    },
    {
      "character": "EUGENE",
      "text": "Well, you could imagine what happened next. The kingdom rejoiced. The lost Princess had returned. The party lasted an entire week. And, honestly I don't remember much of it. Dreams came true all over the place. That guy went on to become the most famous concert pianist in the world. And this guy? Well he eventually found some to love. As for this guy, well, I assume he's happy. He's never told me otherwise. Thanks to Maximus, crime in the kingdom disappeared almost over night. As did most of the apples. Pascal, never changed. At last Rapunzel was home, and she finally had a real family. She was a Princess worth waiting for. But above all, she led her kingdom with all the grace and wisdom that her parents did before her. And as for me, well. I started going by Eugene again. Stopped thieving, basically turned it all around. But I know what the big question is; did Rapunzel and I ever get married? Well I'm pleased to tell you. After years, and years of asking, and asking, and asking. I finally said yes."
    },
    {
      "character": "RAPUNZEL",
      "text": "Eugene"
    },
    {
      "character": "EUGENE",
      "text": "All right, I asked her."
    },
    {
      "character": "RAPUNZEL",
      "text": "And we're living happily ever after."
    }
  ],
  "lineCount": 428,
  "characterCount": 16,
  "topCastCount": 9
}
